Repository: python/python-docs-tr
Catalog: faq/gui.po
Languages: tr

source: Graphic User Interface FAQ
tr: Grafik Kullanıcı Arayüzü SSS

source: Contents
tr: İçerikler

source: General GUI Questions
tr: Genel GKA Soruları

source: What GUI toolkits exist for Python?
tr: Python için hangi GKA araç setleri var?

source: Standard builds of Python include an object-oriented interface to the Tcl/Tk widget set, called :ref:`tkinter <Tkinter>`. This is probably the easiest to install (since it comes included with most `binary distributions <https://www.python.org/downloads/>`_ of Python) and use. For more info about Tk, including pointers to the source, see the `Tcl/Tk home page <https://www.tcl.tk>`_. Tcl/Tk is fully portable to the macOS, Windows, and Unix platforms.
tr: Python'un standart yapıları, :ref:`tkinter <Tkinter>` adlı Tcl/Tk pencere öğesi kümesine yönelik nesne yönelimli bir arayüz içerir. Bu muhtemelen kurulumu ve kullanımı en kolay olanıdır (çünkü çoğu Python'ın `ikili dağıtımlar <https://www.python.org/downloads/>`_ kısmında bulunur) ve kullanılandır. Kaynak işaretçiler de dahil olmak üzere Tk hakkında daha fazla bilgi için `Tcl/Tk ana sayfasına <https://www.tcl.tk>`_ bakın. Tcl/Tk, macOS, Windows ve Unix platformlarına tamamen taşınabilir.

source: Depending on what platform(s) you are aiming at, there are also several alternatives. A `list of cross-platform <https://wiki.python.org/moin/GuiProgramming#Cross-Platform_Frameworks>`_ and `platform-specific <https://wiki.python.org/moin/GuiProgramming#Platform-specific_Frameworks>`_ GUI frameworks can be found on the python wiki.
tr: Hangi platformları hedeflediğinize bağlı olarak, birkaç alternatif de mevcuttur. Bir `cross-platform listesi <https://wiki.python.org/moin/GuiProgramming#Cross-Platform_Frameworks>`_ ve `spesifik platform <https://wiki.python.org/moin/GuiProgramming#Platform-specific_Frameworks>`_ GKA çerçeveleri Python Wiki'de bulunabilir.

source: Tkinter questions
tr: Tkinter soruları

source: How do I freeze Tkinter applications?
tr: Tkinter uygulamalarını nasıl dondurabilirim?

source: Freeze is a tool to create stand-alone applications. When freezing Tkinter applications, the applications will not be truly stand-alone, as the application will still need the Tcl and Tk libraries.
tr: Dondurma işlemi, tek başına bağımsız uygulamalar oluşturmak için bir araçtır. Tkinter uygulamalarını dondururken, uygulama hala Tcl ve Tk kütüphanelerine ihtiyaç duyacağından, uygulamalar gerçekten bağımsız olmayacaktır.

source: One solution is to ship the application with the Tcl and Tk libraries, and point to them at run-time using the :envvar:`TCL_LIBRARY` and :envvar:`TK_LIBRARY` environment variables.
tr: Çözümlerden biri, uygulamayı Tcl ve Tk kütüphaneleri ile birlikte göndermek ve çalışma zamanında :envvar:`TCL_LIBRARY` ve :envvar:`TK_LIBRARY` ortam değişkenlerini kullanarak onlara işaret etmektir.

source: To get truly stand-alone applications, the Tcl scripts that form the library have to be integrated into the application as well. One tool supporting that is SAM (stand-alone modules), which is part of the Tix distribution (https://tix.sourceforge.net/).
tr: Gerçekten bağımsız uygulamalar elde etmek için kütüphaneyi oluşturan Tcl betiklerinin de uygulamaya entegre edilmesi gerekir. Bunu destekleyen araçlardan biri, Tix dağıtımının (http://tix.sourceforge.net/) 'in bir parçası olan SAM'dir (bağımsız modüller).

source: Build Tix with SAM enabled, perform the appropriate call to :c:func:`Tclsam_init`, etc. inside Python's :file:`Modules/tkappinit.c`, and link with libtclsam and libtksam (you might include the Tix libraries as well).
tr: SAM etkinken Tix oluşturun, Python'un :file:`Modules/tkappinit.c` içindeki :c:func:`Tclsam_init` vb. için uygun çağrıyı yapın ve libtclsam ve libtksam ile bağlantı kurun (Tix kütüphanelerini da dahil edebilirsiniz) ).

source: Can I have Tk events handled while waiting for I/O?
tr: G/Ç'yi beklerken Tk olaylarını işleyebilir miyim?

source: On platforms other than Windows, yes, and you don't even need threads! But you'll have to restructure your I/O code a bit. Tk has the equivalent of Xt's :c:func:`XtAddInput()` call, which allows you to register a callback function which will be called from the Tk mainloop when I/O is possible on a file descriptor. See :ref:`tkinter-file-handlers`.
tr: Windows dışındaki platformlarda, evet ve iş parçacığına bile ihtiyacınız yok! Ancak G/Ç kodunuzu tekrardan yapılandırmanız gerekecek. Tk, Xt'nin :c:func:`XtAddInput()` çağrısına eş değerdir; bu, bir dosya tanıtıcısında G/Ç mümkün olduğunda Tk ana döngüsünden çağrılacak bir geri arama işlevini kaydetmenize olanak tanır. Bkz. :ref:`tkinter-file-handlers`.

source: I can't get key bindings to work in Tkinter: why?
tr: Tkinter'da çalışmak için anahtar bağlamalarını alamıyorum: neden?

source: An often-heard complaint is that event handlers bound to events with the :meth:`bind` method don't get handled even when the appropriate key is pressed.
tr: Sıkça duyulan bir şikayet, :meth:`bind` yöntemiyle olaylara bağlanan işleyicilerin uygun tuşa basıldığında bile işlenmemesidir.

source: The most common cause is that the widget to which the binding applies doesn't have "keyboard focus". Check out the Tk documentation for the focus command. Usually a widget is given the keyboard focus by clicking in it (but not for labels; see the takefocus option).
tr: En yaygın neden, bağlamanın uygulandığı pencere öğesinin "klavye odağına" sahip olmamasıdır. Focus komutu için Tk dokümantasyonuna bakın. Genellikle Wigdet'lara tıklanılarak klavye odağı verilir (ancak etiketler için değil; odak alma seçeneğine bakın).
