Repository: python/python-docs-tr
Catalog: faq/installed.po
Languages: tr

source: "Why is Python Installed on my Computer?" FAQ
tr: "Python Bilgisayarımda Neden Yüklü?" SSS

source: What is Python?
tr: Python nedir?

source: Python is a programming language. It's used for many different applications. It's used in some high schools and colleges as an introductory programming language because Python is easy to learn, but it's also used by professional software developers at places such as Google, NASA, and Lucasfilm Ltd.
tr: Python bir programlama dilidir. Birçok farklı uygulama için kullanılır. Python'un öğrenilmesi kolay olduğu için bazı lise ve üniversitelerdeprogramlamaya giriş dili olarak kullanılır, ancak aynı zamanda Google, NASA ve Lucasfilm Ltd. gibi yerlerde profesyonel yazılım geliştiriciler tarafından da kullanılır.

source: If you wish to learn more about Python, start with the `Beginner's Guide to Python <https://wiki.python.org/moin/BeginnersGuide>`_.
tr: Python hakkında daha fazla bilgi edinmek istiyorsanız, `Beginner's Guide to Python <https://wiki.python.org/moin/BeginnersGuide>`_ ile başlayın.

source: Why is Python installed on my machine?
tr: Python makinemde neden yüklü?

source: If you find Python installed on your system but don't remember installing it, there are several possible ways it could have gotten there.
tr: Python'un sisteminizde yüklü olduğunu görüyor ancak yüklediğinizi hatırlamıyorsanız, Python'un sisteminize girmesinin birkaç olası yolu vardır.

source: Perhaps another user on the computer wanted to learn programming and installed it; you'll have to figure out who's been using the machine and might have installed it.
tr: Belki de bilgisayardaki başka bir kullanıcı programlama öğrenmek istedi ve bunu yükledi; makineyi kimin kullandığını ve bunu kimin yüklemiş olabileceğini bulmanız gerekecek.

source: A third-party application installed on the machine might have been written in Python and included a Python installation. There are many such applications, from GUI programs to network servers and administrative scripts.
tr: Makineye yüklenen üçüncü parti bir uygulama Python ile yazılmış ve bir Python yüklemesi içeriyor olabilir. GUI programlarından ağ sunucularına ve yönetim komut dosyalarına kadar bu tür birçok uygulama vardır.

source: Some Windows machines also have Python installed. At this writing we're aware of computers from Hewlett-Packard and Compaq that include Python. Apparently some of HP/Compaq's administrative tools are written in Python.
tr: Bazı Windows makinelerde Python da yüklüdür. Bu yazıyı yazarken Hewlett-Packard ve Compaq'ın Python içeren bilgisayarlarından haberdarız. Görünüşe göre HP/Compaq'ın bazı yönetim araçları Python ile yazılmış.

source: Many Unix-compatible operating systems, such as macOS and some Linux distributions, have Python installed by default; it's included in the base installation.
tr: MacOS ve bazı Linux dağıtımları gibi Unix uyumlu birçok işletim sisteminde Python varsayılan olarak yüklüdür; temel kuruluma dahildir.

source: Can I delete Python?
tr: Python'u silebilir miyim?

source: That depends on where Python came from.
tr: Bu Python'un nereden geldiğine bağlıdır.

source: If someone installed it deliberately, you can remove it without hurting anything. On Windows, use the Add/Remove Programs icon in the Control Panel.
tr: Birisi kasıtlı olarak yüklediyse, hiçbir şeye zarar vermeden kaldırabilirsiniz. Windows'ta, Denetim Masası'ndaki Program Ekle/Kaldır simgesini kullanın.

source: If Python was installed by a third-party application, you can also remove it, but that application will no longer work. You should use that application's uninstaller rather than removing Python directly.
tr: Python üçüncü parti bir uygulama tarafından yüklenmişse, onu da kaldırabilirsiniz, ancak bu uygulama artık çalışmayacaktır. Python'u doğrudan kaldırmak yerine o uygulamanın kaldırıcısını kullanmalısınız.

source: If Python came with your operating system, removing it is not recommended. If you remove it, whatever tools were written in Python will no longer run, and some of them might be important to you. Reinstalling the whole system would then be required to fix things again.
tr: Python işletim sisteminizle birlikte geliyorsa, kaldırılması önerilmez. Kaldırırsanız, Python'da yazılmış olan araçlar artık çalışmayacaktır ve bunlardan bazıları sizin için önemli olabilir. Bu durumda işleri tekrar düzeltmek için tüm sistemi yeniden yüklemek gerekecektir.
