Repository: python/python-docs-tr
Catalog: whatsnew/3.8.po
Languages: tr

source: The duality of ``Modules/Setup.dist`` and ``Modules/Setup`` has been removed. Previously, when updating the CPython source tree, one had to manually copy ``Modules/Setup.dist`` (inside the source tree) to ``Modules/Setup`` (inside the build tree) in order to reflect any changes upstream. This was of a small benefit to packagers at the expense of a frequent annoyance to developers following CPython development, as forgetting to copy the file could produce build failures.
tr: ``Modules/Setup.dist`` ve ``Modules/Setup`` ikiliği kaldırıldı. Önceden, CPython kaynak ağacını güncellerken, yukarı akıştaki değişiklikleri yansıtmak için ``Modules/Setup.dist`` dosyasını (kaynak ağacının içinde) ``Modules/Setup`` dosyasına (derleme ağacının içinde) manuel olarak kopyalamak gerekiyordu. Bu, CPython geliştirmesini takip eden geliştiriciler için sık sık can sıkıntısı pahasına paketleyicilere küçük bir fayda sağlıyordu, çünkü dosyayı kopyalamayı unutmak derleme hatalarına neden olabiliyordu.

source: Now the build system always reads from ``Modules/Setup`` inside the source tree. People who want to customize that file are encouraged to maintain their changes in a git fork of CPython or as patch files, as they would do for any other change to the source tree.
tr: Artık derleme sistemi her zaman kaynak ağacının içindeki ``Modules/Setup`` dosyasını okuyor. Bu dosyayı özelleştirmek isteyen kişilerin, değişikliklerini CPython'un bir git çatalında veya kaynak ağacındaki diğer değişiklikler için yapacakları gibi yama dosyaları olarak sürdürmeleri teşvik edilir.

source: (Contributed by Antoine Pitrou in :issue:`32430`.)
tr: (Antoine Pitrou'nun :issue:`32388` 'deki katkısıyla.)

source: Functions that convert Python number to C integer like :c:func:`PyLong_AsLong` and argument parsing functions like :c:func:`PyArg_ParseTuple` with integer converting format units like ``'i'`` will now use the :meth:`~object.__index__` special method instead of :meth:`~object.__int__`, if available. The deprecation warning will be emitted for objects with the ``__int__()`` method but without the ``__index__()`` method (like :class:`~decimal.Decimal` and :class:`~fractions.Fraction`). :c:func:`PyNumber_Check` will now return ``1`` for objects implementing ``__index__()``. :c:func:`PyNumber_Long`, :c:func:`PyNumber_Float` and :c:func:`PyFloat_AsDouble` also now use the ``__index__()`` method if available. (Contributed by Serhiy Storchaka in :issue:`36048` and :issue:`20092`.)
tr: :c:func:`PyLong_AsLong` gibi Python sayısını C tamsayısına dönüştüren fonksiyonlar ve :c:func:`PyArg_ParseTuple` gibi ``'i'`` gibi tamsayı dönüştürme format birimlerine sahip argüman ayrıştırma fonksiyonları artık mümkünse :meth:`~object.__int__` yerine :meth:`~object.__index__` özel metodunu kullanacaktır. Kullanımdan kaldırma uyarısı, ``__int__()`` yöntemi olan ancak ``index__()`` yöntemi olmayan nesneler (:class:`~decimal.Decimal` ve :class:`~fractions.Fraction` gibi) için verilecektir. :c:func:`PyNumber_Check` artık ``__index__()`` yöntemini uygulayan nesneler için ``1`` değerini döndürecektir. :c:func:`PyNumber_Long`, :c:func:`PyNumber_Float` ve :c:func:`PyFloat_AsDouble` artık mümkünse ``__index__()`` yöntemini de kullanmaktadır. (Serhiy Storchaka'nın :issue:`36048` ve :issue:`20092` 'deki katkılarıyla.)

source: Heap-allocated type objects will now increase their reference count in :c:func:`PyObject_Init` (and its parallel macro ``PyObject_INIT``) instead of in :c:func:`PyType_GenericAlloc`. Types that modify instance allocation or deallocation may need to be adjusted. (Contributed by Eddie Elizondo in :issue:`35810`.)
tr: Yığın tahsisli tip nesneleri artık referans sayılarını :c:func:`PyType_GenericAlloc` yerine :c:func:`PyObject_Init` (ve paralel makrosu ``PyObject_INIT``) içinde artıracaktır. Örnek paylaştırma veya serbest bırakma işlemini değiştiren türlerin ayarlanması gerekebilir. (Eddie Elizondo'nun :issue:`35810` 'daki katkısıyla.)

source: The new function :c:func:`PyCode_NewWithPosOnlyArgs` allows to create code objects like :c:func:`PyCode_New`, but with an extra *posonlyargcount* parameter for indicating the number of positional-only arguments. (Contributed by Pablo Galindo in :issue:`37221`.)
tr: Yeni :c:func:`PyCode_NewWithPosOnlyArgs` fonksiyonu, :c:func:`PyCode_New` gibi kod nesneleri oluşturmaya izin verir, ancak yalnızca konumsal bağımsız değişkenlerin sayısını belirtmek için fazladan bir *posonlyargcount* parametresi içerir. (Pablo Galindo'nun :issue:`37221` 'deki katkısıyla.)

source: :c:func:`Py_SetPath` now sets :data:`sys.executable` to the program full path (:c:func:`Py_GetProgramFullPath`) rather than to the program name (:c:func:`Py_GetProgramName`). (Contributed by Victor Stinner in :issue:`38234`.)
tr: :c:func:`Py_SetPath` artık :data:`sys.executable` 'ı program adına (:c:func:`Py_GetProgramName`) yerine programın tam yoluna (:c:func:`Py_GetProgramFullPath`) ayarlıyor. (Victor Stinner'ın :issue:`38234` 'teki katkısıyla.)

source: Deprecated
tr: Kullanımdan kaldırıldı

source: The distutils ``bdist_wininst`` command is now deprecated, use ``bdist_wheel`` (wheel packages) instead. (Contributed by Victor Stinner in :issue:`37481`.)
tr: Distutils ``bdist_wininst`` komutu artık kullanımdan kaldırılmıştır, bunun yerine ``bdist_wheel`` (tekerlek paketleri) kullanın. (Victor Stinner'ın :issue:`37481` 'deki katkısıyla.)

source: Deprecated methods ``getchildren()`` and ``getiterator()`` in the :mod:`~xml.etree.ElementTree` module now emit a :exc:`DeprecationWarning` instead of :exc:`PendingDeprecationWarning`. They will be removed in Python 3.9. (Contributed by Serhiy Storchaka in :issue:`29209`.)
tr: :mod:`~xml.etree.ElementTree` modülündeki kullanımdan kaldırılan ``getchildren()`` ve ``getiterator()`` yöntemleri artık :exc:`PendingDeprecationWarning` yerine bir :exc:`DeprecationWarning` yayıyor. Python 3.9'da kaldırılacaklar. (Serhiy Storchaka'nın :issue:`29209` 'daki katkısıyla.)

source: Passing an object that is not an instance of :class:`concurrent.futures.ThreadPoolExecutor` to :meth:`loop.set_default_executor() <asyncio.loop.set_default_executor>` is deprecated and will be prohibited in Python 3.9. (Contributed by Elvis Pranskevichus in :issue:`34075`.)
tr: Bir :class:`concurrent.futures.ThreadPoolExecutor` örneği olmayan bir nesneyi :meth:`loop.set_default_executor() <asyncio.loop.set_default_executor>` 'a geçirmek kullanımdan kaldırılmıştır ve Python 3.9'da yasaklanacaktır. (Elvis Pranskevichus'un :issue:`34075` 'teki katkısıyla.)

source: The :meth:`__getitem__` methods of :class:`xml.dom.pulldom.DOMEventStream`, :class:`wsgiref.util.FileWrapper` and :class:`fileinput.FileInput` have been deprecated.
tr: :class:`xml.dom.pulldom.DOMEventStream`, :class:`wsgiref.util.FileWrapper` ve :class:`fileinput.FileInput` metotlarının :meth:`__getitem__` metotları kullanımdan kaldırılmıştır.

source: Implementations of these methods have been ignoring their *index* parameter, and returning the next item instead. (Contributed by Berker Peksag in :issue:`9372`.)
tr: Bu yöntemlerin uygulamaları *index* parametresini yok saymakta ve bunun yerine bir sonraki öğeyi döndürmektedir. (Berker Peksag'ın :issue:`9372` 'deki katkısıyla.)

source: The :class:`typing.NamedTuple` class has deprecated the ``_field_types`` attribute in favor of the ``__annotations__`` attribute which has the same information. (Contributed by Raymond Hettinger in :issue:`36320`.)
tr: :class:`typing.NamedTuple` sınıfı, aynı bilgileri içeren ``__annotations__`` niteliği lehine ``_field_types`` niteliğini kullanımdan kaldırmıştır. (Raymond Hettinger'ın :issue:`36320` 'deki katkısıyla.)

source: :mod:`ast` classes ``Num``, ``Str``, ``Bytes``, ``NameConstant`` and ``Ellipsis`` are considered deprecated and will be removed in future Python versions. :class:`~ast.Constant` should be used instead. (Contributed by Serhiy Storchaka in :issue:`32892`.)
tr: :mod:`ast` sınıfları ``Num``, ``Str``, ``Bytes``, ``NameConstant`` ve ``Ellipsis`` kullanımdan kaldırılmıştır ve gelecek Python sürümlerinde kaldırılacaktır. Yerine :class:`~ast.Constant` kullanılmalıdır. (Serhiy Storchaka'nın :issue:`32892` 'deki katkısıyla.)

source: :class:`ast.NodeVisitor` methods ``visit_Num()``, ``visit_Str()``, ``visit_Bytes()``, ``visit_NameConstant()`` and ``visit_Ellipsis()`` are deprecated now and will not be called in future Python versions. Add the :meth:`~ast.NodeVisitor.visit_Constant` method to handle all constant nodes. (Contributed by Serhiy Storchaka in :issue:`36917`.)
tr: :class:`ast.NodeVisitor` metotları ``visit_Num()``, ``visit_Str()``, ``visit_Bytes()``, ``visit_NameConstant()`` ve ``visit_Ellipsis()`` artık kullanımdan kaldırılmıştır ve gelecekteki Python sürümlerinde çağrılmayacaktır. Tüm sabit düğümleri işlemek için :meth:`~ast.NodeVisitor.visit_Constant` yöntemini ekleyin. (Serhiy Storchaka'nın :issue:`36917` 'deki katkısıyla.)

source: The :func:`asyncio.coroutine` :term:`decorator` is deprecated and will be removed in version 3.10. Instead of ``@asyncio.coroutine``, use :keyword:`async def` instead. (Contributed by Andrew Svetlov in :issue:`36921`.)
tr: :func:`asyncio.coroutine` :term:`decorator` kullanımdan kaldırılmıştır ve 3.10 sürümünde kaldırılacaktır. ``@asyncio.coroutine`` yerine :keyword:`async def` kullanın. (Andrew Svetlov'un :issue:`36921` 'deki katkısıyla.)

source: In :mod:`asyncio`, the explicit passing of a *loop* argument has been deprecated and will be removed in version 3.10 for the following: :func:`asyncio.sleep`, :func:`asyncio.gather`, :func:`asyncio.shield`, :func:`asyncio.wait_for`, :func:`asyncio.wait`, :func:`asyncio.as_completed`, :class:`asyncio.Task`, :class:`asyncio.Lock`, :class:`asyncio.Event`, :class:`asyncio.Condition`, :class:`asyncio.Semaphore`, :class:`asyncio.BoundedSemaphore`, :class:`asyncio.Queue`, :func:`asyncio.create_subprocess_exec`, and :func:`asyncio.create_subprocess_shell`.
tr: :mod:`asyncio` içinde, bir *loop* argümanının açıkça geçilmesi kullanımdan kaldırılmıştır ve 3.10 sürümünde aşağıdakiler için kaldırılacaktır: :func:`asyncio.sleep`, :func:`asyncio.gather`, :func:`asyncio.shield`, :func:`asyncio.wait_for`, :func:`asyncio.wait`, :func:`asyncio.as_completed`, :class:`asyncio.Task`, :class:`asyncio.Lock`, :class:`asyncio.Event`, :class:`asyncio.Condition`, :class:`asyncio.Semaphore`, :class:`asyncio.BoundedSemaphore`, :class:`asyncio.Queue`, :func:`asyncio.create_subprocess_exec`, ve :func:`asyncio.create_subprocess_shell`.

source: The explicit passing of coroutine objects to :func:`asyncio.wait` has been deprecated and will be removed in version 3.11. (Contributed by Yury Selivanov in :issue:`34790`.)
tr: Korutin nesnelerinin :func:`asyncio.wait` 'e açık bir şekilde aktarılması kullanımdan kaldırılmıştır ve 3.11 sürümünde kaldırılacaktır (Yury Selivanov'un :issue:`34790` 'daki katkısıyla.)

source: The following functions and methods are deprecated in the :mod:`gettext` module: :func:`~gettext.lgettext`, :func:`~gettext.ldgettext`, :func:`~gettext.lngettext` and :func:`~gettext.ldngettext`. They return encoded bytes, and it's possible that you will get unexpected Unicode-related exceptions if there are encoding problems with the translated strings. It's much better to use alternatives which return Unicode strings in Python 3. These functions have been broken for a long time.
tr: Aşağıdaki fonksiyonlar ve yöntemler :mod:`gettext` modülünde kullanımdan kaldırılmıştır: :func:`~gettext.lgettext`, :func:`~gettext.ldgettext`, :func:`~gettext.lngettext` ve :func:`~gettext.ldngettext`. Bunlar kodlanmış baytlar döndürür ve çevrilen dizelerde kodlama sorunları varsa Unicode ile ilgili beklenmedik istisnalar almanız olasıdır. Python 3'te Unicode dizgileri döndüren alternatifleri kullanmak çok daha iyidir. Bu fonksiyonlar uzun süredir bozuk.

source: Function :func:`~gettext.bind_textdomain_codeset`, methods :meth:`~gettext.NullTranslations.output_charset` and :meth:`~gettext.NullTranslations.set_output_charset`, and the *codeset* parameter of functions :func:`~gettext.translation` and :func:`~gettext.install` are also deprecated, since they are only used for the ``l*gettext()`` functions. (Contributed by Serhiy Storchaka in :issue:`33710`.)
tr: :func:`~gettext.bind_textdomain_codeset` fonksiyonu, :meth:`~gettext.NullTranslations.output_charset` ve :meth:`~gettext.NullTranslations.set_output_charset` yöntemleri ve :func:`~gettext.translation` ve :func:`~gettext.install` fonksiyonlarının *codeset* parametresi de yalnızca ``l*gettext()`` fonksiyonları için kullanıldığından kullanımdan kaldırılmıştır. (Serhiy Storchaka'nın :issue:`33710` 'daki katkısıyla.)

source: The :meth:`~threading.Thread.isAlive()` method of :class:`threading.Thread` has been deprecated. (Contributed by Dong-hee Na in :issue:`35283`.)
tr: :class:`threading.Thread` metodunun :meth:`~threading.Thread.isAlive()` metodu kullanımdan kaldırılmıştır. (Dong-hee Na'nın :issue:`35283` 'teki katkısıyla.)

source: Many builtin and extension functions that take integer arguments will now emit a deprecation warning for :class:`~decimal.Decimal`\ s, :class:`~fractions.Fraction`\ s and any other objects that can be converted to integers only with a loss (e.g. that have the :meth:`~object.__int__` method but do not have the :meth:`~object.__index__` method). In future version they will be errors. (Contributed by Serhiy Storchaka in :issue:`36048`.)
tr: Tamsayı argümanları alan birçok yerleşik ve uzantı fonksiyonu artık :class:`~decimal.Decimal`, :class:`~fractions.Fraction` ve yalnızca bir kayıpla tamsayılara dönüştürülebilen diğer nesneler (örneğin :meth:`~object.__int__` yöntemine sahip olan ancak :meth:`~object.__index__` yöntemine sahip olmayan) için bir kullanımdan kaldırma uyarısı verecektir. Gelecek sürümde bunlar hata olacaktır. (Serhiy Storchaka'nın :issue:`36048` 'deki katkısıyla.)

source: Deprecated passing the following arguments as keyword arguments:
tr: Aşağıdaki bağımsız değişkenlerin anahtar sözcük bağımsız değişkenleri olarak iletilmesi kullanımdan kaldırılmıştır:

source: *function* in :meth:`unittest.TestCase.addCleanup`.
tr: :meth:`unittest.TestCase.addCleanup` içindeki *fonksiyon*.

source: *fn* in the :meth:`~concurrent.futures.Executor.submit` method of :class:`concurrent.futures.ThreadPoolExecutor` and :class:`concurrent.futures.ProcessPoolExecutor`.
tr: *fn* içinde :meth:`~concurrent.futures.Executor.submit` yöntemi :class:`concurrent.futures.ThreadPoolExecutor` ve :class:`concurrent.futures.ProcessPoolExecutor`.

source: *callback* in :meth:`contextlib.ExitStack.callback`, :meth:`contextlib.AsyncExitStack.callback` and :meth:`contextlib.AsyncExitStack.push_async_callback`.
tr: :meth:`contextlib.ExitStack.callback`, :meth:`contextlib.AsyncExitStack.callback` ve :meth:`contextlib.AsyncExitStack.push_async_callback` içinde *geri arama*.

source: *c* and *typeid* in the :meth:`~multiprocessing.managers.Server.create` method of :class:`multiprocessing.managers.Server` and :class:`multiprocessing.managers.SharedMemoryServer`.
tr: *c* ve *typeid* öğeleri :class:`multiprocessing.managers.Server` ve :class:`multiprocessing.managers.SharedMemoryServer` öğelerinin :meth:`~multiprocessing.managers.Server.create` yönteminde yer alır.

source: *obj* in :func:`weakref.finalize`.
tr: :func:`weakref.finalize` içindeki *obj*.

source: In future releases of Python, they will be :ref:`positional-only <positional-only_parameter>`. (Contributed by Serhiy Storchaka in :issue:`36492`.)
tr: Python'un gelecekteki sürümlerinde, bunlar :ref:`positional-only <positional-only_parameter>` olacaktır. (Serhiy Storchaka'nın :issue:`36492` 'deki katkısıyla.)

source: API and Feature Removals
tr: API ve Özellik Kaldırmaları

source: The following features and APIs have been removed from Python 3.8:
tr: Aşağıdaki özellikler ve API'ler Python 3.8'den kaldırılmıştır:

source: Starting with Python 3.3, importing ABCs from :mod:`collections` was deprecated, and importing should be done from :mod:`collections.abc`. Being able to import from collections was marked for removal in 3.8, but has been delayed to 3.9. (See :issue:`36952`.)
tr: Python 3.3 ile başlayarak, ABC'leri :mod:`collections` 'dan içe aktarmak kullanımdan kaldırıldı ve içe aktarma :mod:`collections.abc` 'den yapılmalıdır. Koleksiyonlardan içe aktarabilmek 3.8'de kaldırılmak üzere işaretlenmişti, ancak 3.9'a ertelendi. (Bkz. :issue:`36952`.)

source: The :mod:`macpath` module, deprecated in Python 3.7, has been removed. (Contributed by Victor Stinner in :issue:`35471`.)
tr: Python 3.7'de kullanımdan kaldırılan :mod:`macpath` modülü kaldırıldı. (Victor Stinner'ın :issue:`35471` 'deki katkısıyla.)

source: The function :func:`platform.popen` has been removed, after having been deprecated since Python 3.3: use :func:`os.popen` instead. (Contributed by Victor Stinner in :issue:`35345`.)
tr: Python 3.3'ten beri kullanımda olmayan :func:`platform.popen` fonksiyonu kaldırıldı: bunun yerine :func:`os.popen` kullanın. (Victor Stinner'ın :issue:`35345` 'teki katkısıyla.)

source: The function :func:`time.clock` has been removed, after having been deprecated since Python 3.3: use :func:`time.perf_counter` or :func:`time.process_time` instead, depending on your requirements, to have well-defined behavior. (Contributed by Matthias Bussonnier in :issue:`36895`.)
tr: Python 3.3'ten beri kullanımdan kaldırılan :func:`time.clock` fonksiyonu kaldırıldı: iyi tanımlanmış davranışa sahip olmak için gereksinimlerinize bağlı olarak bunun yerine :func:`time.perf_counter` veya :func:`time.process_time` kullanın. (Matthias Bussonnier'ın :issue:`36895` 'teki katkısıyla.)

source: The ``pyvenv`` script has been removed in favor of ``python3.8 -m venv`` to help eliminate confusion as to what Python interpreter the ``pyvenv`` script is tied to. (Contributed by Brett Cannon in :issue:`25427`.)
tr: ``pyvenv`` betiğinin hangi Python yorumlayıcısına bağlı olduğu konusundaki karışıklığı ortadan kaldırmak için ``python3.8 -m venv`` betiği lehine ``pyvenv`` betiği kaldırıldı. (Brett Cannon'ın :issue:`25427` 'deki katkısıyla.)

source: ``parse_qs``, ``parse_qsl``, and ``escape`` are removed from the :mod:`cgi` module. They are deprecated in Python 3.2 or older. They should be imported from the ``urllib.parse`` and ``html`` modules instead.
tr: ``parse_qs``, ``parse_qsl`` ve ``escape`` :mod:`cgi` modülünden kaldırılmıştır. Python 3.2 veya daha eski sürümlerde kullanımdan kaldırılmışlardır. Bunun yerine ``urllib.parse`` ve ``html`` modüllerinden içe aktarılmalıdırlar.

source: ``filemode`` function is removed from the :mod:`tarfile` module. It is not documented and deprecated since Python 3.3.
tr: ``filemode`` fonksiyonu :mod:`tarfile` modülünden kaldırılmıştır. Python 3.3'ten beri belgelenmemiştir ve kullanımdan kaldırılmıştır.

source: The :class:`~xml.etree.ElementTree.XMLParser` constructor no longer accepts the *html* argument. It never had an effect and was deprecated in Python 3.4. All other parameters are now :ref:`keyword-only <keyword-only_parameter>`. (Contributed by Serhiy Storchaka in :issue:`29209`.)
tr: :class:`~xml.etree.ElementTree.XMLParser` yapıcısı artık *html* argümanını kabul etmiyor. Hiçbir zaman bir etkisi olmadı ve Python 3.4'te kullanımdan kaldırıldı. Diğer tüm parametreler artık :ref:`keyword-only <keyword-only_parameter>` şeklindedir. (Serhiy Storchaka'nın :issue:`29209` 'daki katkısıyla.)

source: Removed the ``doctype()`` method of :class:`~xml.etree.ElementTree.XMLParser`. (Contributed by Serhiy Storchaka in :issue:`29209`.)
tr: :class:`~xml.etree.ElementTree.XMLParser` metodunun ``doctype()`` metodu kaldırıldı. (Serhiy Storchaka'nın :issue:`29209` 'daki katkısıyla.)

source: "unicode_internal" codec is removed. (Contributed by Inada Naoki in :issue:`36297`.)
tr: "unicode_internal" codec'i kaldırıldı. (Inada Naoki'nin :issue:`36297` 'deki katkısıyla.)

source: The ``Cache`` and ``Statement`` objects of the :mod:`sqlite3` module are not exposed to the user. (Contributed by Aviv Palivoda in :issue:`30262`.)
tr: :mod:`sqlite3` modülünün ``Cache`` ve ``Statement`` nesneleri kullanıcıya açık değildir. (Aviv Palivoda'nın :issue:`30262` 'deki katkısıyla.)

source: The ``bufsize`` keyword argument of :func:`fileinput.input` and :func:`fileinput.FileInput` which was ignored and deprecated since Python 3.6 has been removed. :issue:`36952` (Contributed by Matthias Bussonnier.)
tr: Python 3.6'dan beri göz ardı edilen ve kullanımdan kaldırılan :func:`fileinput.input` ve :func:`fileinput.FileInput` anahtar kelime argümanı ``bufsize`` kaldırıldı. :issue:`36952` (Matthias Bussonnier'ın katkısıyla.)

source: The functions :func:`sys.set_coroutine_wrapper` and :func:`sys.get_coroutine_wrapper` deprecated in Python 3.7 have been removed; :issue:`36933` (Contributed by Matthias Bussonnier.)
tr: Python 3.7'de kullanımdan kaldırılan :func:`sys.set_coroutine_wrapper` ve :func:`sys.get_coroutine_wrapper` fonksiyonları kaldırıldı; :issue:`36933` (Matthias Bussonnier'ın katkısıyla.)

source: Porting to Python 3.8
tr: Python 3.8'e Taşıma

source: This section lists previously described changes and other bugfixes that may require changes to your code.
tr: Bu bölüm, daha önce açıklanan değişiklikleri ve kodunuzda değişiklik gerektirebilecek diğer hata düzeltmelerini listeler.

source: Changes in Python behavior
tr: Python davranışındaki değişiklikler

source: Yield expressions (both ``yield`` and ``yield from`` clauses) are now disallowed in comprehensions and generator expressions (aside from the iterable expression in the leftmost :keyword:`!for` clause). (Contributed by Serhiy Storchaka in :issue:`10544`.)
tr: Yield ifadelerine (hem ``yield`` hem de ``yield from`` cümleleri) artık anlamalarda ve oluşturucu ifadelerinde (en soldaki :keyword:`!for` cümlesindeki yinelenebilir ifadesi dışında) izin verilmemektedir. (Serhiy Storchaka'nın :issue:`10544` 'teki katkısıyla.)

source: The compiler now produces a :exc:`SyntaxWarning` when identity checks (``is`` and ``is not``) are used with certain types of literals (e.g. strings, numbers). These can often work by accident in CPython, but are not guaranteed by the language spec. The warning advises users to use equality tests (``==`` and ``!=``) instead. (Contributed by Serhiy Storchaka in :issue:`34850`.)
tr: Derleyici artık kimlik kontrolleri (``is`` ve ``is not``) belirli türdeki değişmezlerle (örneğin dizeler, sayılar) kullanıldığında bir :exc:`SyntaxWarning` üretiyor. Bunlar CPython'da genellikle kazara çalışabilir, ancak dil özellikleri tarafından garanti edilmez. Uyarı, kullanıcılara bunun yerine eşitlik testlerini (``==`` ve ``!=``) kullanmalarını önerir. (Serhiy Storchaka'nın :issue:`34850` 'deki katkısıyla.)

source: The CPython interpreter can swallow exceptions in some circumstances. In Python 3.8 this happens in fewer cases. In particular, exceptions raised when getting the attribute from the type dictionary are no longer ignored. (Contributed by Serhiy Storchaka in :issue:`35459`.)
tr: CPython yorumlayıcısı bazı durumlarda istisnaları yutabilir. Python 3.8'de bu daha az durumda gerçekleşir. Özellikle, tip sözlüğünden öznitelik alınırken ortaya çıkan istisnalar artık göz ardı edilmiyor. (Serhiy Storchaka'nın :issue:`35459` 'daki katkısıyla.)
