Repository: python/python-docs-tr
Catalog: whatsnew/3.8.po
Languages: tr

source: Removed ``__str__`` implementations from builtin types :class:`bool`, :class:`int`, :class:`float`, :class:`complex` and few classes from the standard library. They now inherit ``__str__()`` from :class:`object`. As result, defining the ``__repr__()`` method in the subclass of these classes will affect their string representation. (Contributed by Serhiy Storchaka in :issue:`36793`.)
tr: :class:`bool`, :class:`int`, :class:`float`, :class:`complex` yerleşik türlerinden ve standart kütüphanedeki birkaç sınıftan ``__str__`` uygulamaları kaldırıldı. Bunlar artık :class:`object` türünden ``__str__()`` miras almaktadır. Sonuç olarak, bu sınıfların alt sınıflarında ``__repr__()`` metodunu tanımlamak onların string gösterimlerini etkileyecektir. (Serhiy Storchaka'nın :issue:`36793` 'teki katkısıyla.)

source: On AIX, :attr:`sys.platform` doesn't contain the major version anymore. It is always ``'aix'``, instead of ``'aix3'`` .. ``'aix7'``. Since older Python versions include the version number, so it is recommended to always use ``sys.platform.startswith('aix')``. (Contributed by M. Felt in :issue:`36588`.)
tr: AIX üzerinde, :attr:`sys.platform` artık ana sürümü içermemektedir. Bu her zaman ``'aix3'`` ... ``'aix7'`` yerine ``'aix'`` şeklindedir. Eski Python sürümleri sürüm numarasını içerdiğinden, her zaman ``sys.platform.startswith('aix')`` kullanılması önerilir. (M. Felt'in :issue:`36588` 'deki katkısıyla.)

source: :c:func:`PyEval_AcquireLock` and :c:func:`PyEval_AcquireThread` now terminate the current thread if called while the interpreter is finalizing, making them consistent with :c:func:`PyEval_RestoreThread`, :c:func:`Py_END_ALLOW_THREADS`, and :c:func:`PyGILState_Ensure`. If this behavior is not desired, guard the call by checking :c:func:`_Py_IsFinalizing` or :c:func:`sys.is_finalizing`. (Contributed by Joannah Nanjekye in :issue:`36475`.)
tr: :c:func:`PyEval_AcquireLock` ve :c:func:`PyEval_AcquireThread` artık yorumlayıcı sonlandırılırken çağrılırsa geçerli iş parçacığını sonlandırarak :c:func:`PyEval_RestoreThread`, :c:func:`Py_END_ALLOW_THREADS` ve :c:func:`PyGILState_Ensure` ile tutarlı hale geliyor. Bu davranış istenmiyorsa, :c:func:`_Py_IsFinalizing` veya :c:func:`sys.is_finalizing` kontrolünü yaparak çağrıyı koruyun. (Joannah Nanjekye'nin :issue:`36475` 'teki katkısıyla.)

source: Changes in the Python API
tr: Python API'sindeki değişiklikler

source: The :func:`os.getcwdb` function now uses the UTF-8 encoding on Windows, rather than the ANSI code page: see :pep:`529` for the rationale. The function is no longer deprecated on Windows. (Contributed by Victor Stinner in :issue:`37412`.)
tr: :func:`os.getcwdb` fonksiyonu artık Windows'ta ANSI kod sayfası yerine UTF-8 kodlamasını kullanıyor: gerekçe için bkz. :pep:`529`. İşlev artık Windows'ta kullanımdan kaldırılmamıştır. (Victor Stinner'ın :issue:`37412` 'deki katkısıyla.)

source: :class:`subprocess.Popen` can now use :func:`os.posix_spawn` in some cases for better performance. On Windows Subsystem for Linux and QEMU User Emulation, the :class:`Popen` constructor using :func:`os.posix_spawn` no longer raises an exception on errors like "missing program". Instead the child process fails with a non-zero :attr:`~Popen.returncode`. (Contributed by Joannah Nanjekye and Victor Stinner in :issue:`35537`.)
tr: :class:`subprocess.Popen` artık daha iyi performans için bazı durumlarda :func:`os.posix_spawn` kullanabilir. Linux ve QEMU Kullanıcı Emülasyonu için Windows Alt Sisteminde, :func:`os.posix_spawn` kullanan :class:`Popen` kurucusu artık "eksik program" gibi hatalarda bir istisna oluşturmuyor. Bunun yerine alt süreç sıfır olmayan bir :attr:`~Popen.returncode` ile başarısız olur. (Joannah Nanjekye ve Victor Stinner'ın :issue:`35537` 'deki katkılarıyla.)

source: The *preexec_fn* argument of * :class:`subprocess.Popen` is no longer compatible with subinterpreters. The use of the parameter in a subinterpreter now raises :exc:`RuntimeError`. (Contributed by Eric Snow in :issue:`34651`, modified by Christian Heimes in :issue:`37951`.)
tr: :class:`subprocess.Popen` parametresinin *preexec_fn* argümanı artık alt yorumlayıcılarla uyumlu değildir. Parametrenin bir alt yorumlayıcıda kullanılması artık :exc:`RuntimeError` uyarısı veriyor. (Eric Snow tarafından :issue:`34651` 'de katkıda bulunulmuş, Christian Heimes tarafından :issue:`37951` 'de değiştirilmiştir.)

source: The :meth:`imap.IMAP4.logout` method no longer silently ignores arbitrary exceptions. (Contributed by Victor Stinner in :issue:`36348`.)
tr: :meth:`imap.IMAP4.logout` yöntemi artık keyfi istisnaları sessizce yok saymaz. (Victor Stinner'ın :issue:`36348` 'deki katkısıyla.)

source: The :func:`statistics.mode` function no longer raises an exception when given multimodal data. Instead, it returns the first mode encountered in the input data. (Contributed by Raymond Hettinger in :issue:`35892`.)
tr: :func:`statistics.mode` fonksiyonu artık çok modlu veriler verildiğinde bir istisna oluşturmuyor. Bunun yerine, girdi verilerinde karşılaşılan ilk modu döndürür. (Raymond Hettinger'ın :issue:`35892` 'deki katkısıyla.)

source: The :meth:`~tkinter.ttk.Treeview.selection` method of the :class:`tkinter.ttk.Treeview` class no longer takes arguments. Using it with arguments for changing the selection was deprecated in Python 3.6. Use specialized methods like :meth:`~tkinter.ttk.Treeview.selection_set` for changing the selection. (Contributed by Serhiy Storchaka in :issue:`31508`.)
tr: :class:`tkinter.ttk.Treeview` sınıfının :meth:`~tkinter.ttk.Treeview.selection` yöntemi artık argüman almıyor. Seçimi değiştirmek için argümanlarla kullanılması Python 3.6'da kullanımdan kaldırılmıştır. Seçimi değiştirmek için :meth:`~tkinter.ttk.Treeview.selection_set` gibi özel yöntemler kullanın. (Serhiy Storchaka'ın :issue:`31508` 'deki katkısıyla.)

source: The :meth:`writexml`, :meth:`toxml` and :meth:`toprettyxml` methods of :mod:`xml.dom.minidom`, and the :meth:`write` method of :mod:`xml.etree`, now preserve the attribute order specified by the user. (Contributed by Diego Rojas and Raymond Hettinger in :issue:`34160`.)
tr: :mod:`xml.dom.minidom` metodunun :meth:`writexml`, :meth:`toxml` ve :meth:`toprettyxml` metotları ve :mod:`xml.etree` metodunun :meth:`write` metodu artık kullanıcı tarafından belirtilen öznitelik sırasını korumaktadır. (Diego Rojas ve Raymond Hettinger'ın :issue:`34160` 'daki katkılarıyla.)

source: A :mod:`dbm.dumb` database opened with flags ``'r'`` is now read-only. :func:`dbm.dumb.open` with flags ``'r'`` and ``'w'`` no longer creates a database if it does not exist. (Contributed by Serhiy Storchaka in :issue:`32749`.)
tr: Bir :mod:`dbm.dumb` veritabanı ``'r'`` bayraklarıyla açıldığında artık salt okunurdur. :func:`dbm.dumb.open`, ``'r'`` ve ``'w'`` bayraklarıyla artık mevcut değilse bir veritabanı oluşturmaz. (Serhiy Storchaka'nın :issue:`32749` 'daki katkısıyla.)

source: The ``doctype()`` method defined in a subclass of :class:`~xml.etree.ElementTree.XMLParser` will no longer be called and will emit a :exc:`RuntimeWarning` instead of a :exc:`DeprecationWarning`. Define the :meth:`doctype() <xml.etree.ElementTree.TreeBuilder.doctype>` method on a target for handling an XML doctype declaration. (Contributed by Serhiy Storchaka in :issue:`29209`.)
tr: :class:`~xml.etree.ElementTree.XMLParser` alt sınıfında tanımlanan ``doctype()`` yöntemi artık çağrılmayacak ve bir :exc:`DeprecationWarning` yerine bir :exc:`RuntimeWarning` yayacaktır. Bir XML doctype bildirimini işlemek için bir hedef üzerinde :meth:`doctype() <xml.etree.ElementTree.TreeBuilder.doctype>` yöntemini tanımlayın. (Serhiy Storchaka'nın :issue:`29209` 'daki katkısıyla.)

source: A :exc:`RuntimeError` is now raised when the custom metaclass doesn't provide the ``__classcell__`` entry in the namespace passed to ``type.__new__``. A :exc:`DeprecationWarning` was emitted in Python 3.6--3.7. (Contributed by Serhiy Storchaka in :issue:`23722`.)
tr: Özel metaclass, ``type.__new__`` 'e aktarılan ad alanında ``__classcell__`` girdisini sağlamadığında artık bir :exc:`RuntimeError` ortaya çıkıyor. Bir :exc:`DeprecationWarning` Python 3.6--3.7` 'de yayınlandı (Serhiy Storchaka'nın :issue:`23722` 'deki katkısıyla.)

source: The :class:`cProfile.Profile` class can now be used as a context manager. (Contributed by Scott Sanderson in :issue:`29235`.)
tr: :class:`cProfile.Profile` sınıfı artık bir bağlam yöneticisi olarak kullanılabilir. (Scott Sanderson'ın :issue:`29235` 'teki katkısıyla.)

source: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` and :func:`shutil.move` use platform-specific "fast-copy" syscalls (see :ref:`shutil-platform-dependent-efficient-copy-operations` section).
tr: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` ve :func:`shutil.move` platforma özgü "fast-copy" sistem çağrılarını kullanır (bkz. :ref:`shutil-platform-dependent-efficient-copy-operations` bölümü).

source: :func:`shutil.copyfile` default buffer size on Windows was changed from 16 KiB to 1 MiB.
tr: :func:`shutil.copyfile` Windows üzerindeki varsayılan tampon boyutu 16 KiB'den 1 MiB'ye değiştirildi.

source: The ``PyGC_Head`` struct has changed completely. All code that touched the struct member should be rewritten. (See :issue:`33597`.)
tr: ``PyGC_Head`` yapısı tamamen değişti. Bu yapı üyesine dokunan tüm kodlar yeniden yazılmalıdır. (Bkz :issue:`33597`.)

source: The :c:type:`PyInterpreterState` struct has been moved into the "internal" header files (specifically Include/internal/pycore_pystate.h). An opaque ``PyInterpreterState`` is still available as part of the public API (and stable ABI). The docs indicate that none of the struct's fields are public, so we hope no one has been using them. However, if you do rely on one or more of those private fields and have no alternative then please open a BPO issue. We'll work on helping you adjust (possibly including adding accessor functions to the public API). (See :issue:`35886`.)
tr: :c:type:`PyInterpreterState` yapısı "dahili" başlık dosyalarına taşınmıştır (özellikle Include/internal/pycore_pystate.h). Opak bir ``PyInterpreterState`` hala genel API'nin (ve kararlı ABI'nin) bir parçası olarak mevcuttur. Dokümanlar, yapının hiçbir alanının herkese açık olmadığını belirtmektedir, bu nedenle kimsenin bunları kullanmadığını umuyoruz. Ancak, bu özel alanlardan birine veya daha fazlasına güveniyorsanız ve alternatifiniz yoksa, lütfen bir BPO sorunu açın. Ayarlama yapmanıza yardımcı olmak için çalışacağız (muhtemelen genel API'ye erişim fonksiyonları eklemek dahil). (Bkz. :issue:`35886`.)

source: The :meth:`mmap.flush() <mmap.mmap.flush>` method now returns ``None`` on success and raises an exception on error under all platforms. Previously, its behavior was platform-dependent: a nonzero value was returned on success; zero was returned on error under Windows. A zero value was returned on success; an exception was raised on error under Unix. (Contributed by Berker Peksag in :issue:`2122`.)
tr: :meth:`mmap.flush() <mmap.mmap.flush>` yöntemi artık başarı durumunda ``None`` değerini döndürmekte ve tüm platformlarda hata durumunda bir istisna oluşturmaktadır. Önceden metodun davranışı platforma bağlıydı: başarı durumunda sıfır olmayan bir değer döndürülüyordu; Windows altında hata durumunda sıfır döndürülüyordu. Unix altında başarı durumunda sıfır değeri döndürülürken hata durumunda bir istisna ortaya çıkıyordu. (Berker Peksağ'ın :issue:`2122` 'deki katkısıyla.)

source: :mod:`xml.dom.minidom` and :mod:`xml.sax` modules no longer process external entities by default. (Contributed by Christian Heimes in :issue:`17239`.)
tr: :mod:`xml.dom.minidom` ve :mod:`xml.sax` modülleri artık varsayılan olarak harici varlıkları işlemiyor. (Christian Heimes'in :issue:`17239` 'daki katkısıyla.)

source: Deleting a key from a read-only :mod:`dbm` database (:mod:`dbm.dumb`, :mod:`dbm.gnu` or :mod:`dbm.ndbm`) raises :attr:`error` (:exc:`dbm.dumb.error`, :exc:`dbm.gnu.error` or :exc:`dbm.ndbm.error`) instead of :exc:`KeyError`. (Contributed by Xiang Zhang in :issue:`33106`.)
tr: Salt okunur :mod:`dbm` veritabanından bir anahtar silindiğinde (:mod:`dbm.dumb`, :mod:`dbm.gnu` veya :mod:`dbm.ndbm`) :exc:`KeyError` yerine :attr:`error` (:exc:`dbm.dumb.error`, :exc:`dbm.gnu.error` veya :exc:`dbm.ndbm.error`) ortaya çıkar. (Xiang Zhang'ın :issue:`33106` 'teki katkılarıyla.)

source: Simplified AST for literals. All constants will be represented as :class:`ast.Constant` instances. Instantiating old classes ``Num``, ``Str``, ``Bytes``, ``NameConstant`` and ``Ellipsis`` will return an instance of ``Constant``. (Contributed by Serhiy Storchaka in :issue:`32892`.)
tr: Değişmezler için basitleştirilmiş AST. Tüm sabitler :class:`ast.Constant` örnekleri olarak temsil edilecektir. Eski ``Num``, ``Str``, ``Bytes``, ``NameConstant`` ve ``Ellipsis`` sınıflarını örneklemek bir ``Constant`` örneği döndürecektir. (Serhiy Storchaka'nın :issue:`32892` 'deki katkısıyla.)

source: The function :func:`asyncio.wait_for` now correctly waits for cancellation when using an instance of :class:`asyncio.Task`. Previously, upon reaching *timeout*, it was cancelled and immediately returned. (Contributed by Elvis Pranskevichus in :issue:`32751`.)
tr: :func:`asyncio.wait_for` fonksiyonu artık :class:`asyncio.Task` örneğini kullanırken iptal için doğru şekilde bekliyor. Önceden, *zaman aşımına* ulaşıldığında iptal ediliyor ve hemen geri dönüyordu. (Elvis Pranskevichus'un :issue:`32751` 'deki katkısıyla.)

source: The function :func:`asyncio.BaseTransport.get_extra_info` now returns a safe to use socket object when 'socket' is passed to the *name* parameter. (Contributed by Yury Selivanov in :issue:`37027`.)
tr: Fonksiyon :func:`asyncio.BaseTransport.get_extra_info` artık *name* parametresine 'socket' geçildiğinde kullanımı güvenli bir soket nesnesi döndürüyor. (Yury Selivanov'un :issue:`37027` 'deki katkısıyla.)

source: :class:`asyncio.BufferedProtocol` has graduated to the stable API.
tr: :class:`asyncio.BufferedProtocol` kararlı API'ye geçiş yaptı.

source: DLL dependencies for extension modules and DLLs loaded with :mod:`ctypes` on Windows are now resolved more securely. Only the system paths, the directory containing the DLL or PYD file, and directories added with :func:`~os.add_dll_directory` are searched for load-time dependencies. Specifically, :envvar:`PATH` and the current working directory are no longer used, and modifications to these will no longer have any effect on normal DLL resolution. If your application relies on these mechanisms, you should check for :func:`~os.add_dll_directory` and if it exists, use it to add your DLLs directory while loading your library. Note that Windows 7 users will need to ensure that Windows Update KB2533623 has been installed (this is also verified by the installer). (Contributed by Steve Dower in :issue:`36085`.)
tr: Windows üzerinde :mod:`ctypes` ile yüklenen uzantı modülleri ve DLL'ler için DLL bağımlılıkları artık daha güvenli bir şekilde çözümlenmektedir. Yükleme zamanı bağımlılıkları için yalnızca sistem yolları, DLL veya PYD dosyasını içeren dizin ve :func:`~os.add_dll_directory` ile eklenen dizinler aranır. Özellikle, :envvar:`PATH` ve geçerli çalışma dizini artık kullanılmamaktadır ve bunlarda yapılan değişikliklerin normal DLL çözümlemesi üzerinde herhangi bir etkisi olmayacaktır. Uygulamanız bu mekanizmalara güveniyorsa, :func:`~os.add_dll_directory` dosyasını kontrol etmeli ve varsa, kütüphanenizi yüklerken DLL'lerinizin dizinini eklemek için kullanmalısınız. Windows 7 kullanıcılarının Windows Update KB2533623'ün yüklendiğinden emin olmaları gerektiğini unutmayın (bu aynı zamanda yükleyici tarafından da doğrulanır). (Steve Dower'ın :issue:`36085` 'teki katkısıyla.)

source: The header files and functions related to pgen have been removed after its replacement by a pure Python implementation. (Contributed by Pablo Galindo in :issue:`36623`.)
tr: Pgen ile ilgili başlık dosyaları ve fonksiyonlar, saf bir Python uygulamasıyla değiştirildikten sonra kaldırılmıştır. (Pablo Galindo'nun :issue:`36623` 'teki katkısıyla.)

source: :class:`types.CodeType` has a new parameter in the second position of the constructor (*posonlyargcount*) to support positional-only arguments defined in :pep:`570`. The first argument (*argcount*) now represents the total number of positional arguments (including positional-only arguments). The new ``replace()`` method of :class:`types.CodeType` can be used to make the code future-proof.
tr: :class:`types.CodeType`, :pep:`570` 'te tanımlanan sadece pozisyonel argümanları desteklemek için kurucunun ikinci pozisyonunda (*posonlyargcount*) yeni bir parametreye sahiptir. İlk argüman (*argcount*) artık toplam konumsal argüman sayısını (sadece konumsal argümanlar dahil) temsil etmektedir. :class:`types.CodeType` 'ın yeni ``replace()`` yöntemi, kodu geleceğe hazır hale getirmek için kullanılabilir.

source: The parameter ``digestmod`` for :func:`hmac.new` no longer uses the MD5 digest by default.
tr: :func:`hmac.new` için ``digestmod`` parametresi artık varsayılan olarak MD5 özetini kullanmıyor.

source: Changes in the C API
tr: C API'sindeki değişiklikler

source: The :c:struct:`PyCompilerFlags` structure got a new *cf_feature_version* field. It should be initialized to ``PY_MINOR_VERSION``. The field is ignored by default, and is used if and only if ``PyCF_ONLY_AST`` flag is set in *cf_flags*. (Contributed by Guido van Rossum in :issue:`35766`.)
tr: :c:struct:`PyCompilerFlags` yapısı yeni bir *cf_feature_version* alanına sahiptir. Bu alan ``PY_MINOR_VERSION`` olarak başlatılmalıdır. Bu alan varsayılan olarak yok sayılır ve yalnızca *cf_flags* içinde ``PyCF_ONLY_AST`` bayrağı ayarlanmışsa kullanılır. (Guido van Rossum'un :issue:`35766` 'teki katkısıyla.)

source: The :c:func:`PyEval_ReInitThreads` function has been removed from the C API. It should not be called explicitly: use :c:func:`PyOS_AfterFork_Child` instead. (Contributed by Victor Stinner in :issue:`36728`.)
tr: :c:func:`PyEval_ReInitThreads` fonksiyonu C API'sinden kaldırıldı. Açıkça çağrılmamalıdır: bunun yerine :c:func:`PyOS_AfterFork_Child` kullanın. (Victor Stinner'ın :issue:`36728` 'deki katkısıyla.)

source: On Unix, C extensions are no longer linked to libpython except on Android and Cygwin. When Python is embedded, ``libpython`` must not be loaded with ``RTLD_LOCAL``, but ``RTLD_GLOBAL`` instead. Previously, using ``RTLD_LOCAL``, it was already not possible to load C extensions which were not linked to ``libpython``, like C extensions of the standard library built by the ``*shared*`` section of ``Modules/Setup``. (Contributed by Victor Stinner in :issue:`21536`.)
tr: Unix'te, Android ve Cygwin dışında C uzantıları artık libpython'a bağlı değildir. Python gömülü olduğunda, ``libpython`` ``RTLD_LOCAL`` ile değil, bunun yerine ``RTLD_GLOBAL`` ile yüklenmelidir. Önceden ``RTLD_LOCAL`` kullanıldığında, ``Modules/Setup`` bölümünün ``*shared*`` bölümü tarafından oluşturulan standart kütüphanenin C uzantıları gibi ``libpython`` ile bağlantılı olmayan C uzantılarını yüklemek zaten mümkün değildi. (Victor Stinner'ın :issue:`21536` 'daki katkısıyla.)

source: Use of ``#`` variants of formats in parsing or building value (e.g. :c:func:`PyArg_ParseTuple`, :c:func:`Py_BuildValue`, :c:func:`PyObject_CallFunction`, etc.) without ``PY_SSIZE_T_CLEAN`` defined raises ``DeprecationWarning`` now. It will be removed in 3.10 or 4.0. Read :ref:`arg-parsing` for detail. (Contributed by Inada Naoki in :issue:`36381`.)
tr: Ayrıştırma veya değer oluşturmada biçimlerin ``#`` varyantlarının kullanımı (örneğin :c:func:`PyArg_ParseTuple`, :c:func:`Py_BuildValue`, :c:func:`PyObject_CallFunction`, vb.) ``PY_SSIZE_T_CLEAN`` tanımlanmadan artık ``DeprecationWarning`` verir. Bu uyarı 3.10 veya 4.0'da kaldırılacaktır. Ayrıntılar için :ref:`arg-parsing` sayfasını okuyun. (Inada Naoki'nin :issue:`36381` 'teki katkısıyla.)

source: Instances of heap-allocated types (such as those created with :c:func:`PyType_FromSpec`) hold a reference to their type object. Increasing the reference count of these type objects has been moved from :c:func:`PyType_GenericAlloc` to the more low-level functions, :c:func:`PyObject_Init` and :c:func:`PyObject_INIT`. This makes types created through :c:func:`PyType_FromSpec` behave like other classes in managed code.
tr: Yığın tahsisli tiplerin örnekleri (örneğin :c:func:`PyType_FromSpec` ile oluşturulanlar) tip nesnelerine bir referans tutar. Bu tip nesnelerinin referans sayısının artırılması :c:func:`PyType_GenericAlloc` fonksiyonundan daha düşük seviyeli :c:func:`PyObject_Init` ve :c:func:`PyObject_INIT` fonksiyonlarına taşınmıştır. Bu, :c:func:`PyType_FromSpec` aracılığıyla oluşturulan türlerin yönetilen koddaki diğer sınıflar gibi davranmasını sağlar.

source: :ref:`Statically allocated types <static-types>` are not affected.
tr: :ref:`Statically allocated types <static-types>` etkilenmez.

source: For the vast majority of cases, there should be no side effect. However, types that manually increase the reference count after allocating an instance (perhaps to work around the bug) may now become immortal. To avoid this, these classes need to call Py_DECREF on the type object during instance deallocation.
tr: Durumların büyük çoğunluğu için herhangi bir yan etki olmamalıdır. Ancak, bir örnek tahsis ettikten sonra referans sayısını manuel olarak artıran türler (belki de hatanın etrafında çalışmak için) artık ölümsüz hale gelebilir. Bundan kaçınmak için, bu sınıfların örnek ayırma sırasında tür nesnesi üzerinde Py_DECREF'i çağırması gerekir.

source: To correctly port these types into 3.8, please apply the following changes:
tr: Bu türleri 3.8 'e doğru bir şekilde taşımak için lütfen aşağıdaki değişiklikleri uygulayın:

source: Remove :c:macro:`Py_INCREF` on the type object after allocating an instance - if any. This may happen after calling :c:func:`PyObject_New`, :c:func:`PyObject_NewVar`, :c:func:`PyObject_GC_New`, :c:func:`PyObject_GC_NewVar`, or any other custom allocator that uses :c:func:`PyObject_Init` or :c:func:`PyObject_INIT`.
tr: Varsa, bir örnek ayırdıktan sonra tür nesnesi üzerindeki :c:macro:`Py_INCREF` öğesini kaldırın. Bu, :c:func:`PyObject_New`, :c:func:`PyObject_NewVar`, :c:func:`PyObject_GC_New`, :c:func:`PyObject_GC_NewVar` veya :c:func:`PyObject_Init` veya :c:func:`PyObject_INIT` kullanan herhangi bir özel ayırıcı çağrıldıktan sonra gerçekleşebilir.

source: Example:
tr: Örnek:

source: Ensure that all custom ``tp_dealloc`` functions of heap-allocated types decrease the type's reference count.
tr: Yığın tahsisli türlerin tüm özel ``tp_dealloc`` fonksiyonlarının, türün referans sayısını azalttığından emin olun.

source: (Contributed by Eddie Elizondo in :issue:`35810`.)
tr: (Eddie Elizondo'nun :issue:`35810` 'daki katkısıyla.)

source: The :c:macro:`Py_DEPRECATED()` macro has been implemented for MSVC. The macro now must be placed before the symbol name.
tr: :c:macro:`Py_DEPRECATED()` makrosu MSVC için uygulanmıştır. Makro artık sembol adından önce yerleştirilmelidir.

source: (Contributed by Zackery Spytz in :issue:`33407`.)
tr: (Zackery Spytz'in :issue:`33407` 'deki katkısıyla.)
