Repository: python/python-docs-tr
Catalog: whatsnew/3.8.po
Languages: tr

source: The interpreter does not pretend to support binary compatibility of extension types across feature releases, anymore. A :c:type:`PyTypeObject` exported by a third-party extension module is supposed to have all the slots expected in the current Python version, including :c:member:`~PyTypeObject.tp_finalize` (:const:`Py_TPFLAGS_HAVE_FINALIZE` is not checked anymore before reading :c:member:`~PyTypeObject.tp_finalize`).
tr: Yorumlayıcı, artık özellik sürümleri arasında uzantı türlerinin ikili uyumluluğunu destekliyormuş gibi davranmıyor. Üçüncü taraf bir uzantı modülü tarafından dışa aktarılan bir :c:type:`PyTypeObject`, :c:member:`~PyTypeObject.tp_finalize` dahil olmak üzere mevcut Python sürümünde beklenen tüm yuvalara sahip olmalıdır (:const:`Py_TPFLAGS_HAVE_FINALIZE` artık :c:member:`~PyTypeObject.tp_finalize` okunmadan önce kontrol edilmiyor).

source: (Contributed by Antoine Pitrou in :issue:`32388`.)
tr: (Antoine Pitrou'nun :issue:`32388` 'deki katkısıyla.)

source: The functions :c:func:`PyNode_AddChild` and :c:func:`PyParser_AddToken` now accept two additional ``int`` arguments *end_lineno* and *end_col_offset*.
tr: :c:func:`PyNode_AddChild` ve :c:func:`PyParser_AddToken` fonksiyonları artık iki ek ``int`` argüman *end_lineno* ve *end_col_offset* kabul etmektedir.

source: The :file:`libpython38.a` file to allow MinGW tools to link directly against :file:`python38.dll` is no longer included in the regular Windows distribution. If you require this file, it may be generated with the ``gendef`` and ``dlltool`` tools, which are part of the MinGW binutils package:
tr: MinGW araçlarının doğrudan :file:`python38.dll` dosyasına bağlanmasını sağlayan :file:`libpython38.a` dosyası artık normal Windows dağıtımına dahil değildir. Bu dosyaya ihtiyacınız varsa, MinGW binutils paketinin bir parçası olan ``gendef`` ve ``dlltool`` araçları ile oluşturulabilir:

source: The location of an installed :file:`pythonXY.dll` will depend on the installation options and the version and language of Windows. See :ref:`using-on-windows` for more information. The resulting library should be placed in the same directory as :file:`pythonXY.lib`, which is generally the :file:`libs` directory under your Python installation.
tr: Yüklü bir :file:`pythonXY.dll` dosyasının konumu, kurulum seçeneklerine ve Windows'un sürümüne ve diline bağlı olacaktır. Daha fazla bilgi için :ref:`Windows'ta kullanma <using-on-windows>` konusuna bakın. Ortaya çıkan kitaplık, genellikle Python kurulumunuzun altındaki :file:`libs` dizini olan :file:`pythonXY.lib` ile aynı dizine yerleştirilmelidir.

source: (Contributed by Steve Dower in :issue:`37351`.)
tr: (Steve Dower'ın :issue:`37351` 'deki katkısıyla.)

source: CPython bytecode changes
tr: CPython bayt kodu değişiklikleri

source: The interpreter loop has been simplified by moving the logic of unrolling the stack of blocks into the compiler. The compiler emits now explicit instructions for adjusting the stack of values and calling the cleaning-up code for :keyword:`break`, :keyword:`continue` and :keyword:`return`.
tr: Yorumlayıcı döngüsü, blok yığınını açma mantığı derleyiciye taşınarak basitleştirilmiştir. Derleyici artık değer yığınını ayarlamak ve :keyword:`break`, :keyword:`continue` ve :keyword:`return` için temizleme kodunu çağırmak için açık talimatlar yayınlar.

source: Removed opcodes :opcode:`BREAK_LOOP`, :opcode:`CONTINUE_LOOP`, :opcode:`SETUP_LOOP` and :opcode:`SETUP_EXCEPT`. Added new opcodes :opcode:`ROT_FOUR`, :opcode:`BEGIN_FINALLY`, :opcode:`CALL_FINALLY` and :opcode:`POP_FINALLY`. Changed the behavior of :opcode:`END_FINALLY` and :opcode:`WITH_CLEANUP_START`.
tr: :opcode:`BREAK_LOOP`, :opcode:`CONTINUE_LOOP`, :opcode:`SETUP_LOOP` ve :opcode:`SETUP_EXCEPT` kodları kaldırıldı. Yeni :opcode:`ROT_FOUR`, :opcode:`BEGIN_FINALLY`, :opcode:`CALL_FINALLY` ve :opcode:`POP_FINALLY` kodları eklendi. :opcode:`END_FINALLY` ve :opcode:`WITH_CLEANUP_START` davranışları değiştirildi.

source: (Contributed by Mark Shannon, Antoine Pitrou and Serhiy Storchaka in :issue:`17611`.)
tr: (Mark Shannon, Antoine Pitrou ve Serhiy Storchaka'nın :issue:`17611` 'deki katkılarıyla.)

source: Added new opcode :opcode:`END_ASYNC_FOR` for handling exceptions raised when awaiting a next item in an :keyword:`async for` loop. (Contributed by Serhiy Storchaka in :issue:`33041`.)
tr: Bir :keyword:`async for` döngüsünde bir sonraki öğe beklenirken ortaya çıkan istisnaları işlemek için yeni :opcode:`END_ASYNC_FOR` kodu eklendi. (Serhiy Storchaka'nın :issue:`33041` 'deki katkısıyla.)

source: The :opcode:`MAP_ADD` now expects the value as the first element in the stack and the key as the second element. This change was made so the key is always evaluated before the value in dictionary comprehensions, as proposed by :pep:`572`. (Contributed by Jörn Heissler in :issue:`35224`.)
tr: :opcode:`MAP_ADD` artık değeri yığının ilk elemanı ve anahtarı da ikinci eleman olarak beklemektedir. Bu değişiklik, :pep:`572` tarafından önerildiği gibi, sözlük kavramalarında anahtarın her zaman değerden önce değerlendirilmesi için yapılmıştır. (Jörn Heissler'ın :issue:`35224` 'teki katkısıyla.)

source: Demos and Tools
tr: Demolar ve Araçlar

source: Added a benchmark script for timing various ways to access variables: ``Tools/scripts/var_access_benchmark.py``. (Contributed by Raymond Hettinger in :issue:`35884`.)
tr: Değişkenlere erişmenin çeşitli yollarını zamanlamak için bir kıyaslama dizesi eklendi: ``Tools/scripts/var_access_benchmark.py``. (Raymond Hettinger'ın :issue:`35884` 'teki katkısıyla.)

source: Here's a summary of performance improvements since Python 3.3:
tr: İşte Python 3.3'ten bu yana performans iyileştirmelerinin bir özeti:

source: The benchmarks were measured on an `Intel® Core™ i7-4960HQ processor <https://ark.intel.com/content/www/us/en/ark/products/76088/intel-core-i7-4960hq-processor-6m-cache-up-to-3-80-ghz.html>`_ running the macOS 64-bit builds found at `python.org <https://www.python.org/downloads/mac-osx/>`_. The benchmark script displays timings in nanoseconds.
tr: Kıyaslamalar `python.org <https://www.python.org/downloads/mac-osx/>`_ adresinde bulunan macOS 64-bit yapılarını çalıştıran bir `Intel® Core™ i7-4960HQ işlemci <https://ark.intel.com/content/www/us/en/ark/products/76088/intel-core-i7-4960hq-processor-6m-cache-up-to-3-80-ghz.html>`_ üzerinde ölçülmüştür. Kıyaslama betiği zamanlamaları nanosaniye cinsinden gösterir.

source: Notable changes in Python 3.8.1
tr: Python 3.8.1'deki önemli değişiklikler

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint` is no longer supported. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. For more details, see the documentation for ``loop.create_datagram_endpoint()``. (Contributed by Kyle Stanley, Antoine Pitrou, and Yury Selivanov in :issue:`37228`.)
tr: Önemli güvenlik endişeleri nedeniyle, :meth:`asyncio.loop.create_datagram_endpoint` parametresinin *reuse_address* parametresi artık desteklenmemektedir. Bunun nedeni UDP'deki ``SO_REUSEADDR`` soket seçeneğinin davranışıdır. Daha fazla ayrıntı için ``loop.create_datagram_endpoint()`` belgelerine bakın. (Kyle Stanley, Antoine Pitrou ve Yury Selivanov'un :issue:`37228` 'deki katkılarıyla.)

source: Notable changes in Python 3.8.8
tr: Python 3.8.8'deki önemli değişiklikler

source: Earlier Python versions allowed using both ``;`` and ``&`` as query parameter separators in :func:`urllib.parse.parse_qs` and :func:`urllib.parse.parse_qsl`. Due to security concerns, and to conform with newer W3C recommendations, this has been changed to allow only a single separator key, with ``&`` as the default. This change also affects :func:`cgi.parse` and :func:`cgi.parse_multipart` as they use the affected functions internally. For more details, please see their respective documentation. (Contributed by Adam Goldschmidt, Senthil Kumaran and Ken Jin in :issue:`42967`.)
tr: Daha önceki Python sürümleri :func:`urllib.parse.parse_qs` ve :func:`urllib.parse.parse_qsl` içinde sorgu parametresi ayırıcıları olarak hem ``;`` hem de ``&`` kullanılmasına izin veriyordu. Güvenlik endişeleri nedeniyle ve daha yeni W3C önerilerine uymak için, bu, varsayılan olarak ``&`` ile yalnızca tek bir ayırıcı anahtara izin verecek şekilde değiştirildi. Bu değişiklik aynı zamanda :func:`cgi.parse` ve :func:`cgi.parse_multipart` fonksiyonlarını da etkilemektedir. Daha fazla ayrıntı için lütfen ilgili belgelere bakın. (Adam Goldschmidt, Senthil Kumaran ve Ken Jin'in :issue:`42967` 'deki katkılarıyla.)

source: Notable changes in Python 3.8.12
tr: Python 3.8.12'deki önemli değişiklikler

source: Starting with Python 3.8.12 the :mod:`ipaddress` module no longer accepts any leading zeros in IPv4 address strings. Leading zeros are ambiguous and interpreted as octal notation by some libraries. For example the legacy function :func:`socket.inet_aton` treats leading zeros as octal notation. glibc implementation of modern :func:`~socket.inet_pton` does not accept any leading zeros.
tr: Python 3.8.12'den itibaren :mod:`ipaddress` modülü artık IPv4 adres dizilerinde baştaki sıfırları kabul etmemektedir. Öndeki sıfırlar belirsizdir ve bazı kitaplıklar tarafından sekizli gösterim olarak yorumlanır. Örneğin, eski fonksiyon :func:`socket.inet_aton` baştaki sıfırları sekizli gösterim olarak ele alır. Modern :func:`~socket.inet_pton` glibc uygulaması baştaki sıfırları kabul etmez.

source: (Originally contributed by Christian Heimes in :issue:`36384`, and backported to 3.8 by Achraf Merzouki.)
tr: (Aslen :issue:`36384` içinde Christian Heimes tarafından katkıda bulunulmuştur ve Achraf Merzouki tarafından 3.8'e geri aktarılmıştır.)
