Repository: python/python-docs-tr
Catalog: whatsnew/3.8.po
Languages: tr

source: The :mod:`tokenize` module now implicitly emits a ``NEWLINE`` token when provided with input that does not have a trailing new line. This behavior now matches what the C tokenizer does internally. (Contributed by Ammar Askar in :issue:`33899`.)
tr: :mod:`tokenize` modülü artık sonda yeni bir satır olmayan girdi sağlandığında örtük olarak bir ``NEWLINE`` belirteci yayar. Bu davranış artık C tokenizer'ın dahili olarak yaptığı ile eşleşiyor. (Ammar Askar'ın :issue:`33899` 'daki katkısıyla.)

source: Added methods :meth:`~tkinter.Spinbox.selection_from`, :meth:`~tkinter.Spinbox.selection_present`, :meth:`~tkinter.Spinbox.selection_range` and :meth:`~tkinter.Spinbox.selection_to` in the :class:`tkinter.Spinbox` class. (Contributed by Juliette Monsel in :issue:`34829`.)
tr: :class:`tkinter.Spinbox` sınıfına :meth:`~tkinter.Spinbox.selection_from`, :meth:`~tkinter.Spinbox.selection_present`, :meth:`~tkinter.Spinbox.selection_range` ve :meth:`~tkinter.Spinbox.selection_to` yöntemleri eklendi. (Juliette Monsel'ın :issue:`34829` 'daki katkısıyla.)

source: Added method :meth:`~tkinter.Canvas.moveto` in the :class:`tkinter.Canvas` class. (Contributed by Juliette Monsel in :issue:`23831`.)
tr: :class:`tkinter.Canvas` sınıfına :meth:`~tkinter.Canvas.moveto` metodu eklendi. (Juliette Monsel'ın :issue:`23831` 'deki katkısıyla.)

source: The :class:`tkinter.PhotoImage` class now has :meth:`~tkinter.PhotoImage.transparency_get` and :meth:`~tkinter.PhotoImage.transparency_set` methods. (Contributed by Zackery Spytz in :issue:`25451`.)
tr: :class:`tkinter.PhotoImage` sınıfı artık :meth:`~tkinter.PhotoImage.transparency_get` ve :meth:`~tkinter.PhotoImage.transparency_set` yöntemlerine sahiptir. (Zackery Spytz'in :issue:`25451` 'deki katkısıyla.)

source: Added new clock :data:`~time.CLOCK_UPTIME_RAW` for macOS 10.12. (Contributed by Joannah Nanjekye in :issue:`35702`.)
tr: macOS 10.12 için yeni saat :data:`~time.CLOCK_UPTIME_RAW` eklendi. (Joannah Nanjekye'nın :issue:`35702` 'deki katkısıyla.)

source: The :mod:`typing` module incorporates several new features:
tr: :mod:`typing` modülü birkaç yeni özellik içerir:

source: A dictionary type with per-key types. See :pep:`589` and :class:`typing.TypedDict`. TypedDict uses only string keys. By default, every key is required to be present. Specify "total=False" to allow keys to be optional::
tr: Anahtar başına türleri olan bir sözlük türü. Bakınız :pep:`589` ve :class:`typing.TypedDict`. TypedDict yalnızca dize anahtarları kullanır. Varsayılan olarak, her anahtarın mevcut olması gerekir. Anahtarların isteğe bağlı olmasına izin vermek için "total=False" belirtin::

source: Literal types. See :pep:`586` and :class:`typing.Literal`. Literal types indicate that a parameter or return value is constrained to one or more specific literal values::
tr: Değişmez tipler. Bakınız :pep:`586` ve :class:`typing.Literal`. Değişmez tipler, bir parametrenin veya dönüş değerinin bir veya daha fazla belirli değişmez değerle sınırlandırıldığını gösterir::

source: "Final" variables, functions, methods and classes. See :pep:`591`, :class:`typing.Final` and :func:`typing.final`. The final qualifier instructs a static type checker to restrict subclassing, overriding, or reassignment::
tr: "Final" değişkenler, fonksiyonlar, metotlar ve sınıflar. Bakınız :pep:`591`, :class:`typing.Final` ve :func:`typing.final`. Final niteleyicisi statik tip denetleyicisine alt sınıflamayı, geçersiz kılmayı veya yeniden atamayı kısıtlama talimatı verir::

source: Protocol definitions. See :pep:`544`, :class:`typing.Protocol` and :func:`typing.runtime_checkable`. Simple ABCs like :class:`typing.SupportsInt` are now ``Protocol`` subclasses.
tr: Protokol tanımları. Bakınız :pep:`544`, :class:`typing.Protocol` ve :func:`typing.runtime_checkable`. :class:`typing.SupportsInt` gibi basit ABC'ler artık ``Protocol`` alt sınıflarıdır.

source: New protocol class :class:`typing.SupportsIndex`.
tr: Yeni protokol sınıfı :class:`typing.SupportsIndex`.

source: New functions :func:`typing.get_origin` and :func:`typing.get_args`.
tr: Yeni fonksiyonlar :func:`typing.get_origin` ve :func:`typing.get_args`.

source: The :mod:`unicodedata` module has been upgraded to use the `Unicode 12.1.0 <https://blog.unicode.org/2019/05/unicode-12-1-en.html>`_ release.
tr: :mod:`unicodedata` modülü `Unicode 12.1.0 <http://blog.unicode.org/2019/05/unicode-12-1-en.html>`_ sürümünü kullanacak şekilde yükseltildi.

source: New function :func:`~unicodedata.is_normalized` can be used to verify a string is in a specific normal form, often much faster than by actually normalizing the string. (Contributed by Max Belanger, David Euresti, and Greg Price in :issue:`32285` and :issue:`37966`).
tr: Yeni :func:`~unicodedata.is_normalized` fonksiyonu, bir dizenin belirli bir normal formda olduğunu doğrulamak için kullanılabilir, genellikle dizeyi gerçekten normalleştirmekten çok daha hızlıdır. (Max Belanger, David Euresti ve Greg Price'ın :issue:`32285` ve :issue:`37966` 'daki katkılarıyla).

source: Added :class:`~unittest.mock.AsyncMock` to support an asynchronous version of :class:`~unittest.mock.Mock`. Appropriate new assert functions for testing have been added as well. (Contributed by Lisa Roach in :issue:`26467`).
tr: Eklenen :class:`~unittest.mock.AsyncMock`, :class:`~unittest.mock.Mock` 'un asenkron versiyonunu desteklemektedir. Test için uygun yeni savunma fonksiyonları da eklenmiştir. (Lisa Roach'ın :issue:`26467` 'deki katkısıyla.)

source: Added :func:`~unittest.addModuleCleanup()` and :meth:`~unittest.TestCase.addClassCleanup()` to unittest to support cleanups for :func:`~unittest.setUpModule()` and :meth:`~unittest.TestCase.setUpClass()`. (Contributed by Lisa Roach in :issue:`24412`.)
tr: Unitteste :func:`~unittest.setUpModule()` ve :meth:`~unittest.TestCase.setUpClass()` için temizleme işlemlerini desteklemek üzere :func:`~unittest.addModuleCleanup()` ve :meth:`~unittest.TestCase.addClassCleanup()` eklendi. (Lisa Roach 'un :issue:`24412` 'deki katkısıyla.)

source: Several mock assert functions now also print a list of actual calls upon failure. (Contributed by Petter Strandmark in :issue:`35047`.)
tr: Birkaç sahte savunma fonksiyonu artık başarısızlık durumunda gerçek çağrıların bir listesini de yazdırıyor. (Petter Strandmark'ın :issue:`35047` 'deki katkısıyla.)

source: :mod:`unittest` module gained support for coroutines to be used as test cases with :class:`unittest.IsolatedAsyncioTestCase`. (Contributed by Andrew Svetlov in :issue:`32972`.)
tr: :mod:`unittest` modülü, :class:`unittest.IsolatedAsyncioTestCase` ile test durumları olarak kullanılacak korutinler için destek kazandı. (Andrew Svetlov'un :issue:`32972` 'deki katkısıyla.)

source: Example::
tr: Örnek:

source: :mod:`venv` now includes an ``Activate.ps1`` script on all platforms for activating virtual environments under PowerShell Core 6.1. (Contributed by Brett Cannon in :issue:`32718`.)
tr: :mod:`venv` artık PowerShell Core 6.1 altında sanal ortamları etkinleştirmek için tüm platformlarda bir ``Activate.ps1`` dizesi içeriyor (Brett Cannon'un :issue:`32718` 'deki katkısıyla.)

source: The proxy objects returned by :func:`weakref.proxy` now support the matrix multiplication operators ``@`` and ``@=`` in addition to the other numeric operators. (Contributed by Mark Dickinson in :issue:`36669`.)
tr: :func:`weakref.proxy` tarafından döndürülen proxy nesneleri artık diğer sayısal operatörlere ek olarak ``@`` ve ``@=`` matris çarpma operatörlerini de desteklemektedir. (Mark Dickinson'ın :issue:`36669` 'daki katkısıyla.)

source: As mitigation against DTD and external entity retrieval, the :mod:`xml.dom.minidom` and :mod:`xml.sax` modules no longer process external entities by default. (Contributed by Christian Heimes in :issue:`17239`.)
tr: DTD ve harici varlık alımına karşı hafifletme olarak, :mod:`xml.dom.minidom` ve :mod:`xml.sax` modülleri artık varsayılan olarak harici varlıkları işlememektedir. (Christian Heimes'ın :issue:`17239` 'daki katkısıyla.)

source: The ``.find*()`` methods in the :mod:`xml.etree.ElementTree` module support wildcard searches like ``{*}tag`` which ignores the namespace and ``{namespace}*`` which returns all tags in the given namespace. (Contributed by Stefan Behnel in :issue:`28238`.)
tr: :mod:`xml.etree.ElementTree` modülündeki ``.find*()`` yöntemleri, ad alanını yok sayan ``{*}tag`` ve verilen ad alanındaki tüm etiketleri döndüren ``{namespace}*`` gibi joker karakter aramalarını destekler. (Stefan Behnel'ın :issue:`28238` 'deki katkısıyla.)

source: The :mod:`xml.etree.ElementTree` module provides a new function :func:`–xml.etree.ElementTree.canonicalize()` that implements C14N 2.0. (Contributed by Stefan Behnel in :issue:`13611`.)
tr: :mod:`xml.etree.ElementTree` modülü, C14N 2.0'ı uygulayan yeni bir :func:`-xml.etree.ElementTree.canonicalize()` fonksiyonu sağlar. (Stefan Behnel'ın :issue:`13611` 'deki katkısıyla.)

source: The target object of :class:`xml.etree.ElementTree.XMLParser` can receive namespace declaration events through the new callback methods ``start_ns()`` and ``end_ns()``. Additionally, the :class:`xml.etree.ElementTree.TreeBuilder` target can be configured to process events about comments and processing instructions to include them in the generated tree. (Contributed by Stefan Behnel in :issue:`36676` and :issue:`36673`.)
tr: :class:`xml.etree.ElementTree.XMLParser` hedef nesnesi, yeni ``start_ns()`` ve ``end_ns()`` geri çağırma yöntemleri aracılığıyla ad alanı bildirimi olaylarını alabilir. Ek olarak, :class:`xml.etree.ElementTree.TreeBuilder` hedefi, yorumlarla ilgili olayları ve bunları oluşturulan ağaca dahil etmek için işleme talimatlarını işlemek üzere yapılandırılabilir. (Stefan Behnel'ın :issue:`36676` ve :issue:`36673` 'teki katkılarıyla.)

source: :class:`xmlrpc.client.ServerProxy` now supports an optional *headers* keyword argument for a sequence of HTTP headers to be sent with each request. Among other things, this makes it possible to upgrade from default basic authentication to faster session authentication. (Contributed by Cédric Krier in :issue:`35153`.)
tr: :class:`xmlrpc.client.ServerProxy` artık her istekle birlikte gönderilecek bir dizi HTTP başlığı için isteğe bağlı bir *headers* anahtar kelime argümanını destekliyor. Diğer şeylerin yanı sıra, bu, varsayılan temel kimlik doğrulamasından daha hızlı oturum kimlik doğrulamasına yükseltmeyi mümkün kılar. (Cédric Krier'ın :issue:`35153` 'teki katkısıyla.)

source: Optimizations
tr: Optimizasyonlar

source: The :mod:`subprocess` module can now use the :func:`os.posix_spawn` function in some cases for better performance. Currently, it is only used on macOS and Linux (using glibc 2.24 or newer) if all these conditions are met:
tr: :mod:`subprocess` modülü artık daha iyi performans için bazı durumlarda :func:`os.posix_spawn` fonksiyonunu kullanabilir. Şu anda, yalnızca macOS ve Linux'ta (glibc 2.24 veya daha yenisini kullanan) tüm bu koşullar yerine getirilirse kullanılmaktadır:

source: *close_fds* is false;
tr: *close_fds* yanlıştır;

source: *preexec_fn*, *pass_fds*, *cwd* and *start_new_session* parameters are not set;
tr: *preexec_fn*, *pass_fds*, *cwd* ve *start_new_session* parametreleri ayarlanmamış;

source: the *executable* path contains a directory.
tr: *yürütülebilir* yol bir dizin içerir.

source: (Contributed by Joannah Nanjekye and Victor Stinner in :issue:`35537`.)
tr: (Victor Stinner ve Joannah Nanjekye'nin :issue:`35537` 'deki katkılarıyla.)

source: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` and :func:`shutil.move` use platform-specific "fast-copy" syscalls on Linux and macOS in order to copy the file more efficiently. "fast-copy" means that the copying operation occurs within the kernel, avoiding the use of userspace buffers in Python as in "``outfd.write(infd.read())``". On Windows :func:`shutil.copyfile` uses a bigger default buffer size (1 MiB instead of 16 KiB) and a :func:`memoryview`-based variant of :func:`shutil.copyfileobj` is used. The speedup for copying a 512 MiB file within the same partition is about +26% on Linux, +50% on macOS and +40% on Windows. Also, much less CPU cycles are consumed. See :ref:`shutil-platform-dependent-efficient-copy-operations` section. (Contributed by Giampaolo Rodolà in :issue:`33671`.)
tr: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` ve :func:`shutil.move`, dosyayı daha verimli bir şekilde kopyalamak için Linux ve macOS'ta platforma özgü "fast-copy" sistem çağrılarını kullanır. "fast-copy", kopyalama işleminin çekirdek içinde gerçekleştiği ve Python'da "``outfd.write(infd.read())``" gibi kullanıcı alanı tamponlarının kullanılmasından kaçınıldığı anlamına gelir. Windows üzerinde :func:`shutil.copyfile` daha büyük bir varsayılan tampon boyutu kullanır (16 KiB yerine 1 MiB) ve :func:`shutil.copyfileobj` 'nin :func:`memoryview` tabanlı bir çeşidi kullanılır. Aynı bölüm içinde 512 MiB'lık bir dosyayı kopyalamak için hızlanma yaklaşık olarak Linux'te +26%, macOS'da +50% ve Windows'ta +40%'tır. Ayrıca, çok daha az CPU döngüsü tüketilir. Bkz :ref:`shutil-platform-dependent-efficient-copy-operations` bölümü. (Giampaolo Rodolà'nın :issue:`33671` 'deki katkısıyla.)

source: :func:`shutil.copytree` uses :func:`os.scandir` function and all copy functions depending from it use cached :func:`os.stat` values. The speedup for copying a directory with 8000 files is around +9% on Linux, +20% on Windows and +30% on a Windows SMB share. Also the number of :func:`os.stat` syscalls is reduced by 38% making :func:`shutil.copytree` especially faster on network filesystems. (Contributed by Giampaolo Rodolà in :issue:`33695`.)
tr: :func:`shutil.copytree` :func:`os.scandir` fonksiyonunu kullanır ve buna bağlı tüm kopyalama fonksiyonları önbelleğe alınmış :func:`os.stat` değerlerini kullanır. Linux'ta 8000 dosyalık bir dizini kopyalama hız değişimi +9% o, Windows'ta +20% ve Windows SMB paylaşımında +30% civarındadır. Ayrıca :func:`os.stat` sistem çağrılarının sayısı %38 oranında azaltılarak :func:`shutil.copytree` özellikle ağ dosya sistemlerinde daha hızlı hale getirilmiştir. (Giampaolo Rodolà'nın :issue:`33695` 'teki katkısıyla.)

source: The default protocol in the :mod:`pickle` module is now Protocol 4, first introduced in Python 3.4. It offers better performance and smaller size compared to Protocol 3 available since Python 3.0.
tr: :mod:`pickle` modülündeki varsayılan protokol artık ilk olarak Python 3.4'te tanıtılan Protokol 4'tür. Python 3.0'dan beri mevcut olan Protokol 3'e kıyasla daha iyi performans ve daha küçük boyut sunar.

source: Removed one :c:type:`Py_ssize_t` member from ``PyGC_Head``. All GC tracked objects (e.g. tuple, list, dict) size is reduced 4 or 8 bytes. (Contributed by Inada Naoki in :issue:`33597`.)
tr: Bir :c:type:`Py_ssize_t` üyesi ``PyGC_Head`` 'den kaldırıldı. Tüm GC izlenen nesnelerin (örn. tuple, list, dict) boyutu 4 veya 8 bayt azaltıldı. (Inada Naoki'nin :issue:`33597` 'deki katkısıyla.)

source: :class:`uuid.UUID` now uses ``__slots__`` to reduce its memory footprint. (Contributed by Wouter Bolsterlee and Tal Einat in :issue:`30977`)
tr: :class:`uuid.UUID` artık bellek ayak izini azaltmak için ``__slots__`` kullanıyor. (Wouter Bolsterlee ve Tal Einat'ın :issue:`30977` 'deki katkılarıyla.)

source: Improved performance of :func:`operator.itemgetter` by 33%. Optimized argument handling and added a fast path for the common case of a single non-negative integer index into a tuple (which is the typical use case in the standard library). (Contributed by Raymond Hettinger in :issue:`35664`.)
tr: :func:`operator.itemgetter` fonksiyonunun performansı %33 oranında artırıldı. Argüman işleme optimize edildi ve bir tuple içine negatif olmayan tek bir tamsayı indeksinin yaygın durumu için hızlı bir yol eklendi (standart kütüphanedeki tipik kullanım durumu budur). (Raymond Hettinger'ın :issue:`35664` 'teki katkısıyla.)

source: Sped-up field lookups in :func:`collections.namedtuple`. They are now more than two times faster, making them the fastest form of instance variable lookup in Python. (Contributed by Raymond Hettinger, Pablo Galindo, and Joe Jevnik, Serhiy Storchaka in :issue:`32492`.)
tr: :func:`collections.namedtuple` içindeki alan aramaları hızlandırıldı. Artık iki kattan daha hızlılar, bu da onları Python'daki en hızlı örnek değişken arama biçimi haline getiriyor. (Raymond Hettinger, Pablo Galindo ve Joe Jevnik, Serhiy Storchaka'nın :issue:`32492` 'deki katkılarıyla.)

source: The :class:`list` constructor does not overallocate the internal item buffer if the input iterable has a known length (the input implements ``__len__``). This makes the created list 12% smaller on average. (Contributed by Raymond Hettinger and Pablo Galindo in :issue:`33234`.)
tr: :class:`list` kurucusu, girdi yinelenebilirinin bilinen bir uzunluğu varsa (girdi ``__len__`` uygular) dahili öğe arabelleğini genel olarak ayırmaz. Bu, oluşturulan listenin ortalama %12 daha küçük olmasını sağlar. (Raymond Hettinger ve Pablo Galindo'nun :issue:`33234` 'teki katkılarıyla.)

source: Doubled the speed of class variable writes. When a non-dunder attribute was updated, there was an unnecessary call to update slots. (Contributed by Stefan Behnel, Pablo Galindo Salgado, Raymond Hettinger, Neil Schemenauer, and Serhiy Storchaka in :issue:`36012`.)
tr: Sınıf değişkeni yazma hızı iki katına çıkarıldı. Dunder olmayan bir nitelik güncellendiğinde, yuvaları güncellemek için gereksiz bir çağrı vardı. (Stefan Behnel, Pablo Galindo Salgado, Raymond Hettinger, Neil Schemenauer ve Serhiy Storchaka'nın :issue:`36012` 'deki katkılarıyla.)

source: Reduced an overhead of converting arguments passed to many builtin functions and methods. This sped up calling some simple builtin functions and methods up to 20--50%. (Contributed by Serhiy Storchaka in :issue:`23867`, :issue:`35582` and :issue:`36127`.)
tr: Birçok yerleşik fonksiyon ve metoda aktarılan argümanları dönüştürme yükü azaltıldı. Bu, bazı basit yerleşik fonksiyonların ve yöntemlerin çağrılmasını %20--50'ye kadar hızlandırdı. (Serhiy Storchaka'nın :issue:`23867`, :issue:`35582` ve :issue:`36127` 'deki katkılarıyla.)

source: ``LOAD_GLOBAL`` instruction now uses new "per opcode cache" mechanism. It is about 40% faster now. (Contributed by Yury Selivanov and Inada Naoki in :issue:`26219`.)
tr: ``LOAD_GLOBAL`` komutu artık yeni "işlem kodu başına önbellek" mekanizmasını kullanıyor. Şimdi yaklaşık 40% daha hızlı. (Yury Selivanov ve Inada Naoki'nin :issue:`26219` 'daki katkılarıyla.)

source: Build and C API Changes
tr: Derleme ve C API Değişiklikleri

source: Default :data:`sys.abiflags` became an empty string: the ``m`` flag for pymalloc became useless (builds with and without pymalloc are ABI compatible) and so has been removed. (Contributed by Victor Stinner in :issue:`36707`.)
tr: Varsayılan :data:`sys.abiflags` boş bir dize haline geldi: pymalloc için ``m`` bayrağı işe yaramaz hale geldi (hem pymalloc içeren hem de içermeyen derlemeler ABI uyumludur) ve bu nedenle kaldırıldı. (Victor Stinner'ın :issue:`36707` 'deki katkısıyla.)

source: Example of changes:
tr: Değişikliklerin örneği:

source: Only ``python3.8`` program is installed, ``python3.8m`` program is gone.
tr: Sadece ``python3.8`` programı kurulur, ``python3.8m`` programı kaldırılır.

source: Only ``python3.8-config`` script is installed, ``python3.8m-config`` script is gone.
tr: Yalnızca ``python3.8-config`` dizesi yüklendi, ``python3.8m-config`` dizesi gitti.

source: The ``m`` flag has been removed from the suffix of dynamic library filenames: extension modules in the standard library as well as those produced and installed by third-party packages, like those downloaded from PyPI. On Linux, for example, the Python 3.7 suffix ``.cpython-37m-x86_64-linux-gnu.so`` became ``.cpython-38-x86_64-linux-gnu.so`` in Python 3.8.
tr: Dinamik kütüphane dosya adlarının son ekinden ``m`` bayrağı kaldırıldı: standart kütüphanedeki uzantı modüllerinin yanı sıra PyPI'dan indirilenler gibi üçüncü taraf paketleri tarafından üretilen ve yüklenenler. Örneğin Linux'ta Python 3.7 soneki ``.cpython-37m-x86_64-linux-gnu.so`` Python 3.8'de ``.cpython-38-x86_64-linux-gnu.so`` oldu.

source: The header files have been reorganized to better separate the different kinds of APIs:
tr: Başlık dosyaları, farklı API türlerini daha iyi ayırmak için yeniden düzenlenmiştir:

source: ``Include/*.h`` should be the portable public stable C API.
tr: ``Include/*.h``, taşınabilir genel kararlı C API'si olmalıdır.

source: ``Include/cpython/*.h`` should be the unstable C API specific to CPython; public API, with some private API prefixed by ``_Py`` or ``_PY``.
tr: ``Include/cpython/*.h``, CPython'a özgü kararsız C API'si olmalıdır; ``_Py`` veya ``_PY`` ile ön eklenmiş bazı özel API ile genel API.

source: ``Include/internal/*.h`` is the private internal C API very specific to CPython. This API comes with no backward compatibility warranty and should not be used outside CPython. It is only exposed for very specific needs like debuggers and profiles which has to access to CPython internals without calling functions. This API is now installed by ``make install``.
tr: ``Include/internal/*.h`` CPython'a özgü özel dahili C API'sidir. Bu API geriye dönük uyumluluk garantisi olmadan gelir ve CPython dışında kullanılmamalıdır. Sadece hata ayıklayıcılar ve fonksiyonları çağırmadan CPython içlerine erişmek zorunda olan profiller gibi çok özel ihtiyaçlar için açığa çıkar. Bu API artık ``make install`` tarafından yüklenmektedir.

source: (Contributed by Victor Stinner in :issue:`35134` and :issue:`35081`, work initiated by Eric Snow in Python 3.7.)
tr: (Eric Snow tarafından Python 3.7'de başlatılan çalışmaya :issue:`35134` ve :issue:`35081` 'de Victor Stinner tarafından katkı sağlanmıştır.)

source: Some macros have been converted to static inline functions: parameter types and return type are well defined, they don't have issues specific to macros, variables have a local scopes. Examples:
tr: Bazı makrolar statik satır içi fonksiyonlara dönüştürülmüştür: parametre türleri ve dönüş türü iyi tanımlanmıştır, makrolara özgü sorunları yoktur, değişkenlerin yerel kapsamları vardır. Örnekler:

source: Private functions: :c:func:`_PyObject_GC_TRACK`, :c:func:`_PyObject_GC_UNTRACK`, :c:func:`_Py_Dealloc`
tr: Özel fonksiyonlar: :c:func:`_PyObject_GC_TRACK`, :c:func:`_PyObject_GC_UNTRACK`, :c:func:`_Py_Dealloc`

source: (Contributed by Victor Stinner in :issue:`35059`.)
tr: (Victor Stinner'ın :issue:`35059` 'daki katkısıyla.)

source: The :c:func:`PyByteArray_Init` and :c:func:`PyByteArray_Fini` functions have been removed. They did nothing since Python 2.7.4 and Python 3.2.0, were excluded from the limited API (stable ABI), and were not documented. (Contributed by Victor Stinner in :issue:`35713`.)
tr: :c:func:`PyByteArray_Init` ve :c:func:`PyByteArray_Fini` fonksiyonları kaldırıldı. Python 2.7.4 ve Python 3.2.0'dan bu yana hiçbir şey yapmadılar, sınırlı API'den (kararlı ABI) çıkarıldılar ve belgelenmediler. (Victor Stinner'ın :issue:`35713` 'teki katkısıyla.)

source: The result of :c:func:`PyExceptionClass_Name` is now of type ``const char *`` rather of ``char *``. (Contributed by Serhiy Storchaka in :issue:`33818`.)
tr: :c:func:`PyExceptionClass_Name` sonucu artık ``char *`` yerine ``const char *`` türündedir. (Serhiy Storchaka'nın :issue:`33818` 'deki katkısıyla.)
