Repository: python/python-docs-tr
Catalog: whatsnew/3.9.po
Languages: tr

source: Methods ``getchildren()`` and ``getiterator()`` of classes :class:`~xml.etree.ElementTree.ElementTree` and :class:`~xml.etree.ElementTree.Element` in the :mod:`~xml.etree.ElementTree` module have been removed. They were deprecated in Python 3.2. Use ``iter(x)`` or ``list(x)`` instead of ``x.getchildren()`` and ``x.iter()`` or ``list(x.iter())`` instead of ``x.getiterator()``. (Contributed by Serhiy Storchaka in :issue:`36543`.)
tr: :mod:`~xml.etree.ElementTree` modülündeki :class:`~xml.etree.ElementTree.ElementTree` ve :class:`~xml.etree.ElementTree.Element` sınıflarının ``getchildren()`` ve ``getiterator()`` yöntemleri kaldırıldı . Python 3.2'de kullanımdan kaldırıldılar. ``x.getchildren()`` yerine ``iter(x)`` ve ``x.getiterator()`` yerine ``x.iter()`` veya ``list(x.iter())`` kullanın. ( :issue:`36543` içinde Serhiy Storchaka tarafından katılmıştır.)

source: The old :mod:`plistlib` API has been removed, it was deprecated since Python 3.4. Use the :func:`~plistlib.load`, :func:`~plistlib.loads`, :func:`~plistlib.dump`, and :func:`~plistlib.dumps` functions. Additionally, the *use_builtin_types* parameter was removed, standard :class:`bytes` objects are always used instead. (Contributed by Jon Janzen in :issue:`36409`.)
tr: Eski :mod:`plistlib` API'si kaldırıldı, Python 3.4'ten beri kullanımdan kaldırıldı. :func:`~plistlib.load`, :func:`~plistlib.loads`, :func:`~plistlib.dump` ve :func:`~plistlib.dumps` işlevlerini kullanın. Ek olarak, *use_builtin_types* parametresi kaldırıldı, bunun yerine her zaman standart :class:`bytes` nesneleri kullanıldı. (Jon Janzen tarafından :issue:`36409` 'da katılmıştır.)

source: The C function ``PyGen_NeedsFinalizing`` has been removed. It was not documented, tested, or used anywhere within CPython after the implementation of :pep:`442`. Patch by Joannah Nanjekye. (Contributed by Joannah Nanjekye in :issue:`15088`)
tr: ``PyGen_NeedsFinalizing`` C işlevi kaldırıldı. :pep:`442` uygulandıktan sonra CPython içinde herhangi bir yerde belgelenmedi, test edilmedi veya kullanılmadı. Yama Joannah Nanjekye tarafından. (Joannah Nanjekye tarafından :issue:`15088` 'de katılmıştır)

source: ``base64.encodestring()`` and ``base64.decodestring()``, aliases deprecated since Python 3.1, have been removed: use :func:`base64.encodebytes` and :func:`base64.decodebytes` instead. (Contributed by Victor Stinner in :issue:`39351`.)
tr: Python 3.1'den beri kullanımdan kaldırılan ``base64.encodestring()`` ve ``base64.decodestring()`` takma adları kaldırıldı: bunun yerine :func:`base64.encodebytes` ve :func:`base64.decodebytes` kullanın. (Victor Stinner tarafından :issue:`39351` 'de katılmıştır.)

source: ``fractions.gcd()`` function has been removed, it was deprecated since Python 3.5 (:issue:`22486`): use :func:`math.gcd` instead. (Contributed by Victor Stinner in :issue:`39350`.)
tr: ``fractions.gcd()`` işlevi kaldırıldı, Python 3.5'ten beri kullanımdan kaldırıldı (:issue:`22486`): bunun yerine :func:`math.gcd` kullanın. (Victor Stinner tarafından :issue:`39350` 'de katılmıştır.)

source: The *buffering* parameter of :class:`bz2.BZ2File` has been removed. Since Python 3.0, it was ignored and using it emitted a :exc:`DeprecationWarning`. Pass an open file object to control how the file is opened. (Contributed by Victor Stinner in :issue:`39357`.)
tr: :class:`bz2.BZ2File` öğesinin *buffering* parametresi kaldırıldı. Python 3.0'dan bu yana yok sayıldı ve kullanıldığında bir :exc:`DeprecationWarning` yaydı. Dosyanın nasıl açılacağını kontrol etmek için bir açık dosya nesnesi iletin. (Victor Stinner tarafından :issue:`39357` 'de katılmıştır.)

source: The *encoding* parameter of :func:`json.loads` has been removed. As of Python 3.1, it was deprecated and ignored; using it has emitted a :exc:`DeprecationWarning` since Python 3.8. (Contributed by Inada Naoki in :issue:`39377`)
tr: :func:`json.loads` öğesinin *encoding* parametresi kaldırıldı. Python 3.1'den itibaren kullanımdan kaldırıldı ve göz ardı edildi; onu kullanmak Python 3.8'den beri bir :exc:`DeprecationWarning` yayınladı. (Inada Naoki'nin katkılarıyla :issue:`39377`)

source: ``with (await asyncio.lock):`` and ``with (yield from asyncio.lock):`` statements are not longer supported, use ``async with lock`` instead. The same is correct for ``asyncio.Condition`` and ``asyncio.Semaphore``. (Contributed by Andrew Svetlov in :issue:`34793`.)
tr: ``with (awat asyncio.lock):`` ve ``with (get from asyncio.lock):`` ifadeleri artık desteklenmemektedir, bunun yerine ``async with lock`` kullanın. Aynı şey ``asyncio.Condition`` ve ``asyncio.Semaphore`` için de geçerlidir. (Andrew Svetlov tarafından :issue:`34793` 'de katılmıştır.)

source: The :func:`sys.getcounts` function, the ``-X showalloccount`` command line option and the ``show_alloc_count`` field of the C structure :c:type:`PyConfig` have been removed. They required a special Python build by defining ``COUNT_ALLOCS`` macro. (Contributed by Victor Stinner in :issue:`39489`.)
tr: C yapısının :func:`sys.getcounts` işlevi, ``-X showalloccount`` komut satırı seçeneği ve :c:type:`PyConfig` ``show_alloc_count`` alanı kaldırıldı. ``COUNT_ALLOCS`` makrosu tanımlayarak özel bir Python yapısına ihtiyaç duydular. (Victor Stinner'ın :issue:`39489` 'daki katkısıyla)

source: The ``_field_types`` attribute of the :class:`typing.NamedTuple` class has been removed. It was deprecated since Python 3.8. Use the ``__annotations__`` attribute instead. (Contributed by Serhiy Storchaka in :issue:`40182`.)
tr: :class:`typing.NamedTuple` sınıfının ``_field_types`` özniteliği kaldırıldı. Python 3.8'den beri kullanımdan kaldırılmıştır. Bunun yerine ``__annotations__`` özelliğini kullanın. (Serhiy Storchaka'nın :issue:`40182` 'deki katkısıyla)

source: The :meth:`symtable.SymbolTable.has_exec` method has been removed. It was deprecated since 2006, and only returning ``False`` when it's called. (Contributed by Batuhan Taskaya in :issue:`40208`)
tr: :meth:`symtable.SymbolTable.has_exec` yöntemi kaldırıldı. 2006'dan beri kullanımdan kaldırılmıştır ve yalnızca çağrıldığında ``False`` değerini döndürmektedir. (Batuhan Taşkaya :issue:`40208` 'de katılmıştır)

source: The :meth:`asyncio.Task.current_task` and :meth:`asyncio.Task.all_tasks` have been removed. They were deprecated since Python 3.7 and you can use :func:`asyncio.current_task` and :func:`asyncio.all_tasks` instead. (Contributed by Rémi Lapeyre in :issue:`40967`)
tr: :meth:`asyncio.Task.current_task` ve :meth:`asyncio.Task.all_tasks` kaldırıldı. Python 3.7'den beri kullanımdan kaldırıldılar ve bunun yerine :func:`asyncio.current_task` ve :func:`asyncio.all_tasks` kullanabilirsiniz. (Rémi Lapeyre tarafından :issue:`40967` 'de katılmıştır)

source: The ``unescape()`` method in the :class:`html.parser.HTMLParser` class has been removed (it was deprecated since Python 3.4). :func:`html.unescape` should be used for converting character references to the corresponding unicode characters.
tr: :class:`html.parser.HTMLParser` sınıfındaki ``unescape()`` metodu kaldırıldı (Python 3.4'ten beri kullanımdan kaldırıldı). :func:`html.unescape`, karakter referanslarını karşılık gelen unicode karakterlere dönüştürmek için kullanılmalıdır.

source: Porting to Python 3.9
tr: Python 3.9'a Taşıma

source: This section lists previously described changes and other bugfixes that may require changes to your code.
tr: Bu bölüm, daha önce açıklanan değişiklikleri ve kodunuzda değişiklik gerektirebilecek diğer hata düzeltmelerini listeler.

source: Changes in the Python API
tr: Python API'sindeki Değişiklikler

source: :func:`__import__` and :func:`importlib.util.resolve_name` now raise :exc:`ImportError` where it previously raised :exc:`ValueError`. Callers catching the specific exception type and supporting both Python 3.9 and earlier versions will need to catch both using ``except (ImportError, ValueError):``.
tr: :func:`__import__` ve :func:`importlib.util.resolve_name` şimdi daha önce :exc:`ValueError` oluşturduğu yerde :exc:`ImportError` 'u yükseltiyor. Belirli istisna türünü yakalayan ve hem Python 3.9 hem de önceki sürümleri destekleyen arayanların, ``except (ImportError, ValueError):`` kullanarak her ikisini de yakalaması gerekir.

source: The :mod:`venv` activation scripts no longer special-case when ``__VENV_PROMPT__`` is set to ``""``.
tr: :mod:`venv` etkinleştirme betikleri, ``__VENV_PROMPT__`` ``""`` olarak ayarlandığında artık özel durum değildir.

source: The :meth:`select.epoll.unregister` method no longer ignores the :data:`~errno.EBADF` error. (Contributed by Victor Stinner in :issue:`39239`.)
tr: :meth:`select.epoll.unregister` yöntemi artık :data:`~errno.EBADF` hatasını yok saymıyor. (Victor Stinner tarafından :issue:`39239` 'da katılmıştır.)

source: The *compresslevel* parameter of :class:`bz2.BZ2File` became keyword-only, since the *buffering* parameter has been removed. (Contributed by Victor Stinner in :issue:`39357`.)
tr: :class:`bz2.BZ2File` öğesinin *compresslevel* parametresi, *buffering* parametresi kaldırıldığı için yalnızca anahtar kelime haline geldi. (Victor Stinner tarafından :issue:`39357` 'de katılmıştır.)

source: Simplified AST for subscription. Simple indices will be represented by their value, extended slices will be represented as tuples. ``Index(value)`` will return a ``value`` itself, ``ExtSlice(slices)`` will return ``Tuple(slices, Load())``. (Contributed by Serhiy Storchaka in :issue:`34822`.)
tr: Abonelik için basitleştirilmiş AST. Basit indeksler değerleri ile temsil edilecek, genişletilmiş dilimler demetler olarak temsil edilecektir. ``Index(value)``, bir ``value`` döndürür, ``ExtSlice(slices)``, ``Tuple(slices, Load())`` döndürür. ( :issue:`34822` ile Serhiy Storchaka tarafından katılmıştır.)

source: The :mod:`importlib` module now ignores the :envvar:`PYTHONCASEOK` environment variable when the :option:`-E` or :option:`-I` command line options are being used.
tr: :mod:`importlib` modülü artık :option:`-E` veya :option:`-I` komut satırı seçenekleri kullanılırken :envvar:`PYTHONCASEOK` ortam değişkenini yok sayar.

source: The *encoding* parameter has been added to the classes :class:`ftplib.FTP` and :class:`ftplib.FTP_TLS` as a keyword-only parameter, and the default encoding is changed from Latin-1 to UTF-8 to follow :rfc:`2640`.
tr: *kodlama* parametresi :class:`ftplib.FTP` ve :class:`ftplib.FTP_TLS` sınıflarına yalnızca anahtar kelime parametresi olarak eklendi ve varsayılan kodlama Latin-1'den UTF-8'e değiştirilerek :rfc:`2640` olarak değiştirildi .

source: :meth:`asyncio.loop.shutdown_default_executor` has been added to :class:`~asyncio.AbstractEventLoop`, meaning alternative event loops that inherit from it should have this method defined. (Contributed by Kyle Stanley in :issue:`34037`.)
tr: :meth:`asyncio.loop.shutdown_default_executor`, :class:`~asyncio.AbstractEventLoop` öğesine eklendi, yani ondan devralan alternatif olay döngülerinde bu yöntem tanımlanmalıdır. (Kyle Stanley tarafından :issue:`34037` 'de katılmıştır.)

source: The constant values of future flags in the :mod:`__future__` module is updated in order to prevent collision with compiler flags. Previously ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` was clashing with ``CO_FUTURE_DIVISION``. (Contributed by Batuhan Taskaya in :issue:`39562`)
tr: :mod:`__future__` modülündeki gelecek bayraklarının sabit değerleri, derleyici bayraklarıyla çarpışmayı önlemek için güncellenir. Daha önce ``PyCF_ALLOW_TOP_LEVEL_AWAIT``, ``CO_FUTURE_DIVISION`` ile çakışıyordu. (Batuhan Taskaya :issue:`39562` 'de katılmıştır)

source: ``array('u')`` now uses ``wchar_t`` as C type instead of ``Py_UNICODE``. This change doesn't affect to its behavior because ``Py_UNICODE`` is alias of ``wchar_t`` since Python 3.3. (Contributed by Inada Naoki in :issue:`34538`.)
tr: ``array('u')`` artık C tipi olarak ``Py_UNICODE`` yerine ``wchar_t`` kullanıyor. Python 3.3'ten bu yana ``Py_UNICODE`` ``wchar_t`` takma adı olduğundan, bu değişiklik davranışını etkilemez. (Inada Naoki tarafından :issue:`34538` 'de katılmıştır.)

source: The :func:`logging.getLogger` API now returns the root logger when passed the name ``'root'``, whereas previously it returned a non-root logger named ``'root'``. This could affect cases where user code explicitly wants a non-root logger named ``'root'``, or instantiates a logger using ``logging.getLogger(__name__)`` in some top-level module called ``'root.py'``. (Contributed by Vinay Sajip in :issue:`37742`.)
tr: :func:`logging.getLogger` API'si artık ``root'`` adı iletildiğinde kök kaydediciyi döndürürken, daha önce ``'root'`` adlı kök olmayan bir günlükçü döndürdü. Bu, kullanıcı kodunun ``'root'`` adlı kök olmayan bir günlükçüyü açıkça istediği veya ``'root.py'`` adlı bazı üst düzey modüllerde ``logging.getLogger(__name__)`` kullanarak bir günlükçü başlattığı durumları etkileyebilir. ( :issue:`37742` içinde Vinay Sajip tarafından katılmıştır.)

source: Division handling of :class:`~pathlib.PurePath` now returns ``NotImplemented`` instead of raising a :exc:`TypeError` when passed something other than an instance of ``str`` or :class:`~pathlib.PurePath`. This allows creating compatible classes that don't inherit from those mentioned types. (Contributed by Roger Aiudi in :issue:`34775`).
tr: :class:`~pathlib.PurePath` 'nın bölümleme işlemi, ``str`` veya :class:`~pathlib.PurePath` örneğinden başka bir şey iletildiğinde bir :exc:`TypeError` yükseltmek yerine artık ``NotImplemented`` döndürüyor. Bu, belirtilen türlerden miras almayan uyumlu sınıflar oluşturmaya izin verir. ( :issue:`34775` içinde Roger Aiudi tarafından katılmıştır).

source: Starting with Python 3.9.5 the :mod:`ipaddress` module no longer accepts any leading zeros in IPv4 address strings. Leading zeros are ambiguous and interpreted as octal notation by some libraries. For example the legacy function :func:`socket.inet_aton` treats leading zeros as octal notatation. glibc implementation of modern :func:`~socket.inet_pton` does not accept any leading zeros. (Contributed by Christian Heimes in :issue:`36384`).
tr: Python 3.9.5'ten itibaren :mod:`ipaddress` modülü artık IPv4 adres dizilerinde baştaki sıfırları kabul etmemektedir. Öndeki sıfırlar belirsizdir ve bazı kitaplıklar tarafından sekizli gösterim olarak yorumlanır. Örneğin, eski işlev :func:`socket.inet_aton` baştaki sıfırları sekizli gösterim olarak ele alır. Modern :func:`~socket.inet_pton` glibc uygulaması baştaki sıfırları kabul etmez. ( :issue:`36384` içinde Christian Heimes tarafından katılmıştır).

source: :func:`codecs.lookup` now normalizes the encoding name the same way as :func:`encodings.normalize_encoding`, except that :func:`codecs.lookup` also converts the name to lower case. For example, ``"latex+latin1"`` encoding name is now normalized to ``"latex_latin1"``. (Contributed by Jordon Xu in :issue:`37751`.)
tr: :func:`codecs.lookup` artık kodlama adını :func:`encodings.normalize_encoding` ile aynı şekilde normalleştirir, ancak :func:`codecs.lookup` ayrıca adı küçük harfe dönüştürür. Örneğin, ``"latex+latin1"`` kodlama adı artık ``"latex_latin1"`` olarak normalleştirildi. ( :issue:`37751` 'de Jordon Xu tarafından katılmıştır.)

source: Changes in the C API
tr: C API'sindeki değişiklikler

source: Instances of :ref:`heap-allocated types <heap-types>` (such as those created with :c:func:`PyType_FromSpec` and similar APIs) hold a reference to their type object since Python 3.8. As indicated in the "Changes in the C API" of Python 3.8, for the vast majority of cases, there should be no side effect but for types that have a custom :c:member:`~PyTypeObject.tp_traverse` function, ensure that all custom ``tp_traverse`` functions of heap-allocated types visit the object's type.
tr: :ref:`heap-allocated type <heap-types>` örnekleri ( :c:func:`PyType_FromSpec` ve benzer API'ler ile oluşturulanlar gibi), Python 3.8'den bu yana tür nesnesine bir başvuru içerir. Python 3.8'in "C API'sindeki Değişiklikler" bölümünde belirtildiği gibi, vakaların büyük çoğunluğu için herhangi bir yan etki olmamalıdır, ancak özel bir :c:member:`~PyTypeObject.tp_traverse` 'ya sahip türler için tüm özel ``tp_traverse`` yığın işlevlerinin yapıldığından emin olun. tahsis edilen tipler, nesnenin tipini ziyaret eder.

source: If your traverse function delegates to ``tp_traverse`` of its base class (or another type), ensure that ``Py_TYPE(self)`` is visited only once. Note that only :ref:`heap type <heap-types>` are expected to visit the type in ``tp_traverse``.
tr: Geçiş işleviniz, temel sınıfının (veya başka bir türün) ``tp_traverse`` için yetkisini veriyorsa, ``Py_TYPE(self)`` öğesinin yalnızca bir kez ziyaret edildiğinden emin olun. Yalnızca :ref:`heap type <heap-types>` 'ın ``tp_traverse`` içindeki tipi ziyaret etmesinin beklendiğini unutmayın.

source: For example, if your ``tp_traverse`` function includes:
tr: Örneğin, ``tp_traverse`` işleviniz aşağıdakileri içeriyorsa:

source: (See :issue:`35810` and :issue:`40217` for more information.)
tr: (Daha fazla bilgi için bkz. :issue:`35810` ve :issue:`40217`.)

source: The functions ``PyEval_CallObject``, ``PyEval_CallFunction``, ``PyEval_CallMethod`` and ``PyEval_CallObjectWithKeywords`` are deprecated. Use :c:func:`PyObject_Call` and its variants instead. (See more details in :issue:`29548`.)
tr: ``PyEval_CallObject``, ``PyEval_CallFunction``, ``PyEval_CallMethod`` ve ``PyEval_CallObjectWithKeywords`` işlevleri kullanımdan kaldırılmıştır. Bunun yerine :c:func:`PyObject_Call` ve türevlerini kullanın. (Daha fazla ayrıntı için :issue:`29548` konusuna bakın.)

source: CPython bytecode changes
tr: CPython bayt kodu değişiklikleri

source: The :opcode:`LOAD_ASSERTION_ERROR` opcode was added for handling the :keyword:`assert` statement. Previously, the assert statement would not work correctly if the :exc:`AssertionError` exception was being shadowed. (Contributed by Zackery Spytz in :issue:`34880`.)
tr: :opcode:`LOAD_ASSERTION_ERROR` işlem kodu, :keyword:`assert` ifadesini işlemek için eklendi. Önceden, :exc:`AssertionError` istisnası gölgeleniyorsa, iddia ifadesi düzgün çalışmıyordu. ( :issue:`34880` içinde Zackery Spytz tarafından katılmıştır.)

source: The :opcode:`COMPARE_OP` opcode was split into four distinct instructions:
tr: :opcode:`COMPARE_OP` işlem kodu dört farklı talimata bölünmüştür:

source: ``COMPARE_OP`` for rich comparisons
tr: Zengin karşılaştırmalar için ``COMPARE_OP``

source: ``IS_OP`` for 'is' and 'is not' tests
tr: '-dir' ve 'değildir' testleri için ``IS_OP``

source: ``CONTAINS_OP`` for 'in' and 'not in' tests
tr: ``İçeride`` ve ``içeride değil`` testleri için ``CONTAINS_OP``

source: ``JUMP_IF_NOT_EXC_MATCH`` for checking exceptions in 'try-except' statements.
tr: 'try-except' ifadelerindeki istisnaları kontrol etmek için ``JUMP_IF_NOT_EXC_MATCH``.

source: (Contributed by Mark Shannon in :issue:`39156`.)
tr: (Mark Shannon tarafından :issue:`39156` 'da katılmıştır.)

source: Build Changes
tr: Yapı Değişiklikleri

source: Added ``--with-platlibdir`` option to the ``configure`` script: name of the platform-specific library directory, stored in the new :attr:`sys.platlibdir` attribute. See :attr:`sys.platlibdir` attribute for more information. (Contributed by Jan Matějek, Matěj Cepl, Charalampos Stratakis and Victor Stinner in :issue:`1294959`.)
tr: ``configure`` betiğine ``--with-platlibdir`` seçeneği eklendi: yeni :attr:`sys.platlibdir` özniteliğinde saklanan platforma özgü kitaplık dizininin adı. Daha fazla bilgi için :attr:`sys.platlibdir` niteliğine bakın. (Jan Matějek, Matěj Cepl, Charalampos Stratakis ve Victor Stinner'ın katkılarıyla :issue:`1294959`.)

source: The ``COUNT_ALLOCS`` special build macro has been removed. (Contributed by Victor Stinner in :issue:`39489`.)
tr: ``COUNT_ALLOCS`` özel yapı makrosu kaldırıldı. (Victor Stinner tarafından :issue:`39489` 'da katılmıştır.)

source: On non-Windows platforms, the :c:func:`setenv` and :c:func:`unsetenv` functions are now required to build Python. (Contributed by Victor Stinner in :issue:`39395`.)
tr: Windows olmayan platformlarda, Python'u oluşturmak için artık :c:func:`setenv` ve :c:func:`unsetenv` işlevleri gereklidir. (Victor Stinner tarafından :issue:`39395` 'de katılmıştır.)

source: On non-Windows platforms, creating ``bdist_wininst`` installers is now officially unsupported. (See :issue:`10945` for more details.)
tr: Windows dışı platformlarda, ``bdist_wininst`` yükleyicilerin oluşturulması artık resmi olarak desteklenmemektedir. (Daha fazla ayrıntı için bkz. :issue:`10945`.)

source: When building Python on macOS from source, ``_tkinter`` now links with non-system Tcl and Tk frameworks if they are installed in ``/Library/Frameworks``, as had been the case on older releases of macOS. If a macOS SDK is explicitly configured, by using :option:`--enable-universalsdk` or ``-isysroot``, only the SDK itself is searched. The default behavior can still be overridden with ``--with-tcltk-includes`` and ``--with-tcltk-libs``. (Contributed by Ned Deily in :issue:`34956`.)
tr: Python'u macOS'ta kaynaktan derlerken, ``_tkinter``, macOS'un eski sürümlerinde olduğu gibi, ``/Library/Frameworks`` içine yüklenmişlerse artık sistem dışı Tcl ve Tk çerçeveleriyle bağlantı kuruyor. Bir macOS SDK, :option:`--enable-universalsdk` veya ``-isysroot`` kullanılarak açıkça yapılandırılmışsa, yalnızca SDK'nın kendisi aranır. Varsayılan davranış yine de ``--with-tcltk-includes`` ve ``--with-tcltk-libs`` ile geçersiz kılınabilir. ( :issue:`34956` içinde Ned Deily tarafından katılmıştır.)

source: Some individual tests are now skipped when ``--pgo`` is used. The tests in question increased the PGO task time significantly and likely didn't help improve optimization of the final executable. This speeds up the task by a factor of about 15x. Running the full unit test suite is slow. This change may result in a slightly less optimized build since not as many code branches will be executed. If you are willing to wait for the much slower build, the old behavior can be restored using ``./configure [..] PROFILE_TASK="-m test --pgo-extended"``. We make no guarantees as to which PGO task set produces a faster build. Users who care should run their own relevant benchmarks as results can depend on the environment, workload, and compiler tool chain. (See :issue:`36044` and :issue:`37707` for more details.)
tr: ``--pgo`` kullanıldığında bazı bireysel testler artık atlanıyor. Söz konusu testler, PGO görev süresini önemli ölçüde artırdı ve muhtemelen nihai yürütülebilir dosyanın optimizasyonunun iyileştirilmesine yardımcı olmadı. Bu, görevi yaklaşık 15 kat hızlandırır. Tam birim test paketini çalıştırmak yavaştır. Bu değişiklik, çok fazla kod dalı yürütülmeyeceğinden biraz daha az optimize edilmiş bir yapıya neden olabilir. Çok daha yavaş olan yapıyı beklemek istiyorsanız, ``./configure [..] PROFILE_TASK="-m test --pgo-extended"`` kullanılarak eski davranış geri yüklenebilir. Hangi PGO görev setinin daha hızlı bir yapı oluşturduğuna dair hiçbir garanti vermiyoruz. Sonuçlar ortama, iş yüküne ve derleyici araç zincirine bağlı olabileceğinden, önemseyen kullanıcılar kendi ilgili kıyaslamalarını çalıştırmalıdır. (Daha fazla ayrıntı için bkz. :issue:`36044` ve :issue:`37707`.)

source: C API Changes
tr: C API'sindeki değişiklikler
