Repository: python/python-docs-tr
Catalog: whatsnew/3.9.po
Languages: tr

source: Earlier Python versions allowed using both ``;`` and ``&`` as query parameter separators in :func:`urllib.parse.parse_qs` and :func:`urllib.parse.parse_qsl`. Due to security concerns, and to conform with newer W3C recommendations, this has been changed to allow only a single separator key, with ``&`` as the default. This change also affects :func:`cgi.parse` and :func:`cgi.parse_multipart` as they use the affected functions internally. For more details, please see their respective documentation. (Contributed by Adam Goldschmidt, Senthil Kumaran and Ken Jin in :issue:`42967`.)
tr: Önceki Python sürümleri, :func:`urllib.parse.parse_qs` ve :func:`urllib.parse.parse_qsl` içinde sorgu parametresi ayırıcıları olarak hem ``;`` hem de ``&`` kullanılmasına izin veriyordu. Güvenlik endişeleri nedeniyle ve daha yeni W3C tavsiyelerine uymak için bu, varsayılan olarak ``&`` ile yalnızca tek bir ayırıcı anahtara izin verecek şekilde değiştirildi. Bu değişiklik, etkilenen fonksiyonlar dahili olarak kullandıkları için :func:`cgi.parse` ve :func:`cgi.parse_multipart` 'ı da etkiler. Daha fazla ayrıntı için lütfen ilgili belgelere bakın. (Adam Goldschmidt, Senthil Kumaran ve Ken Jin'in katkılarıyla :issue:`42967`.)
