Repository: python/python-docs-tr
Catalog: whatsnew/3.9.po
Languages: tr

source: :pep:`573`: Added :c:func:`PyType_FromModuleAndSpec` to associate a module with a class; :c:func:`PyType_GetModule` and :c:func:`PyType_GetModuleState` to retrieve the module and its state; and :c:data:`PyCMethod` and :c:data:`METH_METHOD` to allow a method to access the class it was defined in. (Contributed by Marcel Plch and Petr Viktorin in :issue:`38787`.)
tr: :pep:`573`: Bir modülü bir sınıfla ilişkilendirmek için :c:func:`PyType_FromModuleAndSpec` eklendi; modülü ve durumunu almak için :c:func:`PyType_GetModule` ve :c:func:`PyType_GetModuleState`; ve bir yöntemin tanımlandığı sınıfa erişmesine izin vermek için :c:data:`PyCMethod` ve :c:data:`METH_METHOD`. ( :issue:`38787` içinde Marcel Plch ve Petr Viktorin tarafından katılmıştır.)

source: Added :c:func:`PyFrame_GetCode` function: get a frame code. Added :c:func:`PyFrame_GetBack` function: get the frame next outer frame. (Contributed by Victor Stinner in :issue:`40421`.)
tr: :c:func:`PyFrame_GetCode` işlevi eklendi: bir çerçeve kodu alın. :c:func:`PyFrame_GetBack` işlevi eklendi: sonraki dış çerçeveyi alın. (Victor Stinner tarafından :issue:`40421` 'de katılmıştır.)

source: Added :c:func:`PyFrame_GetLineNumber` to the limited C API. (Contributed by Victor Stinner in :issue:`40421`.)
tr: Sınırlı C API'sine :c:func:`PyFrame_GetLineNumber` eklendi. (Victor Stinner tarafından :issue:`40421` 'de katılmıştır.)

source: Added :c:func:`PyThreadState_GetInterpreter` and :c:func:`PyInterpreterState_Get` functions to get the interpreter. Added :c:func:`PyThreadState_GetFrame` function to get the current frame of a Python thread state. Added :c:func:`PyThreadState_GetID` function: get the unique identifier of a Python thread state. (Contributed by Victor Stinner in :issue:`39947`.)
tr: Yorumlayıcıyı almak için :c:func:`PyThreadState_GetInterpreter` ve :c:func:`PyInterpreterState_Get` işlevleri eklendi. Python iş parçacığı durumunun geçerli çerçevesini almak için :c:func:`PyThreadState_GetFrame` işlevi eklendi. :c:func:`PyThreadState_GetID` işlevi eklendi: Python iş parçacığı durumunun benzersiz tanımlayıcısını alın. (Victor Stinner tarafından :issue:`39947` 'de katılmıştır.)

source: Added a new public :c:func:`PyObject_CallNoArgs` function to the C API, which calls a callable Python object without any arguments. It is the most efficient way to call a callable Python object without any argument. (Contributed by Victor Stinner in :issue:`37194`.)
tr: C API'ye herhangi bir bağımsız değişken olmadan çağrılabilir bir Python nesnesi çağıran yeni bir genel :c:func:`PyObject_CallNoArgs` işlevi eklendi. Herhangi bir argüman olmadan çağrılabilir bir Python nesnesini çağırmanın en etkili yolu budur. (Victor Stinner tarafından :issue:`37194` 'de katılmıştır.)

source: Changes in the limited C API (if ``Py_LIMITED_API`` macro is defined):
tr: Sınırlı C API'sindeki değişiklikler (eğer ``Py_LIMITED_API`` makrosu tanımlanmışsa):

source: Provide :c:func:`Py_EnterRecursiveCall` and :c:func:`Py_LeaveRecursiveCall` as regular functions for the limited API. Previously, there were defined as macros, but these macros didn't compile with the limited C API which cannot access ``PyThreadState.recursion_depth`` field (the structure is opaque in the limited C API).
tr: Sınırlı API için normal işlevler olarak :c:func:`Py_EnterRecursiveCall` ve :c:func:`Py_LeaveRecursiveCall` sağlayın. Önceden, makrolar olarak tanımlanmıştı, ancak bu makrolar, ``PyThreadState.recursion_Definition`` alanına erişemeyen sınırlı C API'si ile derlenmiyordu (sınırlı C API'sinde yapı opaktır).

source: ``PyObject_INIT()`` and ``PyObject_INIT_VAR()`` become regular "opaque" function to hide implementation details.
tr: ``PyObject_INIT()`` ve ``PyObject_INIT_VAR()``, uygulama ayrıntılarını gizlemek için normal "opak" fonksiyon haline gelir.

source: (Contributed by Victor Stinner in :issue:`38644` and :issue:`39542`.)
tr: (Victor Stinner tarafından :issue:`38644` ve :issue:`39542` 'de katılmıştır.)

source: The :c:func:`PyModule_AddType` function is added to help adding a type to a module. (Contributed by Dong-hee Na in :issue:`40024`.)
tr: Bir modüle tür eklenmesine yardımcı olmak için :c:func:`PyModule_AddType` fonkisoynu eklenir. (Dong-hee Na tarafından :issue:`40024` 'de katılmıştır.)

source: Added the functions :c:func:`PyObject_GC_IsTracked` and :c:func:`PyObject_GC_IsFinalized` to the public API to allow to query if Python objects are being currently tracked or have been already finalized by the garbage collector respectively. (Contributed by Pablo Galindo Salgado in :issue:`40241`.)
tr: Genel API'ye :c:func:`PyObject_GC_IsTracked` ve :c:func:`PyObject_GC_IsFinalized` işlevleri, Python nesnelerinin şu anda izlenip izlenmediğini veya çöp toplayıcı tarafından halihazırda sonlandırılıp sonlandırılmadığını sorgulamaya izin vermek için eklendi. (Pablo Galindo Salgado tarafından :issue:`40241` 'de katılmıştır.)

source: Added :c:func:`_PyObject_FunctionStr` to get a user-friendly string representation of a function-like object. (Patch by Jeroen Demeyer in :issue:`37645`.)
tr: İşlev benzeri bir nesnenin kullanıcı dostu bir dize temsilini elde etmek için :c:func:`_PyObject_FunctionStr` eklendi. (Yama, Jeroen Demeyer tarafından :issue:`37645` içinde.)

source: Added :c:func:`PyObject_CallOneArg` for calling an object with one positional argument (Patch by Jeroen Demeyer in :issue:`37483`.)
tr: Tek bir konum bağımsız değişkeni olan bir nesneyi çağırmak için :c:func:`PyObject_CallOneArg` eklendi (Yama Jeroen Demeyer tarafından :issue:`37483` içinde.)

source: ``PyInterpreterState.eval_frame`` (:pep:`523`) now requires a new mandatory *tstate* parameter (``PyThreadState*``). (Contributed by Victor Stinner in :issue:`38500`.)
tr: ``PyInterpreterState.eval_frame`` (:pep:`523`) artık yeni bir zorunlu *tstate* parametresi (``PyThreadState*``) gerektiriyor. (Victor Stinner tarafından :issue:`38500` 'de katılmıştır.)

source: Extension modules: :c:member:`~PyModuleDef.m_traverse`, :c:member:`~PyModuleDef.m_clear` and :c:member:`~PyModuleDef.m_free` functions of :c:type:`PyModuleDef` are no longer called if the module state was requested but is not allocated yet. This is the case immediately after the module is created and before the module is executed (:c:data:`Py_mod_exec` function). More precisely, these functions are not called if :c:member:`~PyModuleDef.m_size` is greater than 0 and the module state (as returned by :c:func:`PyModule_GetState`) is ``NULL``.
tr: Genişletme modülleri: :c:member:`~PyModuleDef.m_traverse`, :c:member:`~PyModuleDef.m_clear` and :c:member:`~PyModuleDef.m_free` functions of :c:type:`PyModuleDef`, modül durumu talep edilmiş ancak henüz tahsisedilmemişse artık çağrılmaz. Bu, modül oluşturulduktan hemen sonra vemodül çalıştırılmadan önceki durumdur (:c:data:`Py_mod_exec` işlevi).Daha kesin olarak, bu işlevler :c:member:`~PyModuleDef.m_size` 0'dan büyükse ve modül durumu ( :c:func:`PyModule_GetState` tarafından döndürülen) ``NULL`` ise çağrılmaz.

source: Extension modules without module state (``m_size <= 0``) are not affected.
tr: Modül durumuna sahip olmayan genişletme modülleri (``m_size <= 0``) etkilenmez.

source: If :c:func:`Py_AddPendingCall` is called in a subinterpreter, the function is now scheduled to be called from the subinterpreter, rather than being called from the main interpreter. Each subinterpreter now has its own list of scheduled calls. (Contributed by Victor Stinner in :issue:`39984`.)
tr: Bir alt yorumlayıcıda :c:func:`Py_AddPendingCall` çağrılırsa, işlev artık ana yorumlayıcıdan çağrılmak yerine alt yorumlayıcıdan çağrılacak şekilde programlanır. Her yardımcı tercüman artık kendi planlanmış çağrılar listesine sahiptir. (Victor Stinner tarafından :issue:`39984`'de katılmıştır.)

source: The Windows registry is no longer used to initialize :data:`sys.path` when the ``-E`` option is used (if :c:member:`PyConfig.use_environment` is set to ``0``). This is significant when embedding Python on Windows. (Contributed by Zackery Spytz in :issue:`8901`.)
tr: Windows kayıt defteri ``-E`` seçeneği kullanıldığında ( :c:member:`PyConfig.use_environment` ``0`` olarak ayarlanmışsa) :data:`sys.path` öğesini başlatmak için artık kullanılmaz. Bu, Python'u Windows'a yerleştirirken önemlidir. ( :issue:`8901` içinde Zackery Spytz tarafından katılmıştır.)

source: The global variable :c:data:`PyStructSequence_UnnamedField` is now a constant and refers to a constant string. (Contributed by Serhiy Storchaka in :issue:`38650`.)
tr: :c:data:`PyStructSequence_UnnamedField` genel değişkeni artık bir sabittir ve sabit bir dizeye başvurur. ( :issue:`38650` içinde Serhiy Storchaka tarafından katılmıştır.)

source: The :c:type:`PyGC_Head` structure is now opaque. It is only defined in the internal C API (``pycore_gc.h``). (Contributed by Victor Stinner in :issue:`40241`.)
tr: :c:type:`PyGC_Head` yapısı artık opaktır. Yalnızca dahili C API'sinde (``pycore_gc.h``) tanımlanır. (Victor Stinner tarafından :issue:`40241` 'de katılmıştır.)

source: The ``Py_UNICODE_COPY``, ``Py_UNICODE_FILL``, ``PyUnicode_WSTR_LENGTH``, :c:func:`PyUnicode_FromUnicode`, :c:func:`PyUnicode_AsUnicode`, ``_PyUnicode_AsUnicode``, and :c:func:`PyUnicode_AsUnicodeAndSize` are marked as deprecated in C. They have been deprecated by :pep:`393` since Python 3.3. (Contributed by Inada Naoki in :issue:`36346`.)
tr: ``Py_UNICODE_COPY``, ``Py_UNICODE_FILL``, ``PyUnicode_WSTR_LENGTH``, :c:func:`PyUnicode_FromUnicode`, :c:func:`PyUnicode_AsUnicode`, ``_PyUnicode_AsUnicode``, ve :c:func:`PyUnicode_AsUnicodeAndSize`, C'de kullanımdan kaldırıldı olarak işaretlenmiştir. Python 3.3'ten beri :pep:`393` tarafından kullanımdan kaldırılmıştır. (Inada Naoki tarafından :issue:`36346` 'da katılmıştır.)

source: The :c:func:`Py_FatalError` function is replaced with a macro which logs automatically the name of the current function, unless the ``Py_LIMITED_API`` macro is defined. (Contributed by Victor Stinner in :issue:`39882`.)
tr: :c:func:`Py_FatalError` fonksiyonu, ``Py_LIMITED_API`` makrosu tanımlanmadığı sürece geçerli fonksiyonun adını otomatik olarak kaydeden bir makro ile değiştirilir. (Victor Stinner tarafından :issue:`39882` 'de katılmıştır.)

source: The vectorcall protocol now requires that the caller passes only strings as keyword names. (See :issue:`37540` for more information.)
tr: Vectorcall protokolü artık arayan kişinin anahtar kelime adları olarak yalnızca dizeleri iletmesini gerektirir. (Daha fazla bilgi için bkz. :issue:`37540`.)

source: Implementation details of a number of macros and functions are now hidden:
tr: Bir dizi makro ve fonksiyonların uygulama ayrıntıları artık gizlenmiştir:

source: :c:func:`PyObject_IS_GC` macro was converted to a function.
tr: :c:func:`PyObject_IS_GC` makrosu bir fonksiyona dönüştürüldü.

source: The :c:func:`PyObject_NEW` macro becomes an alias to the :c:func:`PyObject_New` macro, and the :c:func:`PyObject_NEW_VAR` macro becomes an alias to the :c:func:`PyObject_NewVar` macro. They no longer access directly the :c:member:`PyTypeObject.tp_basicsize` member.
tr: :c:func:`PyObject_NEW` makrosu :c:func:`PyObject_New` makrosunun takma adı olur ve :c:func:`PyObject_NEW_VAR` makrosu :c:func:`PyObject_NewVar` makrosunun takma adı olur . Artık :c:member:`PyTypeObject.tp_basicsize` üyesine doğrudan erişemezler.

source: :c:func:`PyObject_GET_WEAKREFS_LISTPTR` macro was converted to a function: the macro accessed directly the :c:member:`PyTypeObject.tp_weaklistoffset` member.
tr: :c:func:`PyObject_GET_WEAKREFS_LISTPTR` makrosu bir işleve dönüştürüldü: makro doğrudan :c:member:`PyTypeObject.tp_weaklistoffset` üyesine erişti.

source: :c:func:`PyObject_CheckBuffer` macro was converted to a function: the macro accessed directly the :c:member:`PyTypeObject.tp_as_buffer` member.
tr: :c:func:`PyObject_CheckBuffer` makrosu bir fonksiyona dönüştürüldü: makro :c:member:`PyTypeObject.tp_as_buffer` üyesine doğrudan erişti.

source: :c:func:`PyIndex_Check` is now always declared as an opaque function to hide implementation details: removed the ``PyIndex_Check()`` macro. The macro accessed directly the :c:member:`PyTypeObject.tp_as_number` member.
tr: :c:func:`PyIndex_Check` artık uygulama ayrıntılarını gizlemek için her zaman opak bir fonksiyon olarak bildiriliyor: ``PyIndex_Check()`` makrosu kaldırıldı. Makro, :c:member:`PyTypeObject.tp_as_number` üyesine doğrudan erişti.

source: (See :issue:`40170` for more details.)
tr: (Daha fazla ayrıntı için bkz. :issue:`40170`.)

source: Excluded ``PyFPE_START_PROTECT()`` and ``PyFPE_END_PROTECT()`` macros of ``pyfpe.h`` from the limited C API. (Contributed by Victor Stinner in :issue:`38835`.)
tr: ``pyfpe.h`` dosyasının ``PyFPE_START_PROTECT()`` ve ``PyFPE_END_PROTECT()`` makroları sınırlı C API'sinden hariç tutuldu. (Victor Stinner tarafından :issue:`38835` 'de katılmıştır.)

source: The ``tp_print`` slot of :ref:`PyTypeObject <type-structs>` has been removed. It was used for printing objects to files in Python 2.7 and before. Since Python 3.0, it has been ignored and unused. (Contributed by Jeroen Demeyer in :issue:`36974`.)
tr: :ref:`PyTypeObject <type-structs>` öğesinin ``tp_print`` yuvası kaldırıldı. Python 2.7 ve öncesindeki dosyalara nesneleri yazdırmak için kullanılıyordu. Python 3.0'dan beri göz ardı edildi ve kullanılmadı. ( :issue:`36974` içinde Jeroen Demeyer tarafından katılmıştır.)

source: Excluded the following functions from the limited C API:
tr: Aşağıdaki fonksiyonlar sınırlı C API'sinden çıkarıldı:

source: ``PyThreadState_DeleteCurrent()`` (Contributed by Joannah Nanjekye in :issue:`37878`.)
tr: ``PyThreadState_DeleteCurrent()`` (Joannah Nanjekye tarafından :issue:`37878` 'de katılmıştır.)

source: The trashcan mechanism which never worked in the limited C API.
tr: Sınırlı C API'sinde hiçbir zaman çalışmayan çöp tenekesi mekanizması.

source: Moved following functions and definitions to the internal C API:
tr: Aşağıdaki fonksiyonlar ve tanımlar dahili C API'sine taşındı:

source: ``_Py_AddToAllObjects()`` (specific to ``Py_TRACE_REFS`` build)
tr: ``_Py_AddToAllObjects()`` (``Py_TRACE_REFS`` yapısına özel)

source: Removed ``_PyRuntime.getframe`` hook and removed ``_PyThreadState_GetFrame`` macro which was an alias to ``_PyRuntime.getframe``. They were only exposed by the internal C API. Removed also ``PyThreadFrameGetter`` type. (Contributed by Victor Stinner in :issue:`39946`.)
tr: ``_PyRuntime.getframe`` kancası kaldırıldı ve ``_PyRuntime.getframe`` için takma ad olan ``_PyThreadState_GetFrame`` makrosu kaldırıldı. Yalnızca dahili C API'si tarafından açığa çıkarıldılar. Ayrıca ``PyThreadFrameGetter`` türü kaldırıldı. (Victor Stinner tarafından :issue:`39946` 'da katılmıştır.)

source: Removed the following functions from the C API. Call :c:func:`PyGC_Collect` explicitly to clear all free lists. (Contributed by Inada Naoki and Victor Stinner in :issue:`37340`, :issue:`38896` and :issue:`40428`.)
tr: Aşağıdaki fonksiyonlar C API'sinden kaldırıldı. Tüm ücretsiz listeleri temizlemek için :c:func:`PyGC_Collect` çağırın. (Inada Naoki ve Victor Stinner tarafından :issue:`37340` , :issue:`38896` ve :issue:`40428` 'de katkıda bulunmuştur.)

source: ``PyMethod_ClearFreeList()`` and ``PyCFunction_ClearFreeList()``: the free lists of bound method objects have been removed.
tr: ``PyMethod_ClearFreeList()`` ve ``PyCFunction_ClearFreeList()``: bağlı yöntem nesnelerinin serbest listeleri kaldırıldı.

source: ``PySet_ClearFreeList()``: the set free list has been removed in Python 3.4.
tr: ``PySet_ClearFreeList()``: Python 3.4'te setsiz liste kaldırıldı.

source: ``PyUnicode_ClearFreeList()``: the Unicode free list has been removed in Python 3.3.
tr: ``PyUnicode_ClearFreeList()``: Unicode ücretsiz listesi Python 3.3'te kaldırılmıştır.

source: Removed ``_PyUnicode_ClearStaticStrings()`` function. (Contributed by Victor Stinner in :issue:`39465`.)
tr: ``_PyUnicode_ClearStaticStrings()`` fonksiyonu kaldırıldı. (Victor Stinner tarafından :issue:`39465` 'de katılmıştır.)

source: Removed ``Py_UNICODE_MATCH``. It has been deprecated by :pep:`393`, and broken since Python 3.3. The :c:func:`PyUnicode_Tailmatch` function can be used instead. (Contributed by Inada Naoki in :issue:`36346`.)
tr: ``Py_UNICODE_MATCH`` kaldırıldı. :pep:`393` tarafından kullanımdan kaldırıldı ve Python 3.3'ten beri bozuldu. Bunun yerine :c:func:`PyUnicode_Tailmatch` fonksiyonu kullanılabilir. (Inada Naoki tarafından :issue:`36346` 'da katılmıştır.)

source: Cleaned header files of interfaces defined but with no implementation. The public API symbols being removed are: ``_PyBytes_InsertThousandsGroupingLocale``, ``_PyBytes_InsertThousandsGrouping``, ``_Py_InitializeFromArgs``, ``_Py_InitializeFromWideArgs``, ``_PyFloat_Repr``, ``_PyFloat_Digits``, ``_PyFloat_DigitsInit``, ``PyFrame_ExtendStack``, ``_PyAIterWrapper_Type``, ``PyNullImporter_Type``, ``PyCmpWrapper_Type``, ``PySortWrapper_Type``, ``PyNoArgsFunction``. (Contributed by Pablo Galindo Salgado in :issue:`39372`.)
tr: Tanımlanan ancak uygulama içermeyen arabirimlerin başlık dosyaları temizlendi. Kaldırılmakta olan genel API sembolleri şunlardır: : ``_PyBytes_InsertThousandsGroupingLocale``, ``_PyBytes_InsertThousandsGrouping``, ``_Py_InitializeFromArgs``, ``_Py_InitializeFromWideArgs``, ``_PyFloat_Repr``, ``_PyFloat_Digits``, ``_PyFloat_DigitsInit``, ``PyFrame_ExtendStack``, ``_PyAIterWrapper_Type``, ``PyNullImporter_Type``, ``PyCmpWrapper_Type``, ``PySortWrapper_Type``, ``PyNoArgsFunction``. ( :issue:`39372` içinde Pablo Galindo Salgado tarafından sağlanmıştır.)

source: Notable changes in Python 3.9.1
tr: Python 3.9.1'deki önemli değişiklikler

source: The behavior of :class:`typing.Literal` was changed to conform with :pep:`586` and to match the behavior of static type checkers specified in the PEP.
tr: :class:`typing.Literal` davranışı, :pep:`586` ile uyumlu olacak ve PEP'de belirtilen statik tip denetleyicilerin davranışıyla eşleşecek şekilde değiştirildi.

source: ``Literal`` now de-duplicates parameters.
tr: ``Literal`` artık parametrelerin yinelemelerini kaldırıyor.

source: Equality comparisons between ``Literal`` objects are now order independent.
tr: ``Literal`` nesneleri arasındaki eşitlik karşılaştırmaları artık sıradan bağımsızdır.

source: ``Literal`` comparisons now respect types. For example, ``Literal[0] == Literal[False]`` previously evaluated to ``True``. It is now ``False``. To support this change, the internally used type cache now supports differentiating types.
tr: ``Literal`` karşılaştırmaları artık türlere göre yapılıyor. Örneğin, ``Literal[0] == Literal[False]`` daha önce ``True`` olarak değerlendirildi. Artık ``False``. Bu değişikliği desteklemek için dahili olarak kullanılan tür önbelleği artık farklılaşan türleri desteklemektedir.

source: ``Literal`` objects will now raise a :exc:`TypeError` exception during equality comparisons if any of their parameters are not :term:`hashable`. Note that declaring ``Literal`` with mutable parameters will not throw an error::
tr: ``Literal`` nesneler, parametrelerinden herhangi biri :term:`hashable` değilse eşitlik karşılaştırmaları sırasında artık bir :exc:`TypeError` istisnası oluşturacak. Değişken parametrelerle ``Literal`` tanımlamanın bir hata atmayacağına dikkat edin::

source: (Contributed by Yurii Karabas in :issue:`42345`.)
tr: ( :issue:`42345` sayısında Yurii Karabas tarafından katılmıştır.)

source: macOS 11.0 (Big Sur) and Apple Silicon Mac support
tr: macOS 11.0 (Big Sur) ve Apple Silicon Mac desteği

source: As of 3.9.1, Python now fully supports building and running on macOS 11.0 (Big Sur) and on Apple Silicon Macs (based on the ``ARM64`` architecture). A new universal build variant, ``universal2``, is now available to natively support both ``ARM64`` and ``Intel 64`` in one set of executables. Binaries can also now be built on current versions of macOS to be deployed on a range of older macOS versions (tested to 10.9) while making some newer OS functions and options conditionally available based on the operating system version in use at runtime ("weaklinking").
tr: 3.9.1'den itibaren Python artık macOS 11.0 (Big Sur) ve Apple Silicon Mac'lerde (``ARM64`` yapısına dayalı) oluşturmayı ve çalıştırmayı tam olarak desteklemektedir. Yeni bir evrensel yapı varyantı olan ``universal2``, artık hem ``ARM64`` hem de ``Intel 64`` 'ü tek bir yürütülebilir dosya setinde yerel olarak desteklemek için kullanılabilir. İkili dosyalar, artık bir dizi eski macOS sürümüne (10.9'a göre test edilmiştir) dağıtılmak üzere macOS'in mevcut sürümleri üzerine inşa edilebilirken, çalışma zamanında kullanılan işletim sistemi sürümüne bağlı olarak bazı yeni işletim sistemi fonksiyonları ve seçenekleri koşullu olarak kullanılabilir hale getirilir ("weaklinking" ).

source: (Contributed by Ronald Oussoren and Lawrence D'Anna in :issue:`41100`.)
tr: ( :issue:`41100` içinde Ronald Oussoren ve Lawrence D'Anna tarafından katılmıştır.)

source: Notable changes in Python 3.9.2
tr: Python 3.9.2'deki önemli değişiklikler

source: :class:`collections.abc.Callable` generic now flattens type parameters, similar to what :data:`typing.Callable` currently does. This means that ``collections.abc.Callable[[int, str], str]`` will have ``__args__`` of ``(int, str, str)``; previously this was ``([int, str], str)``. To allow this change, :class:`types.GenericAlias` can now be subclassed, and a subclass will be returned when subscripting the :class:`collections.abc.Callable` type. Code which accesses the arguments via :func:`typing.get_args` or ``__args__`` need to account for this change. A :exc:`DeprecationWarning` may be emitted for invalid forms of parameterizing :class:`collections.abc.Callable` which may have passed silently in Python 3.9.1. This :exc:`DeprecationWarning` will become a :exc:`TypeError` in Python 3.10. (Contributed by Ken Jin in :issue:`42195`.)
tr: :class:`collections.abc.Callable` jenerik artık tip parametrelerini düzleştiriyor, şu anda :data:`typing.Callable` 'ın yaptığına benzer. Bu, ``collections.abc.Callable[[int, str], str]`` öğesinin ``__args__`` veya ``(int, str, str)``; olacağı anlamına gelir önceden bu ``([int, str], str)`` idi. Bu değişikliğe izin vermek için, :class:`types.GenericAlias` artık alt sınıflara ayrılabilir ve :class:`collections.abc.Callable` tipi abone olurken bir alt sınıf döndürülür. Bağımsız değişkenlere :func:`typing.get_args` veya ``__args__`` aracılığıyla erişen kodun bu değişikliği hesaba katması gerekir. Python 3.9.1'de sessizce geçmiş olabilecek :class:`collections.abc.Callable` parametreleştirmenin geçersiz biçimleri için bir :exc:`DeprecationWarning` yayınlanabilir. Python 3.10'da bu :exc:`DeprecationWarning` bir :exc:`TypeError` olacaktır. ( :issue:`42195` içinde Ken Jin tarafından katılmıştır.)
