Repository: python/python-docs-tr
Catalog: whatsnew/3.9.po
Languages: tr

source: Added a new :attr:`sys.platlibdir` attribute: name of the platform-specific library directory. It is used to build the path of standard library and the paths of installed extension modules. It is equal to ``"lib"`` on most platforms. On Fedora and SuSE, it is equal to ``"lib64"`` on 64-bit platforms. (Contributed by Jan Matějek, Matěj Cepl, Charalampos Stratakis and Victor Stinner in :issue:`1294959`.)
tr: Yeni bir :attr:`sys.platlibdir` niteliği eklendi: platforma özel kitaplık dizininin adı. Standart kitaplığın yolunu ve kurulu uzantı modüllerinin yollarını oluşturmak için kullanılır. Çoğu platformda ``"lib"`` değerine eşittir. Fedora ve SuSE'de, 64 bit platformlarda ``"lib64"`` 'e eşittir. (Jan Matějek, Matěj Cepl, Charalampos Stratakis ve Victor Stinner'ın katkılarıyla :issue:`1294959`.)

source: Previously, :attr:`sys.stderr` was block-buffered when non-interactive. Now ``stderr`` defaults to always being line-buffered. (Contributed by Jendrik Seipp in :issue:`13601`.)
tr: Önceden, :attr:`sys.stderr`, etkileşimli olmadığında blok arabelleğe alınıyordu. Artık ``stderr`` varsayılan olarak her zaman satır arabelleğe alınır. ( :issue:`13601` 'de Jendrik Seipp tarafından katılmıştır.)

source: Added :func:`tracemalloc.reset_peak` to set the peak size of traced memory blocks to the current size, to measure the peak of specific pieces of code. (Contributed by Huon Wilson in :issue:`40630`.)
tr: İzlenen bellek bloklarının tepe boyutunu geçerli boyuta ayarlamak ve belirli kod parçalarının zirvesini ölçmek için :func:`tracemalloc.reset_peak` eklendi. (Huon Wilson tarafından :issue:`40630` 'da katılmıştır.)

source: :pep:`593` introduced an :data:`typing.Annotated` type to decorate existing types with context-specific metadata and new ``include_extras`` parameter to :func:`typing.get_type_hints` to access the metadata at runtime. (Contributed by Till Varoquaux and Konstantin Kashin.)
tr: :pep:`593`, mevcut türleri bağlama özel meta verilerle süslemek için bir :data:`typing.Annotated` tipi ve çalışma zamanında meta verilere erişmek için :func:`typing.get_type_hints` için yeni ``include_extras`` parametresini tanıttı. (Till Varoquaux ve Konstantin Kashin'in katkılarıyla.)

source: The Unicode database has been updated to version 13.0.0. (:issue:`39926`).
tr: Unicode veritabanı 13.0.0 sürümüne güncellendi. (:issue:`39926`).

source: The activation scripts provided by :mod:`venv` now all specify their prompt customization consistently by always using the value specified by ``__VENV_PROMPT__``. Previously some scripts unconditionally used ``__VENV_PROMPT__``, others only if it happened to be set (which was the default case), and one used ``__VENV_NAME__`` instead. (Contributed by Brett Cannon in :issue:`37663`.)
tr: :mod:`venv` tarafından sağlanan aktivasyon betiklerinin tümü artık istem özelleştirmelerini her zaman ``__VENV_PROMPT__`` tarafından belirtilen değeri kullanarak tutarlı bir şekilde belirtiyor. Önceden bazı komut dosyaları koşulsuz olarak ``__VENV_PROMPT__`` kullandı, diğerleri yalnızca ayarlandıysa (varsayılan durum buydu) ve biri bunun yerine ``__VENV_NAME__`` kullanıyordu. ( :issue:`37663` içinde Brett Cannon tarafından katılmıştır.)

source: White space characters within attributes are now preserved when serializing :mod:`xml.etree.ElementTree` to XML file. EOLNs are no longer normalized to "\n". This is the result of discussion about how to interpret section 2.11 of XML spec. (Contributed by Mefistotelis in :issue:`39011`.)
tr: Nitelikler içindeki boşluk karakterleri artık :mod:`xml.etree.ElementTree` XML dosyasına serileştirilirken korunur. EOLN'ler artık "\n" olarak normalleştirilmez. Bu, XML spesifikasyonunun 2.11 bölümünün nasıl yorumlanacağına ilişkin tartışmanın sonucudur. ( :issue:`39011` içinde Mefistotelis tarafından katılmıştır.)

source: Optimizations
tr: Optimizasyonlar

source: Optimized the idiom for assignment a temporary variable in comprehensions. Now ``for y in [expr]`` in comprehensions is as fast as a simple assignment ``y = expr``. For example:
tr: Kavramalarda geçici bir değişken atamak için deyim optimize edildi. Şimdi ``for y in [expr]``, basit bir ``y = expr`` ataması kadar hızlıdır. Örneğin:

source: Unlike the ``:=`` operator this idiom does not leak a variable to the outer scope.
tr: ``:=`` operatörünün aksine bu deyim, dış kapsama bir değişken sızdırmaz.

source: (Contributed by Serhiy Storchaka in :issue:`32856`.)
tr: ( :issue:`32856` içinde Serhiy Storchaka tarafından katılmıştır.)

source: Optimized signal handling in multithreaded applications. If a thread different than the main thread gets a signal, the bytecode evaluation loop is no longer interrupted at each bytecode instruction to check for pending signals which cannot be handled. Only the main thread of the main interpreter can handle signals.
tr: Çok iş parçacıklı uygulamalarda optimize edilmiş sinyal işleme. Ana iş parçacığından farklı bir iş parçacığı bir sinyal alırsa, işlenemeyen bekleyen sinyalleri kontrol etmek için bayt kodu değerlendirme döngüsü artık her bayt kodu talimatında kesintiye uğramaz. Yalnızca ana yorumlayıcının ana iş parçacığı sinyalleri işleyebilir.

source: Previously, the bytecode evaluation loop was interrupted at each instruction until the main thread handles signals. (Contributed by Victor Stinner in :issue:`40010`.)
tr: Önceden, bayt kodu değerlendirme döngüsü, ana iş parçacığı sinyalleri işleyene kadar her komutta kesintiye uğruyordu. (Victor Stinner tarafından :issue:`40010` 'da katılmıştır.)

source: Optimized the :mod:`subprocess` module on FreeBSD using ``closefrom()``. (Contributed by Ed Maste, Conrad Meyer, Kyle Evans, Kubilay Kocak and Victor Stinner in :issue:`38061`.)
tr: :mod:`subprocess` modülünü FreeBSD'de ``closefrom()`` kullanarak optimize etti. ( :issue:`38061` 'de Ed Maste, Conrad Meyer, Kyle Evans, Kubilay Koçak ve Victor Stinner'ın katkılarıyla.)

source: :c:func:`PyLong_FromDouble` is now up to 1.87x faster for values that fit into :c:expr:`long`. (Contributed by Sergey Fedoseev in :issue:`37986`.)
tr: :c:func:`PyLong_FromDouble`, :c:expr:`long` değerine uyan değerler için artık 1,87 kata kadar daha hızlı. (Sergey Fedoseev tarafından :issue:`37986` 'da katılmıştır.)

source: A number of Python builtins (:class:`range`, :class:`tuple`, :class:`set`, :class:`frozenset`, :class:`list`, :class:`dict`) are now sped up by using :pep:`590` vectorcall protocol. (Contributed by Dong-hee Na, Mark Shannon, Jeroen Demeyer and Petr Viktorin in :issue:`37207`.)
tr: Bir dizi Python yerleşik yapısı (:class:`range`, :class:`tuple`, :class:`set`, :class:`frozenset`, :class:`list`, :class:`dict`) artık :pep:`590` vectorcall protokolü kullanılarak hızlandırıldı. (Dong-hee Na, Mark Shannon, Jeroen Demeyer ve Petr Viktorin'in :issue:`37207` 'deki katkılarıyla.)

source: Optimized :func:`~set.difference_update` for the case when the other set is much larger than the base set. (Suggested by Evgeny Kapun with code contributed by Michele Orrù in :issue:`8425`.)
tr: Diğer kümenin temel kümeden çok daha büyük olduğu durumlar için :func:`~set.difference_update` optimize edildi. ( :issue:`8425` içinde Michele Orrù tarafından sağlanan kodla Evgeny Kapun tarafından önerilmiştir.)

source: Python's small object allocator (``obmalloc.c``) now allows (no more than) one empty arena to remain available for immediate reuse, without returning it to the OS. This prevents thrashing in simple loops where an arena could be created and destroyed anew on each iteration. (Contributed by Tim Peters in :issue:`37257`.)
tr: Python'un küçük nesne ayırıcısı (``obmalloc.c``) artık (1'den fazla değil) bir boş arenanın işletim sistemine döndürmeden anında yeniden kullanım için kullanılabilir kalmasına izin veriyor. Bu, her yinelemede bir arenanın yeniden yaratılıp yok edilebileceği basit döngülerde çarpışmayı önler. ( :issue:`37257` içinde Tim Peters tarafından katılmıştır.)

source: :term:`floor division` of float operation now has a better performance. Also the message of :exc:`ZeroDivisionError` for this operation is updated. (Contributed by Dong-hee Na in :issue:`39434`.)
tr: Bir float'ı :term:`kalansız bölme <floor division>` işlemi artık daha iyi bir performansa sahip. Ayrıca bu işlem için :exc:`ZeroDivisionError` mesajı güncellenir. (Dong-hee Na tarafından :issue:`39434` 'de katılmıştır.)

source: Decoding short ASCII strings with UTF-8 and ascii codecs is now about 15% faster. (Contributed by Inada Naoki in :issue:`37348`.)
tr: UTF-8 ve ascii codec'leriyle kısa ASCII dizilerinin kodunu çözmek artık yaklaşık %15 daha hızlı. (Inada Naoki tarafından :issue:`37348` 'de katılmıştır.)

source: Here's a summary of performance improvements from Python 3.4 through Python 3.9:
tr: İşte Python 3.4'ten Python 3.9'a kadar olan performans iyileştirmelerinin bir özeti:

source: These results were generated from the variable access benchmark script at: ``Tools/scripts/var_access_benchmark.py``. The benchmark script displays timings in nanoseconds. The benchmarks were measured on an `Intel® Core™ i7-4960HQ processor <https://ark.intel.com/content/www/us/en/ark/products/76088/intel-core-i7-4960hq-processor-6m-cache-up-to-3-80-ghz.html>`_ running the macOS 64-bit builds found at `python.org <https://www.python.org/downloads/mac-osx/>`_.
tr: Bu sonuçlar, ``Tools/scripts/var_access_benchmark.py`` adresindeki değişken erişim kıyaslama betiğinden oluşturulmuştur. Kıyaslama komut dosyası, nanosaniye cinsinden zamanlamaları görüntüler. Kıyaslamalar, `python.org <https://www.python.org/downloads/mac-osx/>`_ adresinde bulunan macOS 64-bit yapılarını çalıştıran bir `Intel® Core™ i7-4960HQ processor <https://ark.intel.com/content/www/us/en/ark/products/76088/intel-core-i7-4960hq-processor-6m-cache-up-to-3-80-ghz.html>`_ üzerinde ölçülmüştür.

source: The distutils ``bdist_msi`` command is now deprecated, use ``bdist_wheel`` (wheel packages) instead. (Contributed by Hugo van Kemenade in :issue:`39586`.)
tr: Distutils ``bdist_msi`` komutu artık kullanımdan kaldırılmıştır, bunun yerine ``bdist_wheel`` (tekerlek paketleri) kullanın. ( :issue:`39586` içinde Hugo van Kemenade tarafından katılmıştır.)

source: Currently :func:`math.factorial` accepts :class:`float` instances with non-negative integer values (like ``5.0``). It raises a :exc:`ValueError` for non-integral and negative floats. It is now deprecated. In future Python versions it will raise a :exc:`TypeError` for all floats. (Contributed by Serhiy Storchaka in :issue:`37315`.)
tr: Şu anda :func:`math.factorial`, negatif olmayan tamsayı değerleri olan (``5.0`` gibi) :class:`float` örneklerini kabul eder. İntegral olmayan ve negatif dalgalanmalar için bir :exc:`ValueError` oluşturur. Artık kullanımdan kaldırıldı. Gelecekteki Python sürümlerinde, tüm değişkenler için bir :exc:`TypeError` oluşturacaktır. ( :issue:`37315` içinde Serhiy Storchaka tarafından katılmıştır.)

source: The :mod:`parser` and :mod:`symbol` modules are deprecated and will be removed in future versions of Python. For the majority of use cases, users can leverage the Abstract Syntax Tree (AST) generation and compilation stage, using the :mod:`ast` module.
tr: :mod:`parser` ve :mod:`symbol` modülleri kullanımdan kaldırılmıştır ve Python'un gelecekteki sürümlerinde kaldırılacaktır. Kullanım durumlarının çoğu için, kullanıcılar :mod:`ast` modülünü kullanarak Soyut Sözdizimi Ağacı (AST) oluşturma ve derleme aşamasından yararlanabilir.

source: The Public C API functions :c:func:`PyParser_SimpleParseStringFlags`, :c:func:`PyParser_SimpleParseStringFlagsFilename`, :c:func:`PyParser_SimpleParseFileFlags` and :c:func:`PyNode_Compile` are deprecated and will be removed in Python 3.10 together with the old parser.
tr: Genel C API işlevleri :c:func:`PyParser_SimpleParseStringFlags`, :c:func:`PyParser_SimpleParseStringFlagsFilename`, :c:func:`PyParser_SimpleParseFileFlags` ve :c:func:`PyNode_Compile` eskimiştir ve Python 3.10'da eski ayrıştırıcı ile birlikte kaldırılacaktır.

source: Using :data:`NotImplemented` in a boolean context has been deprecated, as it is almost exclusively the result of incorrect rich comparator implementations. It will be made a :exc:`TypeError` in a future version of Python. (Contributed by Josh Rosenberg in :issue:`35712`.)
tr: Bir boole bağlamında :data:`NotImplemented` kullanmak, neredeyse tamamen yanlış zengin karşılaştırıcı uygulamalarının bir sonucu olduğu için kullanımdan kaldırılmıştır. Python'un gelecekteki bir sürümünde :exc:`TypeError` haline getirilecektir. ( :issue:`35712` içinde Josh Rosenberg tarafından katılmıştır.)

source: The :mod:`random` module currently accepts any hashable type as a possible seed value. Unfortunately, some of those types are not guaranteed to have a deterministic hash value. After Python 3.9, the module will restrict its seeds to :const:`None`, :class:`int`, :class:`float`, :class:`str`, :class:`bytes`, and :class:`bytearray`.
tr: :mod:`random` modülü şu anda herhangi bir hashable türünü olası bir tohum değeri olarak kabul ediyor. Ne yazık ki, bu türlerden bazılarının deterministik bir hash değerine sahip olduğu garanti edilmiyor. Python 3.9'dan sonra, modül tohumlarını :const:`None`, :class:`int`, :class:`float`, :class:`str`, :class:`bytes` ve :class:`bytearray` ilesınırlayacaktır.

source: Opening the :class:`~gzip.GzipFile` file for writing without specifying the *mode* argument is deprecated. In future Python versions it will always be opened for reading by default. Specify the *mode* argument for opening it for writing and silencing a warning. (Contributed by Serhiy Storchaka in :issue:`28286`.)
tr: :class:`~gzip.GzipFile` dosyasının *mode* bağımsız değişkeni belirtilmeden yazmak için açılması kullanımdan kaldırılmıştır. Gelecekteki Python sürümlerinde, her zaman varsayılan olarak okumak için açılacaktır. Bir uyarı yazmak ve susturmak için açmak için *mode* argümanını belirtin. ( :issue:`28286` içinde Serhiy Storchaka tarafından katılmıştır.)

source: Deprecated the ``split()`` method of :class:`_tkinter.TkappType` in favour of the ``splitlist()`` method which has more consistent and predicable behavior. (Contributed by Serhiy Storchaka in :issue:`38371`.)
tr: :class:`_tkinter.TkappType` öğesinin ``split()`` yöntemi, daha tutarlı ve öngörülebilir davranışa sahip ``splitlist()`` yöntemi lehine kullanımdan kaldırıldı. ( :issue:`38371` içinde Serhiy Storchaka tarafından katılmıştır.)

source: The explicit passing of coroutine objects to :func:`asyncio.wait` has been deprecated and will be removed in version 3.11. (Contributed by Yury Selivanov and Kyle Stanley in :issue:`34790`.)
tr: Eşyordam nesnelerinin açıkça :func:`asyncio.wait` öğesine iletilmesi kullanımdan kaldırılmıştır ve sürüm 3.11'de kaldırılacaktır. (Yury Selivanov ve Kyle Stanley tarafından :issue:`34790` 'da katılmıştır.)

source: binhex4 and hexbin4 standards are now deprecated. The :mod:`binhex` module and the following :mod:`binascii` functions are now deprecated:
tr: binhex4 ve hexbin4 standartları artık kullanımdan kaldırılmıştır. :mod:`binhex` modülü ve aşağıdaki :mod:`binascii` fonksiyonları artık kullanımdan kaldırılmıştır:

source: (Contributed by Victor Stinner in :issue:`39353`.)
tr: (Victor Stinner tarafından :issue:`39353` 'de katılmıştır.)

source: :mod:`ast` classes ``slice``, ``Index`` and ``ExtSlice`` are considered deprecated and will be removed in future Python versions. ``value`` itself should be used instead of ``Index(value)``. ``Tuple(slices, Load())`` should be used instead of ``ExtSlice(slices)``. (Contributed by Serhiy Storchaka in :issue:`34822`.)
tr: :mod:`ast` sınıfları ``slice``, ``Index`` ve ``ExtSlice`` kullanımdan kaldırılmış kabul edilir ve gelecekteki Python sürümlerinde kaldırılacaktır. ``Index(value)`` yerine ``value`` kullanılmalıdır. ``ExtSlice(slices)`` yerine ``Tuple(slices, Load())`` kullanılmalıdır. ( :issue:`34822` içinde Serhiy Storchaka tarafından katılmıştır.)

source: :mod:`ast` classes ``Suite``, ``Param``, ``AugLoad`` and ``AugStore`` are considered deprecated and will be removed in future Python versions. They were not generated by the parser and not accepted by the code generator in Python 3. (Contributed by Batuhan Taskaya in :issue:`39639` and :issue:`39969` and Serhiy Storchaka in :issue:`39988`.)
tr: :mod:`ast` sınıfları ``Suite``, ``Param``, ``AugLoad`` ve ``AugStore`` kullanımdan kaldırılmış kabul edilir ve gelecekteki Python sürümlerinde kaldırılacaktır. Ayrıştırıcı tarafından üretilmemişler ve Python 3'teki kod üreteci tarafından kabul edilmemişler. (:issue:`39639` ve :issue:`39969` 'da Batuhan Taşkaya'nın ve :issue:`39988` 'deki Serhiy Storchaka'nın katkılarıyla.)

source: The :c:func:`PyEval_InitThreads` and :c:func:`PyEval_ThreadsInitialized` functions are now deprecated and will be removed in Python 3.11. Calling :c:func:`PyEval_InitThreads` now does nothing. The :term:`GIL` is initialized by :c:func:`Py_Initialize()` since Python 3.7. (Contributed by Victor Stinner in :issue:`39877`.)
tr: :c:func:`PyEval_InitThreads` ve :c:func:`PyEval_ThreadsInitialized` işlevleri artık kullanımdan kaldırılmıştır ve Python 3.11'de kaldırılacaktır. :c:func:`PyEval_InitThreads` çağrılması artık hiçbir şey yapmıyor. :term:`GIL`, Python 3.7'den beri :c:func:`Py_Initialize()` tarafından başlatılmıştır. (Victor Stinner tarafından :issue:`39877` 'de katılmıştır.)

source: Passing ``None`` as the first argument to the :func:`shlex.split` function has been deprecated. (Contributed by Zackery Spytz in :issue:`33262`.)
tr: :func:`shlex.split` işlevine ilk bağımsız değişken olarak ``None`` geçirmek kullanımdan kaldırılmıştır. ( :issue:`33262` içinde Zackery Spytz tarafından katılmıştır.)

source: :func:`smtpd.MailmanProxy` is now deprecated as it is unusable without an external module, ``mailman``. (Contributed by Samuel Colvin in :issue:`35800`.)
tr: :func:`smtpd.MailmanProxy`, harici bir modül olan ``mailman`` olmadan kullanılamaz olduğundan artık kullanımdan kaldırılmıştır. (Samuel Colvin tarafından :issue:`35800` 'de katılmıştır.)

source: The :mod:`lib2to3` module now emits a :exc:`PendingDeprecationWarning`. Python 3.9 switched to a PEG parser (see :pep:`617`), and Python 3.10 may include new language syntax that is not parsable by lib2to3's LL(1) parser. The ``lib2to3`` module may be removed from the standard library in a future Python version. Consider third-party alternatives such as `LibCST`_ or `parso`_. (Contributed by Carl Meyer in :issue:`40360`.)
tr: :mod:`lib2to3` modülü artık bir :exc:`PendingDeprecationWarning` yayar. Python 3.9, bir PEG ayrıştırıcısına geçti (bkz. :pep:`617`) ve Python 3.10, lib2to3'ün LL(1) ayrıştırıcısı tarafından ayrıştırılamayan yeni dil sözdizimini içerebilir. ``lib2to3`` modülü, gelecekteki bir Python sürümünde standart kitaplıktan kaldırılabilir. `LibCST`_ veya `parso`_ gibi üçüncü taraf alternatiflerini göz önünde bulundurun. (Carl Meyer tarafından :issue:`40360` 'da katılmıştır.)

source: The *random* parameter of :func:`random.shuffle` has been deprecated. (Contributed by Raymond Hettinger in :issue:`40465`)
tr: :func:`random.shuffle` öğesinin *random* parametresi kullanımdan kaldırıldı. (Katkı:Raymond Hettinger tarafından :issue:`40465`)

source: Removed
tr: Kaldırılanlar

source: The erroneous version at :data:`unittest.mock.__version__` has been removed.
tr: :data:`unittest.mock.__version__` adresindeki hatalı sürüm kaldırıldı.

source: :class:`nntplib.NNTP`: ``xpath()`` and ``xgtitle()`` methods have been removed. These methods are deprecated since Python 3.3. Generally, these extensions are not supported or not enabled by NNTP server administrators. For ``xgtitle()``, please use :meth:`nntplib.NNTP.descriptions` or :meth:`nntplib.NNTP.description` instead. (Contributed by Dong-hee Na in :issue:`39366`.)
tr: :class:`nntplib.NNTP`: ``xpath()`` ve ``xgtitle()`` yöntemleri kaldırıldı. Bu yöntemler Python 3.3'ten beri kullanımdan kaldırılmıştır. Genel olarak, bu uzantılar NNTP sunucu yöneticileri tarafından desteklenmez veya etkinleştirilmez. ``xgtitle()`` için lütfen bunun yerine :meth:`nntplib.NNTP.descriptions` veya :meth:`nntplib.NNTP.description` kullanın. (Dong-hee Na tarafından :issue:`39366` 'da katılmıştır.)

source: :class:`array.array`: ``tostring()`` and ``fromstring()`` methods have been removed. They were aliases to ``tobytes()`` and ``frombytes()``, deprecated since Python 3.2. (Contributed by Victor Stinner in :issue:`38916`.)
tr: :class:`array.array`: ``tostring()`` ve ``fromstring()`` yöntemleri kaldırıldı. Bunlar, Python 3.2'den beri kullanımda olmayan ``tobytes()`` ve ``frombytes()`` takma adlarıydı. (Victor Stinner tarafından :issue:`38916` 'da katılmıştır.)

source: The undocumented ``sys.callstats()`` function has been removed. Since Python 3.7, it was deprecated and always returned :const:`None`. It required a special build option ``CALL_PROFILE`` which was already removed in Python 3.7. (Contributed by Victor Stinner in :issue:`37414`.)
tr: Belgelenmemiş ``sys.callstats()`` fonksiyonu kaldırıldı. Python 3.7'den beri kullanımdan kaldırıldı ve her zaman :const:`None` döndürdü. Python 3.7'de zaten kaldırılmış olan ``CALL_PROFILE`` adlı özel bir derleme seçeneği gerektiriyordu. (Victor Stinner tarafından :issue:`37414` 'de katılmıştır.)

source: The ``sys.getcheckinterval()`` and ``sys.setcheckinterval()`` functions have been removed. They were deprecated since Python 3.2. Use :func:`sys.getswitchinterval` and :func:`sys.setswitchinterval` instead. (Contributed by Victor Stinner in :issue:`37392`.)
tr: ``sys.getcheckinterval()`` ve ``sys.setcheckinterval()`` işlevleri kaldırıldı. Python 3.2'den beri kullanımdan kaldırıldılar. Bunun yerine :func:`sys.getswitchinterval` ve :func:`sys.setswitchinterval` kullanın. (Victor Stinner tarafından :issue:`37392` 'de katılmıştır.)

source: The C function ``PyImport_Cleanup()`` has been removed. It was documented as: "Empty the module table. For internal use only." (Contributed by Victor Stinner in :issue:`36710`.)
tr: ``PyImport_Cleanup()`` C işlevi kaldırıldı. Şu şekilde belgelenmiştir: "Modül tablosunu boşaltın. Yalnızca dahili kullanım için." (Victor Stinner tarafından :issue:`36710` 'da katılmıştır.)

source: ``_dummy_thread`` and ``dummy_threading`` modules have been removed. These modules were deprecated since Python 3.7 which requires threading support. (Contributed by Victor Stinner in :issue:`37312`.)
tr: ``_dummy_thread`` ve ``dummy_threading`` modülleri kaldırıldı. Bu modüller, iş parçacığı desteği gerektiren Python 3.7'den beri kullanımdan kaldırılmıştır. (Victor Stinner tarafından :issue:`37312` 'de katılmıştır.)

source: ``aifc.openfp()`` alias to ``aifc.open()``, ``sunau.openfp()`` alias to ``sunau.open()``, and ``wave.openfp()`` alias to :func:`wave.open()` have been removed. They were deprecated since Python 3.7. (Contributed by Victor Stinner in :issue:`37320`.)
tr: ``aifc.openfp()`` takma adı ``aifc.open()``, ``sunau.openfp()`` takma adı ``sunau.open()`` ve ``wave.openfp()`` :func:`wave.open()` takma adı kaldırıldı. Python 3.7'den beri kullanımdan kaldırıldılar. (Victor Stinner tarafından :issue:`37320` 'de katılmıştır.)

source: The :meth:`~threading.Thread.isAlive()` method of :class:`threading.Thread` has been removed. It was deprecated since Python 3.8. Use :meth:`~threading.Thread.is_alive()` instead. (Contributed by Dong-hee Na in :issue:`37804`.)
tr: :meth:`~threading.Thread.isAlive()` :class:`threading.Thread` yöntemi kaldırıldı. Python 3.8'den beri kullanımdan kaldırılmıştır. Bunun yerine :meth:`~threading.Thread.is_alive()` kullanın. (Dong-hee Na tarafından :issue:`37804` 'de katılmıştır.)
