Repository: python/python-docs-tr
Catalog: whatsnew/3.9.po
Languages: tr

source: What's New In Python 3.9
tr: Python 3.9'daki Yenilikler

source: Editor
tr: Editör

source: This article explains the new features in Python 3.9, compared to 3.8. Python 3.9 was released on October 5, 2020.
tr: Bu makale Python 3.9' daki 3.8' e kıyasla yeni özellikleri açıklamaktadır. Python 3.9 5 Ekim 2020 tarihinde yayınlandı.

source: For full details, see the :ref:`changelog <changelog>`.
tr: Tüm detaylar için, :ref:`changelog` 'a bakınız.

source: :pep:`596` - Python 3.9 Release Schedule
tr: :pep:`596` - Python 3.9 Yayınlama Takvimi

source: Summary -- Release highlights
tr: Özet -- Sürümün öne çıkanları

source: New syntax features:
tr: Yeni sözdizimi özellikleri:

source: :pep:`584`, union operators added to ``dict``;
tr: :pep:`584` , ``dict`` için birleşim işleçleri eklendi;

source: :pep:`585`, type hinting generics in standard collections;
tr: :pep:`585` , standart koleksiyonlarda tür ipuçlama (type hinting) jenerikleri;

source: :pep:`614`, relaxed grammar restrictions on decorators.
tr: :pep:`614` , dekoratörlerde gramer kısıtlamaları gevşetildi.

source: New built-in features:
tr: Yeni gömülü özellikler:

source: :pep:`616`, string methods to remove prefixes and suffixes.
tr: :pep:`616` , önekleri ve sonekleri kaldırmak için dize yöntemleri.

source: New features in the standard library:
tr: Standart kütüphanedeki yeni özellikler:

source: :pep:`593`, flexible function and variable annotations;
tr: :pep:`593` esnek fonksiyon ve değişken açıklamaları;

source: :func:`os.pidfd_open` added that allows process management without races and signals.
tr: Yarışlar ve sinyaller olmadan süreç yönetimine izin veren :func:`os.pidfd_open` eklendi.

source: Interpreter improvements:
tr: Tercüman geliştirmeleri:

source: :pep:`573`, fast access to module state from methods of C extension types;
tr: :pep:`573`, C uzantı türlerinin yöntemlerinden modül durumuna hızlı erişim;

source: :pep:`617`, CPython now uses a new parser based on PEG;
tr: :pep:`617`, CPython artık PEG tabanlı yeni bir çözümleyici kullanıyor;

source: a number of Python builtins (range, tuple, set, frozenset, list, dict) are now sped up using :pep:`590` vectorcall;
tr: bir dizi python gömülüleri (range, tuple, set, frozenset, list, dict) :pep:`590` vectorcall kullanılarak hızlandırıldı;

source: garbage collection does not block on resurrected objects;
tr: çöp toplama, dirilen nesnelerde engellemez;

source: a number of Python modules (:mod:`_abc`, :mod:`audioop`, :mod:`_bz2`, :mod:`_codecs`, :mod:`_contextvars`, :mod:`_crypt`, :mod:`_functools`, :mod:`_json`, :mod:`_locale`, :mod:`math`, :mod:`operator`, :mod:`resource`, :mod:`time`, :mod:`_weakref`) now use multiphase initialization as defined by PEP 489;
tr: bir dizi Python modülü (:mod:`_abc`, :mod:`audioop`, :mod:`_bz2`, :mod:`_codecs`, :mod:`_contextvars`, :mod:`_crypt`, :mod:`_functools`, :mod:`_json`, :mod:`_locale`, :mod:`math`, :mod:`operator`, :mod:`resource`, :mod:`time`, :mod:`_weakref`) PEP 489 tarafından tanımlandığı gibi çok fazlı başlatma kullanır;

source: a number of standard library modules (:mod:`audioop`, :mod:`ast`, :mod:`grp`, :mod:`_hashlib`, :mod:`pwd`, :mod:`_posixsubprocess`, :mod:`random`, :mod:`select`, :mod:`struct`, :mod:`termios`, :mod:`zlib`) are now using the stable ABI defined by PEP 384.
tr: bir dizi standart kitaplık modülleri (:mod:`audioop`, :mod:`ast`, :mod:`grp`, :mod:`_hashlib`, :mod:`pwd`, :mod:`_posixsubprocess`, :mod:`random`, :mod:`select`, :mod:`struct`, :mod:`termios`, :mod:`zlib`) artık PEP 384 tarafından tanımlanan kararlı ABI'yi kullanıyor.

source: New library modules:
tr: Standart kütüphanedeki yeni özellikler:

source: :pep:`615`, the IANA Time Zone Database is now present in the standard library in the :mod:`zoneinfo` module;
tr: :pep:`615`, IANA Zaman Dilimi Veritabanı artık :mod:`zoneinfo` modülündeki standart kitaplıkta mevcuttur;

source: an implementation of a topological sort of a graph is now provided in the new :mod:`graphlib` module.
tr: topolojik türde bir grafik uygulaması artık yeni :mod:`graphlib` modülünde sağlanmaktadır.

source: Release process changes:
tr: Yayın süreci değişiklikleri:

source: :pep:`602`, CPython adopts an annual release cycle.
tr: :pep:`602`, CPython yıllık bir yayın döngüsü benimser.

source: You should check for DeprecationWarning in your code
tr: Kodunuzda DeprecationWarning olup olmadığını kontrol etmelisiniz

source: When Python 2.7 was still supported, a lot of functionality in Python 3 was kept for backward compatibility with Python 2.7. With the end of Python 2 support, these backward compatibility layers have been removed, or will be removed soon. Most of them emitted a :exc:`DeprecationWarning` warning for several years. For example, using ``collections.Mapping`` instead of ``collections.abc.Mapping`` emits a :exc:`DeprecationWarning` since Python 3.3, released in 2012.
tr: Python 2.7 hala desteklendiğinde, Python 2.7 ile geriye dönük uyumluluk için Python 3'teki birçok işlevsellik korunmuştur. Python 2 desteğinin sona ermesiyle bu geriye dönük uyumluluk katmanları kaldırıldı veya yakında kaldırılacak. Çoğu, birkaç yıl boyunca bir :exc:`DeprecationWarning` uyarısı yayınladı. Örneğin, ``collections.abc.Mapping`` yerine ``collections.Mappin`` kullanmak, 2012'de yayınlanan Python 3.3'ten bu yana bir :exc:`DeprecationWarning` yayar.

source: Test your application with the :option:`-W` ``default`` command-line option to see :exc:`DeprecationWarning` and :exc:`PendingDeprecationWarning`, or even with :option:`-W` ``error`` to treat them as errors. :ref:`Warnings Filter <warning-filter>` can be used to ignore warnings from third-party code.
tr: :exc:`DeprecationWarning` ve :exc:`PendingDeprecationWarning` öğelerini görmek için :option:`-W` ``default`` komut satırı seçeneğiyle veya bunları hata olarak değerlendirmek için :option:`-W` ``error`` ile uygulamanızı test edin. :ref:`Uyarı Filtresi <warning-filter>`, üçüncü taraf kodundan gelen uyarıları yok saymak için kullanılabilir.

source: Python 3.9 is the last version providing those Python 2 backward compatibility layers, to give more time to Python projects maintainers to organize the removal of the Python 2 support and add support for Python 3.9.
tr: Python 3.9, Python proje yöneticilerine Python 2 desteğinin kaldırılmasını organize etmeleri ve Python 3.9 için destek eklemeleri için daha fazla zaman vermek üzere Python 2 geriye dönük uyumluluk katmanlarını sağlayan son sürümdür.

source: Aliases to :ref:`Abstract Base Classes <collections-abstract-base-classes>` in the :mod:`collections` module, like ``collections.Mapping`` alias to :class:`collections.abc.Mapping`, are kept for one last release for backward compatibility. They will be removed from Python 3.10.
tr: :mod:`collections` modülünde :ref:`Soyut Temel Sınıflar <collections-abstract-base-classes>` için takma adlar, :class:`collections.abc.Mapping` için ``collections.Mapping`` takma adı gibi, geriye dönük uyumluluk için son bir sürüm için saklanır. Python 3.10'dan kaldırılacaklar.

source: More generally, try to run your tests in the :ref:`Python Development Mode <devmode>` which helps to prepare your code to make it compatible with the next Python version.
tr: Daha genel olarak, kodunuzu bir sonraki Python sürümüyle uyumlu hale getirmek için hazırlamanıza yardımcı olan :ref:`Python Development Mode <devmode>` testlerinizi çalıştırmayı deneyin.

source: Note: a number of pre-existing deprecations were removed in this version of Python as well. Consult the :ref:`removed-in-python-39` section.
tr: Not: Python'un bu sürümünde önceden var olan bazı kullanımdan kaldırmalar da kaldırılmıştır. :ref:`removed-in-python-39` bölümüne bakınız.

source: New Features
tr: Yeni Özellikler

source: Dictionary Merge & Update Operators
tr: Sözlük Birleştirme ve Güncelleme Operatörleri

source: Merge (``|``) and update (``|=``) operators have been added to the built-in :class:`dict` class. Those complement the existing ``dict.update`` and ``{**d1, **d2}`` methods of merging dictionaries.
tr: Gömülü :class:`dict` sınıfına birleştirme (``|``) ve güncelleme (``|=``) operatörleri eklendi. Bunlar, sözlükleri birleştirmenin mevcut ``dict.update`` ve ``{**d1, **d2}`` yöntemlerini tamamlar.

source: Example::
tr: Örnek::

source: See :pep:`584` for a full description. (Contributed by Brandt Bucher in :issue:`36144`.)
tr: Tam açıklama için :pep:`584` sayfasına bakınız. (Brandt Bucher tarafından :issue:`36144` ile katkıda bulunulmuştur)

source: New String Methods to Remove Prefixes and Suffixes
tr: Önekleri ve Sonekleri Kaldırmak için Yeni Dize Yöntemleri

source: :meth:`str.removeprefix(prefix)<str.removeprefix>` and :meth:`str.removesuffix(suffix)<str.removesuffix>` have been added to easily remove an unneeded prefix or a suffix from a string. Corresponding ``bytes``, ``bytearray``, and ``collections.UserString`` methods have also been added. See :pep:`616` for a full description. (Contributed by Dennis Sweeney in :issue:`39939`.)
tr: :meth:`str.removeprefix(prefix)<str.removeprefix>` ve :meth:`str.removesuffix(suffix)<str.removesuffix>`, gereksiz bir öneki veya bir soneki bir dizeden kolayca kaldırmak için eklenmiştir. Karşılık gelen ``bytes``, ``bytearray`` ve ``collections.UserString`` yöntemleri de eklenmiştir. Tam açıklama için :pep:`616` 'ya bakın. (Dennis Sweeney tarafından :issue:`39939` 'da katılmıştır.)

source: Type Hinting Generics in Standard Collections
tr: Standart Koleksiyonlardaki Tür Dayatma Jenerikleri

source: In type annotations you can now use built-in collection types such as ``list`` and ``dict`` as generic types instead of importing the corresponding capitalized types (e.g. ``List`` or ``Dict``) from ``typing``. Some other types in the standard library are also now generic, for example ``queue.Queue``.
tr: Yazım ek açıklamalarında, artık ``typing`` 'den karşılık gelen büyük harfli türleri (örnek olarak ``List`` veya ``Dict``) içe aktarmak yerine ``list`` ve ``dict`` gibi yerleşik koleksiyon türlerini genel türler olarak kullanabilirsiniz. Standart kitaplıktaki diğer bazı türler de artık geneldir, örneğin ``queue.Queue``.

source: Example:
tr: Örnek:

source: See :pep:`585` for more details. (Contributed by Guido van Rossum, Ethan Smith, and Batuhan Taşkaya in :issue:`39481`.)
tr: Daha fazla ayrıntı için bkz. :pep:`585`. (Guido van Rossum, Ethan Smith ve Batuhan Taşkaya'nın katkılarıyla :issue:`39481`.)

source: New Parser
tr: Yeni Ayrıştırıcı

source: Python 3.9 uses a new parser, based on `PEG <https://en.wikipedia.org/wiki/Parsing_expression_grammar>`_ instead of `LL(1) <https://en.wikipedia.org/wiki/LL_parser>`_. The new parser's performance is roughly comparable to that of the old parser, but the PEG formalism is more flexible than LL(1) when it comes to designing new language features. We'll start using this flexibility in Python 3.10 and later.
tr: Python 3.9, `LL(1) <https://en.wikipedia.org/wiki/LL_parser>`_ yerine `PEG <https://en.wikipedia.org/wiki/Parsing_expression_grammar>`_ tabanlı yeni bir ayrıştırıcı kullanır. Yeni ayrıştırıcının performansı kabaca eski ayrıştırıcınınkiyle karşılaştırılabilir, ancak iş yeni dil özellikleri tasarlamaya geldiğinde PEG biçimciliği LL(1)'den daha esnektir. Bu esnekliği Python 3.10 ve sonrasında kullanmaya başlayacağız.

source: The :mod:`ast` module uses the new parser and produces the same AST as the old parser.
tr: :mod:`ast` modülü yeni ayrıştırıcıyı kullanır ve eski ayrıştırıcı ile aynı AST'yi üretir.

source: In Python 3.10, the old parser will be deleted and so will all functionality that depends on it (primarily the :mod:`parser` module, which has long been deprecated). In Python 3.9 *only*, you can switch back to the LL(1) parser using a command line switch (``-X oldparser``) or an environment variable (``PYTHONOLDPARSER=1``).
tr: Python 3.10'da, eski ayrıştırıcı ve buna bağlı olan tüm fonksiyonlar silinecektir (öncelikle uzun süredir kullanımdan kaldırılmış olan :mod:`parser` modülü). *yalnızca* Python 3.9'da, bir komut satırı anahtarı (``-X oldparser``) veya bir ortam değişkeni (``PYTHONOLDPARSER=1``) kullanarak LL(1) ayrıştırıcısına geri dönebilirsiniz.

source: See :pep:`617` for more details. (Contributed by Guido van Rossum, Pablo Galindo and Lysandros Nikolaou in :issue:`40334`.)
tr: Daha fazla ayrıntı için bkz. :pep:`617`. ( :issue:`40334` içinde Guido van Rossum, Pablo Galindo ve Lysandros Nikolaou tarafından katılmıştır.)

source: Other Language Changes
tr: Başka Dil Değişiklikleri

source: :func:`__import__` now raises :exc:`ImportError` instead of :exc:`ValueError`, which used to occur when a relative import went past its top-level package. (Contributed by Ngalim Siregar in :issue:`37444`.)
tr: :func:`__import__` artık :exc:`ImportError` değerini, eskiden göreli bir içe aktarma üst düzey paketini geçtiğinde oluşan :exc:`ValueError` yerine yükseltiyor. ( :issue:`37444` içinde Ngalim Siregar tarafından katılmıştır.)

source: Python now gets the absolute path of the script filename specified on the command line (ex: ``python3 script.py``): the ``__file__`` attribute of the :mod:`__main__` module became an absolute path, rather than a relative path. These paths now remain valid after the current directory is changed by :func:`os.chdir`. As a side effect, the traceback also displays the absolute path for :mod:`__main__` module frames in this case. (Contributed by Victor Stinner in :issue:`20443`.)
tr: Python artık komut satırında belirtilen betik dosya adının mutlak yolunu alıyor (örn: ``python3 script.py``): :mod:`__main__` modülünün ``__file__`` özniteliği, mutlak bir yol haline geldi. göreceli bir yoldan daha. Bu yollar, geçerli dizin :func:`os.chdir` tarafından değiştirildikten sonra artık geçerliliğini koruyor. Bir yan etki olarak geri izleme, bu durumda :mod:`__main__` modül çerçeveleri için mutlak yolu da görüntüler. (Victor Stinner tarafından :issue:`20443` 'de katılmıştır.)

source: In the :ref:`Python Development Mode <devmode>` and in :ref:`debug build <debug-build>`, the *encoding* and *errors* arguments are now checked for string encoding and decoding operations. Examples: :func:`open`, :meth:`str.encode` and :meth:`bytes.decode`.
tr: :ref:`Python Development Mode <devmode>` ve :ref:`debug build <debug-build>` içinde, *encoding* ve *errors* argümanları artık dize kodlama ve kod çözme işlemleri için kontrol ediliyor. Örnekler: :func:`open`, :meth:`str.encode` ve :meth:`bytes.decode`.

source: By default, for best performance, the *errors* argument is only checked at the first encoding/decoding error and the *encoding* argument is sometimes ignored for empty strings. (Contributed by Victor Stinner in :issue:`37388`.)
tr: Varsayılan olarak, en iyi performans için *errors* bağımsız değişkeni yalnızca ilk kodlama/kod çözme hatasında kontrol edilir ve *encoding* bağımsız değişkeni bazen boş dizeler için yoksayılır. (Victor Stinner tarafından :issue:`37388` 'de katılmıştır.)

source: ``"".replace("", s, n)`` now returns ``s`` instead of an empty string for all non-zero ``n``. It is now consistent with ``"".replace("", s)``. There are similar changes for :class:`bytes` and :class:`bytearray` objects. (Contributed by Serhiy Storchaka in :issue:`28029`.)
tr: ``"".replace("", s, n)`` artık sıfır olmayan tüm ``n`` için boş bir dize yerine ``s`` döndürür. Artık ``"".replace("", s)`` ile tutarlıdır. :class:`bytes` ve :class:`bytearray` nesneleri için benzer değişiklikler vardır. (Serhiy Storchaka tarafından :issue:`28029` 'da katılmıştır.)

source: Any valid expression can now be used as a :term:`decorator`. Previously, the grammar was much more restrictive. See :pep:`614` for details. (Contributed by Brandt Bucher in :issue:`39702`.)
tr: Artık herhangi bir geçerli ifade :term:`dekoratör` olarak kullanılabilir. Önceden, gramer çok daha kısıtlayıcıydı. Ayrıntılar için bkz. :pep:`614`. (Brandt Bucher tarafından :issue:`39702` 'de katılmıştır.)

source: Improved help for the :mod:`typing` module. Docstrings are now shown for all special forms and special generic aliases (like ``Union`` and ``List``). Using :func:`help` with generic alias like ``List[int]`` will show the help for the correspondent concrete type (``list`` in this case). (Contributed by Serhiy Storchaka in :issue:`40257`.)
tr: :mod:`typing` modülü için yardım iyileştirildi. döküman dizeleri artık tüm özel formlar ve özel genel takma adlar (``Union`` ve ``List`` gibi) için gösteriliyor. :func:`help` öğesini ``List[int]`` gibi genel takma adla kullanmak, karşılık gelen somut tür için yardımı gösterir (bu durumda ``list``). ( :issue:`40257` içinde Serhiy Storchaka tarafından katılmıştır.)

source: Parallel running of :meth:`~agen.aclose` / :meth:`~agen.asend` / :meth:`~agen.athrow` is now prohibited, and ``ag_running`` now reflects the actual running status of the async generator. (Contributed by Yury Selivanov in :issue:`30773`.)
tr: :meth:`~agen.aclose` / :meth:`~agen.asend` / :meth:`~agen.athrow` 'nın paralel çalışması artık yasaklanmıştır ve ``ag_running`` artık zaman uyumsuz oluşturucunun gerçek çalışma durumunu yansıtmaktadır. (Yury Selivanov tarafından :issue:`30773` 'de katılmıştır.)

source: Unexpected errors in calling the ``__iter__`` method are no longer masked by ``TypeError`` in the :keyword:`in` operator and functions :func:`~operator.contains`, :func:`~operator.indexOf` and :func:`~operator.countOf` of the :mod:`operator` module. (Contributed by Serhiy Storchaka in :issue:`40824`.)
tr: ``__iter__`` yöntemini çağırmadaki beklenmeyen hatalar artık :keyword:`in` operatöründe ve :mod:`operator` modülünün :func:`~operator.contains`, :func:`~operator.indexOf` ve :func:`~operator.countOf` fonksiyonlarında ``TypeError`` tarafından maskelenmiyor. ( :issue:`40824` içinde Serhiy Storchaka tarafından katılmıştır.)

source: Unparenthesized lambda expressions can no longer be the expression part in an ``if`` clause in comprehensions and generator expressions. See :issue:`41848` and :issue:`43755` for details.
tr: Parantezsiz lambda ifadeleri artık kavramalarda ve üreteç ifadelerinde bir ``if`` yan tümcesinde ifade parçası olamaz. Ayrıntılar için :issue:`41848` ve :issue:`43755` 'e bakın.

source: New Modules
tr: Yeni Modüller

source: The :mod:`zoneinfo` module brings support for the IANA time zone database to the standard library. It adds :class:`zoneinfo.ZoneInfo`, a concrete :class:`datetime.tzinfo` implementation backed by the system's time zone data.
tr: :mod:`zoneinfo` modülü, standart kitaplığa IANA saat dilimi veritabanı desteği getirir. Sistemin saat dilimi verileri tarafından desteklenen somut bir :class:`datetime.tzinfo` uygulaması olan :class:`zoneinfo.ZoneInfo` ekler.

source: As a fall-back source of data for platforms that don't ship the IANA database, the |tzdata|_ module was released as a first-party package -- distributed via PyPI and maintained by the CPython core team.
tr: |tzdata|_ modülü, IANA veri tabanını sağlamayan platformlar için yedek veri kaynağı olarak, PyPI aracılığıyla dağıtılan ve CPython çekirdek ekibi tarafından sürdürülen birinci taraf bir paket olarak piyasaya sürüldü.

source: :pep:`615` -- Support for the IANA Time Zone Database in the Standard Library
tr: :pep:`615` -- Standart Kitaplıkta IANA Saat Dilimi Veritabanı Desteği

source: PEP written and implemented by Paul Ganssle
tr: Paul Ganssle tarafından yazılan ve uygulanan PEP

source: A new module, :mod:`graphlib`, was added that contains the :class:`graphlib.TopologicalSorter` class to offer functionality to perform topological sorting of graphs. (Contributed by Pablo Galindo, Tim Peters and Larry Hastings in :issue:`17005`.)
tr: Grafiklerin topolojik sıralamasını gerçekleştirmek üzere işlevsellik sunmak için :class:`graphlib.TopologicalSorter` sınıfını içeren :mod:`graphlib` adlı yeni bir modül eklendi. ( :issue:`17005` içinde Pablo Galindo, Tim Peters ve Larry Hastings'in katkılarıyla.)

source: Improved Modules
tr: Geliştirilen Modüller

source: Added the *indent* option to :func:`~ast.dump` which allows it to produce a multiline indented output. (Contributed by Serhiy Storchaka in :issue:`37995`.)
tr: :func:`~ast.dump` dosyasına *indent* seçeneği eklendi, bu da çok satırlı girintili bir çıktı üretmesini sağlar. ( :issue:`37995` içinde Serhiy Storchaka tarafından katılmıştır.)

source: Added :func:`ast.unparse` as a function in the :mod:`ast` module that can be used to unparse an :class:`ast.AST` object and produce a string with code that would produce an equivalent :class:`ast.AST` object when parsed. (Contributed by Pablo Galindo and Batuhan Taskaya in :issue:`38870`.)
tr: :mod:`ast` modülüne, bir :class:`ast.AST` nesnesini ayrıştırmak ve ayrıştırıldığında eşdeğer bir :class:`ast.AST` nesnesi üretecek kod içeren bir dize üretmek için kullanılabilen bir fonksiyon olarak :func:`ast.unparse` eklendi. ( :issue:`38870` 'de Pablo Galindo ve Batuhan Taskaya'nın katkısıyla.)

source: Added docstrings to AST nodes that contains the ASDL signature used to construct that node. (Contributed by Batuhan Taskaya in :issue:`39638`.)
tr: AST düğümlerine, o düğümü oluşturmak için kullanılan ASDL imzasını içeren doküman dizeleri eklendi. (Batuhan Taşkaya :issue:`39638` 'de katılmıştır.)

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint` is no longer supported. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. For more details, see the documentation for ``loop.create_datagram_endpoint()``. (Contributed by Kyle Stanley, Antoine Pitrou, and Yury Selivanov in :issue:`37228`.)
tr: Önemli güvenlik kaygıları nedeniyle, :meth:`asyncio.loop.create_datagram_endpoint` 'in *reuse_address* parametresi artık desteklenmemektedir. Bunun nedeni, UDP'deki ``SO_REUSEADDR`` soket seçeneğinin davranışıdır. Daha fazla ayrıntı için ``loop.create_datagram_endpoint()`` belgelerine bakın. (Kyle Stanley, Antoine Pitrou ve Yury Selivanov'un katkılarıyla :issue:`37228`.)

source: Added a new :term:`coroutine` :meth:`~asyncio.loop.shutdown_default_executor` that schedules a shutdown for the default executor that waits on the :class:`~concurrent.futures.ThreadPoolExecutor` to finish closing. Also, :func:`asyncio.run` has been updated to use the new :term:`coroutine`. (Contributed by Kyle Stanley in :issue:`34037`.)
tr: :class:`~concurrent.futures.ThreadPoolExecutor` üzerinde kapanışı bitirmeyi bekleyen varsayılan yürütücü için bir kapatma programlayan yeni bir :term:`coroutine` :meth:`~asyncio.loop.shutdown_default_executor` eklendi. Ayrıca, :func:`asyncio.run` yeni :term:`coroutine` kelimesini kullanacak şekilde güncellendi. (Kyle Stanley tarafından :issue:`34037` 'de katılmıştır.)

source: Added :class:`asyncio.PidfdChildWatcher`, a Linux-specific child watcher implementation that polls process file descriptors. (:issue:`38692`)
tr: İşlem dosyası tanımlayıcılarını yoklayan, Linux'a özgü bir çocuk izleyici uygulaması olan :class:`asyncio.PidfdChildWatcher` eklendi. (:issue:`38692`)

source: Added a new :term:`coroutine` :func:`asyncio.to_thread`. It is mainly used for running IO-bound functions in a separate thread to avoid blocking the event loop, and essentially works as a high-level version of :meth:`~asyncio.loop.run_in_executor` that can directly take keyword arguments. (Contributed by Kyle Stanley and Yury Selivanov in :issue:`32309`.)
tr: Yeni bir :term:`coroutine` :func:`asyncio.to_thread` eklendi. Olay döngüsünü engellemekten kaçınmak için GÇ'ye bağlı işlevleri ayrı bir iş parçacığında çalıştırmak için kullanılır ve temel olarak :meth:`~asyncio.loop.run_in_executor` öğesinin doğrudan anahtar sözcük bağımsız değişkenlerini alabilen üst düzey bir sürümü olarak çalışır. ( :issue:`32309` 'da Kyle Stanley ve Yuri Selivanov tarafından katılmıştır.)
