Repository: python/python-docs-tr
Catalog: whatsnew/3.9.po
Languages: tr

source: When cancelling the task due to a timeout, :meth:`asyncio.wait_for` will now wait until the cancellation is complete also in the case when *timeout* is <= 0, like it does with positive timeouts. (Contributed by Elvis Pranskevichus in :issue:`32751`.)
tr: Bir zaman aşımı nedeniyle görevi iptal ederken, :meth:`asyncio.wait_for` şimdi, pozitif zaman aşımlarında olduğu gibi *timeout* <= 0 olduğunda da iptalin tamamlanmasını bekleyecek. ( :issue:`32751` 'de Elvis Pranskevichus tarafından katılmıştır.)

source: :mod:`asyncio` now raises :exc:`TyperError` when calling incompatible methods with an :class:`ssl.SSLSocket` socket. (Contributed by Ido Michael in :issue:`37404`.)
tr: :mod:`asyncio` artık bir :class:`ssl.SSLSocket` soketi ile uyumsuz yöntemler çağrıldığında :exc:`TyperError` hatası veriyor. ( :issue:`37404` içinde Ido Michael tarafından katılmıştır.)

source: Added new possibility to use hardlinks for duplicated ``.pyc`` files: *hardlink_dupes* parameter and --hardlink-dupes command line option. (Contributed by Lumír 'Frenzy' Balhar in :issue:`40495`.)
tr: Yinelenen ``.pyc`` dosyaları için hardlink kullanma olanağı eklendi: *hardlink_dupes* parametresi ve --hardlink-dupes komut satırı seçeneği. (Lumír 'Frenzy' Balhar'ın :issue:`40495` içinde katkısı.)

source: Added new options for path manipulation in resulting ``.pyc`` files: *stripdir*, *prependdir*, *limit_sl_dest* parameters and -s, -p, -e command line options. Added the possibility to specify the option for an optimization level multiple times. (Contributed by Lumír 'Frenzy' Balhar in :issue:`38112`.)
tr: Ortaya çıkan ``.pyc`` dosyalarında yol işleme için yeni seçenekler eklendi: *stripdir*, *prependdir*, *limit_sl_dest* parametreleri ve -s, -p, -e komut satırı seçenekleri. Optimizasyon düzeyi seçeneğini birden çok kez belirleme olanağı eklendi. (Lumír 'Frenzy' Balhar'ın katkılarıyla :issue:`38112`.)

source: Added a new *cancel_futures* parameter to :meth:`concurrent.futures.Executor.shutdown` that cancels all pending futures which have not started running, instead of waiting for them to complete before shutting down the executor. (Contributed by Kyle Stanley in :issue:`39349`.)
tr: :meth:`concurrent.futures.Executor.shutdown` öğesine, yürütücüyü kapatmadan önce tamamlanmalarını beklemek yerine çalışmaya başlamamış bekleyen tüm vadeli işlemleri iptal eden yeni bir *cancel_futures* parametresi eklendi. (Kyle Stanley tarafından :issue:`39349` 'da katılmıştır.)

source: Removed daemon threads from :class:`~concurrent.futures.ThreadPoolExecutor` and :class:`~concurrent.futures.ProcessPoolExecutor`. This improves compatibility with subinterpreters and predictability in their shutdown processes. (Contributed by Kyle Stanley in :issue:`39812`.)
tr: :class:`~concurrent.futures.ThreadPoolExecutor` ve :class:`~concurrent.futures.ProcessPoolExecutor` 'dan arka plan programı konuları kaldırıldı. Bu, alt yorumlayıcılarla uyumluluğu ve kapatma süreçlerinde öngörülebilirliği geliştirir. (Kyle Stanley tarafından :issue:`39812` 'de katılmıştır.)

source: Workers in :class:`~concurrent.futures.ProcessPoolExecutor` are now spawned on demand, only when there are no available idle workers to reuse. This optimizes startup overhead and reduces the amount of lost CPU time to idle workers. (Contributed by Kyle Stanley in :issue:`39207`.)
tr: :class:`~concurrent.futures.ProcessPoolExecutor` içindeki çalışanlar artık talep üzerine, yalnızca yeniden kullanılacak boş çalışan olmadığında ortaya çıkıyor. Bu, başlatma yükünü optimize eder ve boşta kalan çalışanlar için kaybedilen CPU süresini azaltır. (Kyle Stanley tarafından :issue:`39207` 'de katılmıştır.)

source: Added :func:`curses.get_escdelay`, :func:`curses.set_escdelay`, :func:`curses.get_tabsize`, and :func:`curses.set_tabsize` functions. (Contributed by Anthony Sottile in :issue:`38312`.)
tr: :func:`curses.get_escdelay`, :func:`curses.set_escdelay`, :func:`curses.get_tabsize` ve :func:`curses.set_tabsize` işlevleri eklendi. (Anthony Sottile tarafından :issue:`38312` 'de katılmıştır.)

source: The :meth:`~datetime.date.isocalendar()` of :class:`datetime.date` and :meth:`~datetime.datetime.isocalendar()` of :class:`datetime.datetime` methods now returns a :func:`~collections.namedtuple` instead of a :class:`tuple`. (Contributed by Dong-hee Na in :issue:`24416`.)
tr: :class:`datetime.date` öğesinin :meth:`~datetime.date.isocalendar()` ve :class:`datetime.datetime` öğesinin :meth:`~datetime.datetime.isocalendar()` metotları artık bir :class:`tuple` yerine :func:`~collections.namedtuple` döndürüyor. (Dong-hee Na tarafından :issue:`24416` 'da katılmıştır.)

source: The :command:`upload` command now creates SHA2-256 and Blake2b-256 hash digests. It skips MD5 on platforms that block MD5 digest. (Contributed by Christian Heimes in :issue:`40698`.)
tr: :command:`upload` komutu artık SHA2-256 ve Blake2b-256 hash özetleri oluşturuyor. MD5 özetini engelleyen platformlarda MD5'i atlar. ( :issue:`40698` içinde Christian Heimes tarafından katılmıştır.)

source: Added constants :data:`~fcntl.F_OFD_GETLK`, :data:`~fcntl.F_OFD_SETLK` and :data:`~fcntl.F_OFD_SETLKW`. (Contributed by Dong-hee Na in :issue:`38602`.)
tr: :data:`~fcntl.F_OFD_GETLK`, :data:`~fcntl.F_OFD_SETLK` ve :data:`~fcntl.F_OFD_SETLKW` sabitleri eklendi. (Dong-hee Na tarafından :issue:`38602` 'de katılmıştır.)

source: :class:`~ftplib.FTP` and :class:`~ftplib.FTP_TLS` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Dong-hee Na in :issue:`39259`.)
tr: :class:`~ftplib.FTP` ve :class:`~ftplib.FTP_TLS` artık bir :class:`ValueError` oluşturucuları için verilen zaman aşımı sıfır ise bloke olmayan bir soketin oluşturulmasını engelliyor. (Dong-hee Na tarafından :issue:`39259` 'da katılmıştır.)

source: When the garbage collector makes a collection in which some objects resurrect (they are reachable from outside the isolated cycles after the finalizers have been executed), do not block the collection of all objects that are still unreachable. (Contributed by Pablo Galindo and Tim Peters in :issue:`38379`.)
tr: Çöp toplayıcı, bazı nesnelerin diriltildiği bir koleksiyon oluşturduğunda (sonlandırıcılar yürütüldükten sonra yalıtılmış döngülerin dışından erişilebilirler), hala erişilemeyen tüm nesnelerin toplanmasını engellemeyin. ( :issue:`38379` 'da Pablo Galindo ve Tim Peters tarafıdnan eklendi.)

source: Added a new function :func:`gc.is_finalized` to check if an object has been finalized by the garbage collector. (Contributed by Pablo Galindo in :issue:`39322`.)
tr: Bir nesnenin çöp toplayıcı tarafından sonlandırılıp sonlandırılmadığını kontrol etmek için :func:`gc.is_finalized` adlı yeni bir işlev eklendi. (Pablo Galindo tarafından :issue:`39322` 'de katılmıştır.)

source: The :mod:`hashlib` module can now use SHA3 hashes and SHAKE XOF from OpenSSL when available. (Contributed by Christian Heimes in :issue:`37630`.)
tr: :mod:`hashlib` modülü artık mevcut olduğunda OpenSSL'den SHA3 karmalarını ve SHAKE XOF'u kullanabilir. (Christian Heimes tarafından :issue:`37630` 'da katılmıştır.)

source: Builtin hash modules can now be disabled with ``./configure --without-builtin-hashlib-hashes`` or selectively enabled with e.g. ``./configure --with-builtin-hashlib-hashes=sha3,blake2`` to force use of OpenSSL based implementation. (Contributed by Christian Heimes in :issue:`40479`)
tr: Yerleşik karma modüller, OpenSSL tabanlı uygulamanın kullanımını zorlamak için artık ``./configure --without-builtin-hashlib-hashes`` ile devre dışı bırakılabilir veya e.g. ``./configure --with-builtin-hashlib-hashes=sha3,blake2`` ile seçici olarak etkinleştirilebilir. (Christian Heimes tarafından :issue:`40479` 'da katılmıştır)

source: HTTP status codes ``103 EARLY_HINTS``, ``418 IM_A_TEAPOT`` and ``425 TOO_EARLY`` are added to :class:`http.HTTPStatus`. (Contributed by Dong-hee Na in :issue:`39509` and Ross Rhodes in :issue:`39507`.)
tr: HTTP durum kodları ``103 EARLY_HINTS``, ``418 IM_A_TEAPOT`` ve ``425 TOO_EARLY`` :class:`http.HTTPStatus` 'a eklendi. ( :issue:`39509` içinde Dong-hee Na ve :issue:`39507` 'de Ross Rhodes tarafından katılmıştır.)

source: IDLE and idlelib
tr: IDLE ve idlelib

source: Added option to toggle cursor blink off. (Contributed by Zackery Spytz in :issue:`4603`.)
tr: İmlecin yanıp sönmesini kapatmak için seçenek eklendi. ( :issue:`4603` içinde Zackery Spytz tarafından katılmıştır.)

source: Escape key now closes IDLE completion windows. (Contributed by Johnny Najera in :issue:`38944`.)
tr: Escape tuşu artık IDLE tamamlama pencerelerini kapatıyor. ( :issue:`38944` içinde Johnny Najera tarafından katılmıştır.)

source: Added keywords to module name completion list. (Contributed by Terry J. Reedy in :issue:`37765`.)
tr: Modül adı tamamlama listesine anahtar kelimeler eklendi. ( :issue:`37765` içinde Terry J. Reedy tarafından katılmıştır.)

source: New in 3.9 maintenance releases
tr: 3.9 bakım sürümlerinde yenilikler

source: Make IDLE invoke :func:`sys.excepthook` (when started without '-n'). User hooks were previously ignored. (Contributed by Ken Hilton in :issue:`43008`.)
tr: IDLE'yi başlatın :func:`sys.excepthook` ('-n' olmadan başlatıldığında). Kullanıcı kancaları daha önce yok sayılırdı. ( :issue:`43008` 'de Ken Hilton tarafından katılmıştır.)

source: The changes above have been backported to 3.8 maintenance releases.
tr: Yukarıdaki değişiklikler 3.8 bakım sürümlerine geri aktarılmıştır.

source: Rearrange the settings dialog. Split the General tab into Windows and Shell/Ed tabs. Move help sources, which extend the Help menu, to the Extensions tab. Make space for new options and shorten the dialog. The latter makes the dialog better fit small screens. (Contributed by Terry Jan Reedy in :issue:`40468`.) Move the indent space setting from the Font tab to the new Windows tab. (Contributed by Mark Roseman and Terry Jan Reedy in :issue:`33962`.)
tr: Ayarlar iletişim kutusunu yeniden düzenleyin. Genel sekmesini Windows ve Kabuk/Ed sekmelerine ayırın. Yardım menüsünü genişleten yardım kaynaklarını Uzantılar sekmesine taşıyın. Yeni seçenekler için yer açın ve iletişim kutusunu kısaltın. İkincisi, iletişim kutusunu küçük ekranlara daha iyi sığdırır. ( :issue:`40468` içinde Terry Jan Reedy tarafından katılmıştır.) Girinti alanı ayarını Yazı Tipi sekmesinden yeni Windows sekmesine taşıyın. (Mark Roseman ve Terry Jan Reedy tarafından :issue:`33962` 'de katılmıştır.)

source: Apply syntax highlighting to ``.pyi`` files. (Contributed by Alex Waygood and Terry Jan Reedy in :issue:`45447`.)
tr: ``.pyi`` dosyalarına vurgulama sözdizimi uygulayın. ( :issue:`45447` içinde Alex Waygood ve Terry Jan Reedy tarafından katılmıştır.)

source: :class:`~imaplib.IMAP4` and :class:`~imaplib.IMAP4_SSL` now have an optional *timeout* parameter for their constructors. Also, the :meth:`~imaplib.IMAP4.open` method now has an optional *timeout* parameter with this change. The overridden methods of :class:`~imaplib.IMAP4_SSL` and :class:`~imaplib.IMAP4_stream` were applied to this change. (Contributed by Dong-hee Na in :issue:`38615`.)
tr: :class:`~imaplib.IMAP4` ve :class:`~imaplib.IMAP4_SSL` artık kurucuları için isteğe bağlı bir *timeout* parametresine sahip. Ayrıca, :meth:`~imaplib.IMAP4.open` yöntemi artık bu değişiklikle birlikte isteğe bağlı bir *timeout* parametresine sahip. Bu değişikliğe geçersiz kılınan :class:`~imaplib.IMAP4_SSL` ve :class:`~imaplib.IMAP4_stream` yöntemleri uygulandı. (Dong-hee Na tarafından :issue:`38615` 'de katılmıştır.)

source: :meth:`imaplib.IMAP4.unselect` is added. :meth:`imaplib.IMAP4.unselect` frees server's resources associated with the selected mailbox and returns the server to the authenticated state. This command performs the same actions as :meth:`imaplib.IMAP4.close`, except that no messages are permanently removed from the currently selected mailbox. (Contributed by Dong-hee Na in :issue:`40375`.)
tr: :meth:`imaplib.IMAP4.unselect` eklendi. :meth:`imaplib.IMAP4.unselect` sunucunun seçilen posta kutusuyla ilişkili kaynaklarını serbest bırakır ve sunucuyu kimliği doğrulanmış duruma döndürür. Bu komut :meth:`imaplib.IMAP4.close` ile aynı eylemleri gerçekleştirir, tek fark şu anda seçili olan posta kutusundan hiçbir mesajın kalıcı olarak kaldırılmamasıdır. (Dong-hee Na tarafından :issue:`40375` 'de katılmıştır.)

source: To improve consistency with import statements, :func:`importlib.util.resolve_name` now raises :exc:`ImportError` instead of :exc:`ValueError` for invalid relative import attempts. (Contributed by Ngalim Siregar in :issue:`37444`.)
tr: İçe aktarma ifadeleriyle tutarlılığı artırmak için :func:`importlib.util.resolve_name` artık geçersiz göreli içe aktarma girişimleri için :exc:`ValueError` yerine :exc:`ImportError` değerini yükseltiyor. ( :issue:`37444` içinde Ngalim Siregar tarafından katılmıştır.)

source: Import loaders which publish immutable module objects can now publish immutable packages in addition to individual modules. (Contributed by Dino Viehland in :issue:`39336`.)
tr: Değişmez modül nesnelerini yayınlayan içe aktarma yükleyicileri artık bağımsız modüllere ek olarak değişmez paketleri de yayınlayabilir. (Dino Viehland tarafından :issue:`39336` 'da katılmıştır.)

source: Added :func:`importlib.resources.files` function with support for subdirectories in package data, matching backport in ``importlib_resources`` version 1.5. (Contributed by Jason R. Coombs in :issue:`39791`.)
tr: Paket verilerindeki alt dizinleri destekleyen, ``importlib_resources`` sürüm 1.5'te backport ile eşleşen :func:`importlib.resources.files` işlevi eklendi. (Jason R. Coombs'un :issue:`39791` 'deki katkılarıyla.)

source: Refreshed ``importlib.metadata`` from ``importlib_metadata`` version 1.6.1.
tr: ``importlib_metadata`` sürüm 1.6.1'den ``importlib.metadata`` yenilendi.

source: :attr:`inspect.BoundArguments.arguments` is changed from ``OrderedDict`` to regular dict. (Contributed by Inada Naoki in :issue:`36350` and :issue:`39775`.)
tr: :attr:`inspect.BoundArguments.arguments`, ``OrderedDict`` yerine normal dict olarak değiştirildi. ( :issue:`36350` ve :issue:`39775` içinde Inada Naoki tarafından katılmıştır.)

source: :mod:`ipaddress` now supports IPv6 Scoped Addresses (IPv6 address with suffix ``%<scope_id>``).
tr: :mod:`ipadresi` artık IPv6 Kapsamlı Adresleri (``%<scope_id>`` sonekine sahip IPv6 adresi) desteklemektedir.

source: Scoped IPv6 addresses can be parsed using :class:`ipaddress.IPv6Address`. If present, scope zone ID is available through the :attr:`~ipaddress.IPv6Address.scope_id` attribute. (Contributed by Oleksandr Pavliuk in :issue:`34788`.)
tr: Kapsamlı IPv6 adresleri :class:`ipaddress.IPv6Address` kullanılarak ayrıştırılabilir. Varsa, kapsam bölgesi kimliği :attr:`~ipaddress.IPv6Address.scope_id` özelliği aracılığıyla kullanılabilir. (Oleksandr Pavliuk tarafından :issue:`34788` 'de katılmıştır.)

source: Starting with Python 3.9.5 the :mod:`ipaddress` module no longer accepts any leading zeros in IPv4 address strings. (Contributed by Christian Heimes in :issue:`36384`).
tr: Python 3.9.5'ten itibaren :mod:`ipaddress` modülü artık IPv4 adres dizelerinde baştaki sıfırları kabul etmemektedir. ( :issue:`36384` içinde Christian Heimes tarafından katılmıştır).

source: Expanded the :func:`math.gcd` function to handle multiple arguments. Formerly, it only supported two arguments. (Contributed by Serhiy Storchaka in :issue:`39648`.)
tr: Birden çok argümanı işlemek için :func:`math.gcd` işlevi genişletildi. Önceden, yalnızca iki argümanı destekliyordu. ( :issue:`39648` içinde Serhiy Storchaka tarafından katılmıştır.)

source: Added :func:`math.lcm`: return the least common multiple of specified arguments. (Contributed by Mark Dickinson, Ananthakrishnan and Serhiy Storchaka in :issue:`39479` and :issue:`39648`.)
tr: :func:`math.lcm` eklendi: belirtilen bağımsız değişkenlerin en küçük ortak katını döndürür. ( :issue:`39479` ve :issue:`39648` 'de Mark Dickinson, Ananthakrishnan ve Serhiy Storchaka'nın katkılarıyla.)

source: Added :func:`math.nextafter`: return the next floating-point value after *x* towards *y*. (Contributed by Victor Stinner in :issue:`39288`.)
tr: Eklenen :func:`math.nextafter`: *x*'ten sonra *y*'ye doğru bir sonraki kayan nokta değerini döndürür. (Victor Stinner tarafından :issue:`39288` 'de katılmıştır.)

source: Added :func:`math.ulp`: return the value of the least significant bit of a float. (Contributed by Victor Stinner in :issue:`39310`.)
tr: Eklenen :func:`math.ulp`: bir kayan noktanın en önemsiz bitinin değerini döndürür. (Victor Stinner tarafından :issue:`39310` 'da katılmıştır.)

source: The :class:`multiprocessing.SimpleQueue` class has a new :meth:`~multiprocessing.SimpleQueue.close` method to explicitly close the queue. (Contributed by Victor Stinner in :issue:`30966`.)
tr: :class:`multiprocessing.SimpleQueue` sınıfı, kuyruğu açıkça kapatmak için yeni bir :meth:`~multiprocessing.SimpleQueue.close` yöntemine sahiptir. (Victor Stinner tarafından :issue:`30966` 'da katılmıştır.)

source: :class:`~nntplib.NNTP` and :class:`~nntplib.NNTP_SSL` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Dong-hee Na in :issue:`39259`.)
tr: :class:`~nntplib.NNTP` ve :class:`~nntplib.NNTP_SSL` artık bir :class:`ValueError` oluşturucuları için verilen zaman aşımı sıfır ise bloke olmayan bir yuvanın oluşturulmasını engelliyor. (Dong-hee Na tarafından :issue:`39259` 'da katılmıştır.)

source: Added :data:`~os.CLD_KILLED` and :data:`~os.CLD_STOPPED` for :attr:`si_code`. (Contributed by Dong-hee Na in :issue:`38493`.)
tr: :data:`~os.CLD_KILLED` ve :attr:`si_code` için :data:`~os.CLD_STOPPED` eklendi. (Dong-hee Na tarafından :issue:`38493` 'de katılmıştır.)

source: Exposed the Linux-specific :func:`os.pidfd_open` (:issue:`38692`) and :data:`os.P_PIDFD` (:issue:`38713`) for process management with file descriptors.
tr: Dosya tanımlayıcılarla süreç yönetimi için Linux'a özgü :func:`os.pidfd_open` (:issue:`38692`) ve :data:`os.P_PIDFD` (:issue:`38713`) kullanıma sunuldu.

source: The :func:`os.unsetenv` function is now also available on Windows. (Contributed by Victor Stinner in :issue:`39413`.)
tr: :func:`os.unsetenv` işlevi artık Windows'ta da mevcuttur. (Victor Stinner tarafından :issue:`39413` 'de katılmıştır.)

source: The :func:`os.putenv` and :func:`os.unsetenv` functions are now always available. (Contributed by Victor Stinner in :issue:`39395`.)
tr: :func:`os.putenv` ve :func:`os.unsetenv` fonksiyonları artık her zaman kullanılabilir. (Victor Stinner tarafından :issue:`39395` 'de katılmıştır.)

source: Added :func:`os.waitstatus_to_exitcode` function: convert a wait status to an exit code. (Contributed by Victor Stinner in :issue:`40094`.)
tr: :func:`os.waitstatus_to_exitcode` fonksiyonu eklendi: bekleme durumunu çıkış koduna dönüştürün. (Victor Stinner tarafından :issue:`40094` 'de katılmıştır.)

source: Added :meth:`pathlib.Path.readlink()` which acts similarly to :func:`os.readlink`. (Contributed by Girts Folkmanis in :issue:`30618`)
tr: :func:`os.readlink` 'e benzer şekilde davranan :meth:`pathlib.Path.readlink()` eklendi. (Girts Folkmanis'in katkılarıyla :issue:`30618`)

source: On Windows now :class:`~pdb.Pdb` supports ``~/.pdbrc``. (Contributed by Tim Hopper and Dan Lidral-Porter in :issue:`20523`.)
tr: Artık Windows'ta :class:`~pdb.Pdb` ``~/.pdbrc`` desteklemektedir. ( :issue:`20523` içinde Tim Hopper ve Dan Lidral-Porter tarafından katılmıştır.)

source: :class:`~poplib.POP3` and :class:`~poplib.POP3_SSL` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Dong-hee Na in :issue:`39259`.)
tr: :class:`~poplib.POP3` ve :class:`~poplib.POP3_SSL` artık bir :class:`ValueError` oluşturucuları için verilen zaman aşımı sıfır ise bloke olmayan bir yuva oluşturulmasını engelliyor. (Dong-hee Na tarafından :issue:`39259` 'da katılmıştır.)

source: :mod:`pprint` can now pretty-print :class:`types.SimpleNamespace`. (Contributed by Carl Bordum Hansen in :issue:`37376`.)
tr: :mod:`pprint` artık :class:`types.SimpleNamespace` güzel yazdırabilir. (Carl Bordum Hansen tarafından :issue:`37376` 'da katılmıştır.)

source: The documentation string is now shown not only for class, function, method etc, but for any object that has its own ``__doc__`` attribute. (Contributed by Serhiy Storchaka in :issue:`40257`.)
tr: Dokümantasyon dizesi artık yalnızca sınıf, fonksiyon, metot vb. için değil, kendi ``__doc__`` özniteliğine sahip herhangi bir nesne için gösteriliyor. ( :issue:`40257` içinde Serhiy Storchaka tarafından katılmıştır.)

source: Added a new :attr:`random.Random.randbytes` method: generate random bytes. (Contributed by Victor Stinner in :issue:`40286`.)
tr: Yeni bir :attr:`random.Random.randbytes` yöntemi eklendi: rastgele baytlar oluştur. (Victor Stinner tarafından :issue:`40286` 'da katılmıştır.)

source: Exposed the Linux-specific :func:`signal.pidfd_send_signal` for sending to signals to a process using a file descriptor instead of a pid. (:issue:`38712`)
tr: Bir pid yerine bir dosya tanımlayıcı kullanarak bir işleme sinyal göndermek için Linux'a özgü :func:`signal.pidfd_send_signal` ortaya çıktı. (:issue:`38712`)

source: :class:`~smtplib.SMTP` and :class:`~smtplib.SMTP_SSL` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Dong-hee Na in :issue:`39259`.)
tr: :class:`~smtplib.SMTP` ve :class:`~smtplib.SMTP_SSL` artık bir :class:`ValueError` oluşturucuları için verilen zaman aşımı sıfır ise bloke olmayan bir soketin oluşturulmasını engelliyor. (Dong-hee Na tarafından :issue:`39259` 'da katılmıştır.)

source: :class:`~smtplib.LMTP` constructor now has an optional *timeout* parameter. (Contributed by Dong-hee Na in :issue:`39329`.)
tr: :class:`~smtplib.LMTP` yapıcısının artık isteğe bağlı bir *timeout* parametresi var. (Dong-hee Na tarafından :issue:`39329` 'da katılmıştır.)

source: The :mod:`socket` module now exports the :data:`~socket.CAN_RAW_JOIN_FILTERS` constant on Linux 4.1 and greater. (Contributed by Stefan Tatschner and Zackery Spytz in :issue:`25780`.)
tr: :mod:`socket` modülü artık Linux 4.1 ve üzeri sürümlerde :data:`~socket.CAN_RAW_JOIN_FILTERS` sabitini dışa aktarıyor. (Stefan Tatschner ve Zackery Spytz tarafından :issue:`25780` 'de katılmıştır.)

source: The socket module now supports the :data:`~socket.CAN_J1939` protocol on platforms that support it. (Contributed by Karl Ding in :issue:`40291`.)
tr: Soket modülü artık onu destekleyen platformlarda :data:`~socket.CAN_J1939` protokolünü desteklemektedir. (Karl Ding tarafından :issue:`40291` 'de katılmıştır.)

source: The socket module now has the :func:`socket.send_fds` and :func:`socket.recv_fds` functions. (Contributed by Joannah Nanjekye, Shinya Okano and Victor Stinner in :issue:`28724`.)
tr: Soket modülü artık :func:`socket.send_fds` ve :func:`socket.recv_fds` fonksiyonlarına sahiptir. (Joannah Nanjekye, Shinya Okano ve Victor Stinner'ın katkılarıyla :issue:`28724`.)

source: On AIX, :func:`~time.thread_time` is now implemented with ``thread_cputime()`` which has nanosecond resolution, rather than ``clock_gettime(CLOCK_THREAD_CPUTIME_ID)`` which has a resolution of 10 milliseconds. (Contributed by Batuhan Taskaya in :issue:`40192`)
tr: AIX üzerinde :func:`~time.thread_time` artık 10 milisaniye çözünürlüğe sahip ``clock_gettime(CLOCK_THREAD_CPUTIME_ID)`` yerine nanosaniye çözünürlüğe sahip ``thread_cputime()`` ile uygulanmaktadır. (Batuhan Taşkaya :issue:`40192` 'de katılmıştır)
