Repository: python/python-docs-tr
Catalog: tutorial/appendix.po
Languages: tr

source: Appendix
tr: Ek Bölüm

source: Interactive Mode
tr: Etkileşimli Mod

source: Error Handling
tr: Hata İşleme

source: When an error occurs, the interpreter prints an error message and a stack trace. In interactive mode, it then returns to the primary prompt; when input came from a file, it exits with a nonzero exit status after printing the stack trace. (Exceptions handled by an :keyword:`except` clause in a :keyword:`try` statement are not errors in this context.) Some errors are unconditionally fatal and cause an exit with a nonzero exit; this applies to internal inconsistencies and some cases of running out of memory. All error messages are written to the standard error stream; normal output from executed commands is written to standard output.
tr: Bir hata oluştuğunda, yorumlayıcı bir hata iletisi ve yığın izlemesi yazdırır. Etkileşimli modda, daha sonra birincil istemi döndürür; bir dosyadan veri giriş gercekleştiğinde, yığın izlemeyi yazdırdıktan sonra sıfır olmayan bir çıkış koduyla çıkar. (:keyword:`try` deyimindeki :keyword:`except` yan tümcesi tarafından işlenen özel durumlar bu bağlamda hata değildir.) Bazı hatalar koşulsuz olarak ölümcüldür ve sıfır olmayan bir çıkış koduyla çıkışa neden olur; bu, iç tutarsızlıklar ve belleğin tükendiğine ilişkin bazı durumlar için geçerlidir. Tüm hata iletileri standart hata akışına yazılır; yürütülen komutlardan normal çıktı standart çıktıya yazılır.

source: Typing the interrupt character (usually :kbd:`Control-C` or :kbd:`Delete`) to the primary or secondary prompt cancels the input and returns to the primary prompt. [#]_ Typing an interrupt while a command is executing raises the :exc:`KeyboardInterrupt` exception, which may be handled by a :keyword:`try` statement.
tr: Yarıda kesme karakterinin (genellikle :kbd:`Control-C` veya :kbd:`Delete`) birincil veya ikincil istemine yazılması girişi iptal eder ve birincil istemi döndürür. [#]_ Bir komut yürütülürken bir yarıda kesme karakteri yazmak :exc:`KeyboardInterrupt` özel durumuna neden olur ve bu özel durum :keyword:`try` deyimi tarafından işlenebilir.

source: Executable Python Scripts
tr: Yürütülebilir Python Komut Dosyaları

source: On BSD'ish Unix systems, Python scripts can be made directly executable, like shell scripts, by putting the line ::
tr: BSD türü Unix sistemlerinde Python komut dosyaları, :: satırı koyarak kabuk komut dosyaları gibi doğrudan yürütülebilir hale getirilebilir:

source: (assuming that the interpreter is on the user's :envvar:`PATH`) at the beginning of the script and giving the file an executable mode. The ``#!`` must be the first two characters of the file. On some platforms, this first line must end with a Unix-style line ending (``'\n'``), not a Windows (``'\r\n'``) line ending. Note that the hash, or pound, character, ``'#'``, is used to start a comment in Python.
tr: (yorumlayıcının kullanıcının :envvar:`PATH`) komut dosyasının başında olduğunu ve dosyaya yürütülebilir bir mod verdiğini varsayarsak. ``#!`` dosyanın ilk iki karakteri olmalıdır. Bazı platformlarda, bu ilk satırın Windows (``'\r\n'``) satır sonuyla değil, Unix stili bir satır sonuyla (``\n'``) bitmesi gerekir. Python'da yorum başlatmak için karma veya pound karakteri olan ``'#'`` kullanıldığını unutmayın.

source: The script can be given an executable mode, or permission, using the :program:`chmod` command.
tr: Komut dosyasına :program:`chmod` komutu kullanılarak yürütülebilir mod veya izin verilebilir.

source: On Windows systems, there is no notion of an "executable mode". The Python installer automatically associates ``.py`` files with ``python.exe`` so that a double-click on a Python file will run it as a script. The extension can also be ``.pyw``, in that case, the console window that normally appears is suppressed.
tr: Windows sistemlerinde, "yürütülebilir mod" kavramı yoktur. Python yükleyicisi otomatik olarak ``.py`` dosyalarını ``python.exe`` ile ilişkilendirir, böylece python dosyasına çift tıklama komut dosyası olarak çalıştırılır. Uzantı ``.pyw`` 'de olabilir, bu durumda normalde görünen konsol penceresi bastırılır.

source: The Interactive Startup File
tr: Etkileşimli Başlangıç Dosyası

source: When you use Python interactively, it is frequently handy to have some standard commands executed every time the interpreter is started. You can do this by setting an environment variable named :envvar:`PYTHONSTARTUP` to the name of a file containing your start-up commands. This is similar to the :file:`.profile` feature of the Unix shells.
tr: Python'u etkileşimli olarak kullandığınızda, yorumlayıcı her başlatıldığında bazı standart komutların yürütülmesi genellikle kullanışlıdır. Bunu, başlatma komutlarınızı içeren bir dosyanın adına :envvar:`PYTHONSTARTUP` adlı bir ortam değişkeni ayarlayarak yapabilirsiniz. Bu, Unix kabuklarının :file:`.profile` özelliğine benzer.

source: This file is only read in interactive sessions, not when Python reads commands from a script, and not when :file:`/dev/tty` is given as the explicit source of commands (which otherwise behaves like an interactive session). It is executed in the same namespace where interactive commands are executed, so that objects that it defines or imports can be used without qualification in the interactive session. You can also change the prompts ``sys.ps1`` and ``sys.ps2`` in this file.
tr: Bu dosya Python komutları bir komut dosyasından okuduğunda değil, yalnızca etkileşimli oturumlarda okunur. Python komutları bir komut dosyasından okuduğunda, :file:`/dev/tty` komutların açık kaynağı olarak verildiğinde değil (aksi takdirde etkileşimli bir oturum gibi davranır). Etkileşimli komutların yürütüldüğü aynı ad alanında yürütülür, böylece tanımladığı veya aldığı nesneler etkileşimli oturumda nitelik olmadan kullanılabilir. Bu dosyadaki ``sys.ps1`` ve ``sys.ps2`` istemlerini de değiştirebilirsiniz.

source: If you want to read an additional start-up file from the current directory, you can program this in the global start-up file using code like ``if os.path.isfile('.pythonrc.py'): exec(open('.pythonrc.py').read())``. If you want to use the startup file in a script, you must do this explicitly in the script::
tr: Geçerli dizinden ek bir başlangıç dosyası okumak istiyorsanız, bunu genel başlangıç dosyasında ``if os.path.isfile('.pythonrc.py'): exec(open('.pythonrc.py').read()`` gibi bir kod kullanarak programlayabilirsiniz. Başlangıç dosyasını bir komut dosyasında kullanmak istiyorsanız, bunu komut dosyasında açıkça yapmalısınız::

source: The Customization Modules
tr: Özelliştirme Modülleri

source: Python provides two hooks to let you customize it: :mod:`sitecustomize` and :mod:`usercustomize`. To see how it works, you need first to find the location of your user site-packages directory. Start Python and run this code::
tr: Python özelleştirmenize izin vermek için iki kanca sağlar: :mod:`sitecustomize` ve :mod:`usercustomize`. Nasıl çalıştığını görmek için önce kullanıcı sitesi paketleri dizininizin konumunu bulmanız gerekir. Python'ı başlatın ve şu kodu çalıştırın::

source: Now you can create a file named :file:`usercustomize.py` in that directory and put anything you want in it. It will affect every invocation of Python, unless it is started with the :option:`-s` option to disable the automatic import.
tr: Artık bu dizinde :file:`usercustomize.py` adlı bir dosya oluşturabilir ve içine istediğiniz her şeyi koyabilirsiniz. Otomatik içe aktarmayı devre dışı bırakmak için :option:`-s` seçeneğiyle başlatılmadıkça Python'un her çağrısını etkiler.

source: :mod:`sitecustomize` works in the same way, but is typically created by an administrator of the computer in the global site-packages directory, and is imported before :mod:`usercustomize`. See the documentation of the :mod:`site` module for more details.
tr: :mod:`sitecustomize` aynı şekilde çalışır, ancak genellikle genel site paketleri dizinindeki bilgisayarın yöneticisi tarafından oluşturulur ve :mod:`usercustomize` 'dan önce alınır. Daha fazla ayrıntı için :mod:`site` modülünün belgelerine bakın.

source: Footnotes
tr: Dipnotlar

source: A problem with the GNU Readline package may prevent this.
tr: GNU Readline paketiyle ilgili bir sorun bunu engelleyebilir.
