Repository: python/python-docs-tr
Catalog: tutorial/appetite.po
Languages: tr

source: Whetting Your Appetite
tr: İştahınızı Kabartma

source: If you do much work on computers, eventually you find that there's some task you'd like to automate. For example, you may wish to perform a search-and-replace over a large number of text files, or rename and rearrange a bunch of photo files in a complicated way. Perhaps you'd like to write a small custom database, or a specialized GUI application, or a simple game.
tr: Bilgisayarlarda çok fazla iş yaparsanız, sonunda otomatikleştirmek istediğiniz bazı görevler olduğunu bulursunuz. Örneğin, çok sayıda metin dosyası üzerinde arama ve değiştirme gerçekleştirmek veya bir grup fotoğraf dosyasını karmaşık bir şekilde yeniden adlandırmak ve yeniden düzenlemek isteyebilirsiniz. Belki küçük bir özel veritabanı, özel bir GUI uygulaması veya basit bir oyun yazmak istersiniz.

source: If you're a professional software developer, you may have to work with several C/C++/Java libraries but find the usual write/compile/test/re-compile cycle is too slow. Perhaps you're writing a test suite for such a library and find writing the testing code a tedious task. Or maybe you've written a program that could use an extension language, and you don't want to design and implement a whole new language for your application.
tr: Profesyonel bir yazılım geliştiricisiyseniz, birçok C/C++/Java kütüphanesiyle çalışmanız gerekebilir, ancak normal yazma/derleme/test etme/yeniden derleme döngüsünü çok yavaş buluyorsunuz. Belki de böyle bir kütüphane için bir test paketi yazıyorsunuz ve test kodunu yazmayı sıkıcı bir görev olarak buluyorsunuz. Veya eklenti dili kullanabilecek bir program yazdınız ve uygulamanız için yepyeni bir dil tasarlamak ve uygulamak istemiyorsunuz.

source: Python is just the language for you.
tr: Python tam size göre bir dil.

source: You could write a Unix shell script or Windows batch files for some of these tasks, but shell scripts are best at moving around files and changing text data, not well-suited for GUI applications or games. You could write a C/C++/Java program, but it can take a lot of development time to get even a first-draft program. Python is simpler to use, available on Windows, macOS, and Unix operating systems, and will help you get the job done more quickly.
tr: Bu görevlerden bazıları için bir Unix kabuk komut dosyası veya Windows toplu iş dosyaları yazabilirsiniz, ancak kabuk komut dosyaları, dosyaların etrafında hareket etmek ve metin verilerini değiştirmekte en iyisi olmakla beraber GUI uygulamaları veya oyun yapımı için pek öyle olmayabilir. Bir C/C++/Java programı yazabilirsiniz, ancak taslak programını almak bile çok zaman alabilir. Python'un kullanımı daha kolaydır, Windows, macOS ve Unix işletim sistemlerinde kullanılabilir ve işi daha hızlı bir şekilde halletmenize yardımcı olur.

source: Python is simple to use, but it is a real programming language, offering much more structure and support for large programs than shell scripts or batch files can offer. On the other hand, Python also offers much more error checking than C, and, being a *very-high-level language*, it has high-level data types built in, such as flexible arrays and dictionaries. Because of its more general data types Python is applicable to a much larger problem domain than Awk or even Perl, yet many things are at least as easy in Python as in those languages.
tr: Python kolay olmakla birlikte, kabuk komut dosyalarının veya toplu iş dosyalarının sunabileceğinden çok daha fazla yapı ve büyük programlar için destek sunan gerçek bir programlama dilidir. Öte yandan, Python C'den çok daha fazla hata denetimi sunar ve *çok üst düzey bir dil (very-high-level language)* olarak, esnek diziler ve sözlükler gibi yerleşik üst düzey veri türlerine sahiptir. Python daha genel veri türleri nedeniyle, Awk ve hatta Perl'den çok daha büyük bir kullanım alanına uygulanabilir, ancak Python'da birçok şey en az bu dillerdeki kadar kolaydır.

source: Python allows you to split your program into modules that can be reused in other Python programs. It comes with a large collection of standard modules that you can use as the basis of your programs --- or as examples to start learning to program in Python. Some of these modules provide things like file I/O, system calls, sockets, and even interfaces to graphical user interface toolkits like Tk.
tr: Python, programınızı diğer Python programlarında yeniden kullanılabilecek modüllere bölmenizi sağlar. Python, programlayı öğrenmeye başlarken veya programlarınızda temel olarak kullanabileceğiniz geniş bir standart modül koleksiyonuyla birlikte gelir. Bu modüllerden bazıları dosya giriş/çıkışı (I/O), sistem çağrıları, soketler ve hatta Tk gibi GUI araç setlerini içerir.

source: Python is an interpreted language, which can save you considerable time during program development because no compilation and linking is necessary. The interpreter can be used interactively, which makes it easy to experiment with features of the language, to write throw-away programs, or to test functions during bottom-up program development. It is also a handy desk calculator.
tr: Python, derleme ve bağlama gerekmediğinden program geliştirme sırasında size önemli ölçüde zaman kazandırabilecek yorumlanmış bir dildir. Yorumlayıcı etkileşimli olarak kullanılabilir, bu da dilin özellikleriyle deneme yapmayı, atma programları yazmayı veya aşağıdan yukarıya program geliştirme sırasında işlevleri test etmeyi kolaylaştırır. Ayrıca kullanışlı bir masa üstühesap makinesidir.

source: Python enables programs to be written compactly and readably. Programs written in Python are typically much shorter than equivalent C, C++, or Java programs, for several reasons:
tr: Python, programların kompakt ve okunabilir bir şekilde yazılmasını sağlar. Python'da yazılan programlar genellikle çeşitli nedenlerden dolayı aynı görevi gören C, C++ veya Java programlarına göre çok daha kısadır:

source: the high-level data types allow you to express complex operations in a single statement;
tr: üst düzey veri türleri karmaşık işlemleri tek bir deyimde ifade etmenizi sağlar;

source: statement grouping is done by indentation instead of beginning and ending brackets;
tr: ifade gruplandırması, başlangıç ve bitişe koyulan köşeli ayraçlar yerine girintileme kullanılarak yapılır;

source: no variable or argument declarations are necessary.
tr: değişken veya bağımsız değişken bildirimleri gerekli değildir.

source: Python is *extensible*: if you know how to program in C it is easy to add a new built-in function or module to the interpreter, either to perform critical operations at maximum speed, or to link Python programs to libraries that may only be available in binary form (such as a vendor-specific graphics library). Once you are really hooked, you can link the Python interpreter into an application written in C and use it as an extension or command language for that application.
tr: Python *genişletilebilir*: C'de programlamayı biliyorsanız, kritik işlemleri maksimum hızda gerçekleştirmek veya Python programlarını yalnızca ikili biçimde (satıcıya özgü grafik kitaplığı gibi) kullanılabilen kütüphanelere bağlamak için yorumlayıcıya yeni bir yerleşik işlev veya modül eklemek kolaydır. Gerçekten bağlandıktan sonra, Python yorumlayıcısını C ile yazılmış bir uygulamaya bağlayabilir ve bu uygulama için bir uzantı veya komut dili olarak kullanabilirsiniz.

source: By the way, the language is named after the BBC show "Monty Python's Flying Circus" and has nothing to do with reptiles. Making references to Monty Python skits in documentation is not only allowed, it is encouraged!
tr: Bu arada, dil adını BBC şovu "Monty Python'un Uçan Sirki"nden almıştır ve sürüngenlerle hiçbir ilgisi yoktur. Belgelerde Monty Python skeçlerine atıfta bulunmaya sadece izin verilmez, aynı zamanda teşvik edilir!

source: Now that you are all excited about Python, you'll want to examine it in some more detail. Since the best way to learn a language is to use it, the tutorial invites you to play with the Python interpreter as you read.
tr: Artık hepiniz Python için heyecanlı olduğunuza göre, biraz daha ayrıntılı olarak incelemek isteyeceksiniz. Bir dili öğrenmenin en iyi yolu kullanmak olduğundan, öğretici sizi okurken Python yorumlayıcısıyla oynamaya davet eder.

source: In the next chapter, the mechanics of using the interpreter are explained. This is rather mundane information, but essential for trying out the examples shown later.
tr: Bir sonraki bölümde, yorumlayıcıyı kullanma mekaniği açıklanmıştır. Bu oldukça sıradan bir bilgidir, ancak daha sonra gösterilen örnekleri denemek için gereklidir.

source: The rest of the tutorial introduces various features of the Python language and system through examples, beginning with simple expressions, statements and data types, through functions and modules, and finally touching upon advanced concepts like exceptions and user-defined classes.
tr: Öğreticinin geri kalanı, basit ifadeler, ifadeler ve veri türlerinden başlayarak, işlevler ve modüller aracılığıyla ve son olarak istisnalar ve kullanıcı tanımlı sınıflar gibi gelişmiş kavramlara dokunarak örnekler aracılığıyla Python dilinin ve sisteminin çeşitli özelliklerini tanıtır.
