Repository: python/python-docs-tr
Catalog: tutorial/classes.po
Languages: tr

source: Class *instantiation* uses function notation. Just pretend that the class object is a parameterless function that returns a new instance of the class. For example (assuming the above class)::
tr: Sınıf *örnekleme* fonksiyon notasyonunu kullanır. Sınıf nesnesinin, sınıfın yeni bir örneğini döndüren parametresiz bir fonksiyon olduğunu varsayın. Örneğin (yukarıdaki sınıfı varsayarsak)::

source: creates a new *instance* of the class and assigns this object to the local variable ``x``.
tr: sınıfın yeni bir *örnek* öğesini oluşturur ve bu nesneyi ``x`` yerel değişkenine atar.

source: The instantiation operation ("calling" a class object) creates an empty object. Many classes like to create objects with instances customized to a specific initial state. Therefore a class may define a special method named :meth:`__init__`, like this::
tr: Örnekleme işlemi ("sınıf nesnesi çağırma") boş bir nesne oluşturur. Birçok sınıf, belirli bir başlangıç durumuna göre özelleştirilmiş örneklerle nesneler oluşturmayı sever. Bu nedenle bir sınıf, :meth:`__init__` adlı özel bir metot tanımlayabilir:

source: When a class defines an :meth:`__init__` method, class instantiation automatically invokes :meth:`__init__` for the newly created class instance. So in this example, a new, initialized instance can be obtained by::
tr: Bir sınıf bir :meth:`__init__` metodunu tanımladığında, örnekleme işlemi yeni oluşturulan sınıf örneği için otomatik olarak :meth:`__init__` öğesini çağırır. Bu örnekte, yeni başlatılmış bir örnek şu şekilde elde edilebilir::

source: Of course, the :meth:`__init__` method may have arguments for greater flexibility. In that case, arguments given to the class instantiation operator are passed on to :meth:`__init__`. For example, ::
tr: Tabii ki, :meth:`__init__` yöntemi daha fazla esneklik için argümanlara sahip olabilir. Bu durumda, sınıf örnekleme işlecine verilen bağımsız değişkenler :meth:`__init__` için aktarılır. Mesela::

source: Instance Objects
tr: Örnek Nesneleri

source: Now what can we do with instance objects? The only operations understood by instance objects are attribute references. There are two kinds of valid attribute names: data attributes and methods.
tr: Şimdi örnek nesnelerle ne yapabiliriz? Örnek nesneleri tarafından anlaşılan tek işlemler nitelik başvurularıdır. İki tür geçerli öznitelik adı vardır: veri nitelikleri ve metotları.

source: *data attributes* correspond to "instance variables" in Smalltalk, and to "data members" in C++. Data attributes need not be declared; like local variables, they spring into existence when they are first assigned to. For example, if ``x`` is the instance of :class:`MyClass` created above, the following piece of code will print the value ``16``, without leaving a trace::
tr: *veri nitelikleri*, Smalltalk'taki "örnek değişkenlerine" ve C++'taki "veri üyelerine" karşılık gelir. Veri niteliklerinin önceden tanımlanması gerekmez; yerel değişkenler gibi, ilk değer atandığı anda varlıkları başlar. Örneğin, ``x`` yukarıda oluşturulan :class:`MyClass` örneğiyse, aşağıdaki kod parçası iz bırakmadan ``16`` değerini yazdırır::

source: The other kind of instance attribute reference is a *method*. A method is a function that "belongs to" an object. (In Python, the term method is not unique to class instances: other object types can have methods as well. For example, list objects have methods called append, insert, remove, sort, and so on. However, in the following discussion, we'll use the term method exclusively to mean methods of class instance objects, unless explicitly stated otherwise.)
tr: Diğer örnek nitelik başvurusu türü bir *metot*. Metot, bir nesneye "ait" olan bir fonksiyondur. (Python'da, terim metodu sınıf örneklerine özgü değildir: diğer nesne türlerinin de metotları olabilir. Örneğin, liste nesnelerini genişletme, ekleme, kaldırma, sıralama vb. Ancak, aşağıdaki tartışmada, aksi açıkça belirtilmedikçe, yalnızca sınıf örneği nesnelerinin metotlarını ifade etmek için terim metodunu kullanacağız.)

source: Valid method names of an instance object depend on its class. By definition, all attributes of a class that are function objects define corresponding methods of its instances. So in our example, ``x.f`` is a valid method reference, since ``MyClass.f`` is a function, but ``x.i`` is not, since ``MyClass.i`` is not. But ``x.f`` is not the same thing as ``MyClass.f`` --- it is a *method object*, not a function object.
tr: Örnek nesnesinin geçerli metot adları nesnenin sınıfına bağlıdır. Fonksiyon nesneleri olan bir sınıfın tüm nitelikleri, örneklerinin karşılık gelen fonksiyonlarını tanımlar. Bu nedenle, örneğimizde, ``x.f`` geçerli bir metot referansıdır, ne de olsa ``MyClass.f`` bir fonksiyondur ancak ``MyClass.i`` fonksiyon olmadığından ``x.i`` değildir. Ancak ``x.f``, ``MyClass.f`` ile aynı şey değildir çünkü bir fonksiyon nesnesi değil, *metot nesnesi* 'dir.

source: Method Objects
tr: Metot Nesneleri

source: Usually, a method is called right after it is bound::
tr: Genellikle, bir metot bağlandıktan hemen sonra çağrılır::

source: In the :class:`MyClass` example, this will return the string ``'hello world'``. However, it is not necessary to call a method right away: ``x.f`` is a method object, and can be stored away and called at a later time. For example::
tr: :class:`MyClass` örneğinde, ``hello world`` string'ini döndürür. Lakin, hemen bir metot çağırmak gerekli değildir: ``x.f`` bir metot nesnesidir, yani daha sonra depolanabilir ve çağrılabilir. Mesela::

source: will continue to print ``hello world`` until the end of time.
tr: daima ``hello world`` yazdırmaya devam edecek.

source: What exactly happens when a method is called? You may have noticed that ``x.f()`` was called without an argument above, even though the function definition for :meth:`f` specified an argument. What happened to the argument? Surely Python raises an exception when a function that requires an argument is called without any --- even if the argument isn't actually used...
tr: Bir yöntem çağrıldığında tam olarak ne gerçekleşir? :meth:`f` fonksiyon tanımı bir argüman belirtmiş olsa da, ``x.f()`` öğesinin yukarıda bir argüman olmadan çağrıldığını fark etmiş olabilirsiniz. Peki argümana ne oldu? Elbette Python, argüman gerektiren bir fonksiyon, argüman verilmemiş iken çağırılırsa --- fonksiyon aslında kullanılmasa bile hata verir...

source: Actually, you may have guessed the answer: the special thing about methods is that the instance object is passed as the first argument of the function. In our example, the call ``x.f()`` is exactly equivalent to ``MyClass.f(x)``. In general, calling a method with a list of *n* arguments is equivalent to calling the corresponding function with an argument list that is created by inserting the method's instance object before the first argument.
tr: Aslında, cevabı tahmin etmiş olabilirsiniz: yöntemlerle ilgili özel şey, örnek nesnesinin fonksiyonun ilk argüman olarak geçirilmesidir. Örneğimizde, ``x.f()`` çağrısı tam olarak ``MyClass.f(x)`` ile eş değerdir. Genel olarak, *n* tane argümana sahip bir metodu çağırmak, ilk argümandan önce metodun örnek nesnesi eklenerek oluşturulan bir argüman listesiyle karşılık gelen fonksiyonu çağırmaya eş değerdir.

source: If you still don't understand how methods work, a look at the implementation can perhaps clarify matters. When a non-data attribute of an instance is referenced, the instance's class is searched. If the name denotes a valid class attribute that is a function object, a method object is created by packing (pointers to) the instance object and the function object just found together in an abstract object: this is the method object. When the method object is called with an argument list, a new argument list is constructed from the instance object and the argument list, and the function object is called with this new argument list.
tr: Metotların nasıl çalıştığını hala anlamıyorsanız, nasıl uygulandığına bakmak belki de sorunları açıklığa kavuşturabilir. Bir örneğin, veri olmayan bir niteliğine başvurulduğu zaman bu örneğin ait olduğu sınıfa bakılır. Ad bir fonksiyon nesnesi olan geçerli bir sınıf özniteliğini gösterirse, örnek nesne ve fonksiyon nesnesi soyut bir nesnede paketlenerek (işaretçiler) bir metot nesnesi oluşturulur. İşte bu metot nesnesidir. Metot nesnesi bir argüman listesiyle çağrıldığında, örnek nesneden ve argüman listesinden yeni bir argüman listesi oluşturulur ve fonksiyon nesnesi bu yeni argüman listesiyle çağrılır.

source: Class and Instance Variables
tr: Sınıf ve Örnek Değişkenleri

source: Generally speaking, instance variables are for data unique to each instance and class variables are for attributes and methods shared by all instances of the class::
tr: Genel olarak, örnek değişkenleri o örneğe özgü veriler içindir ve sınıf değişkenleri sınıfın tüm örnekleri tarafından paylaşılan nitelikler ile metotlar içindir::

source: As discussed in :ref:`tut-object`, shared data can have possibly surprising effects with involving :term:`mutable` objects such as lists and dictionaries. For example, the *tricks* list in the following code should not be used as a class variable because just a single list would be shared by all *Dog* instances::
tr: :ref:`tut-object` 'te anlatıldığı gibi, paylaşılan veriler listeler ve sözlükler gibi :term:`mutable` nesnelerini içeren şaşırtıcı etkilere sahip olabilir. Örneğin, aşağıdaki koddaki *tricks* listesi sınıf değişkeni olarak kullanılmamalıdır, çünkü yalnızca tek bir liste tüm *Dog* örnekleri tarafından paylaşılacaktır::

source: Correct design of the class should use an instance variable instead::
tr: Doğru olan ise veriyi paylaşmak yerine bir örnek değişkeni kullanmaktır:

source: Random Remarks
tr: Rastgele Açıklamalar

source: If the same attribute name occurs in both an instance and in a class, then attribute lookup prioritizes the instance::
tr: Aynı nitelik adı hem bir örnekte hem de bir sınıfta oluşuyorsa, nitelik araması örneğe öncelik verir::

source: Data attributes may be referenced by methods as well as by ordinary users ("clients") of an object. In other words, classes are not usable to implement pure abstract data types. In fact, nothing in Python makes it possible to enforce data hiding --- it is all based upon convention. (On the other hand, the Python implementation, written in C, can completely hide implementation details and control access to an object if necessary; this can be used by extensions to Python written in C.)
tr: Veri niteliklerine metotların yanı sıra bir nesnenin sıradan kullanıcıları ("istemciler") tarafından başvurulabilir. Başka bir deyişle, sınıflar saf soyut veri türlerini uygulamak için kullanılamaz. Aslında, Python'daki hiçbir şey, veri gizlemeyi zorlamaz. Bu durum geleneksel kullanımından dolayı bu şekildedir. (Öte yandan, C ile yazılan Python uygulamaları, uygulama ayrıntılarını tamamen gizleyebilir ve gerekirse bir nesneye erişimi kontrol edebilir; bu, C ile yazılmış Python uzantıları tarafından kullanılabilir.)

source: Clients should use data attributes with care --- clients may mess up invariants maintained by the methods by stamping on their data attributes. Note that clients may add data attributes of their own to an instance object without affecting the validity of the methods, as long as name conflicts are avoided --- again, a naming convention can save a lot of headaches here.
tr: İstemciler veri niteliklerini dikkatle kullanmalıdır --- istemciler veri özniteliklerini damgalayarak yöntemler tarafından tutulan değişmezleri bozabilir. İstemcilerin, metotların geçerliliğini etkilemeden bir örnek nesnesine kendi veri niteliklerini ekleyebileceğini unutmayın. Tabii ki burada da ad çakışmalarından kaçınılmalıdır, adlandırma kuralları ise kaçınmak için oldukça faydalı olabilir.

source: There is no shorthand for referencing data attributes (or other methods!) from within methods. I find that this actually increases the readability of methods: there is no chance of confusing local variables and instance variables when glancing through a method.
tr: Yöntemlerin içinden veri niteliklerine (veya diğer metotlara!) başvurmak için kısa yol yoktur. Bu aslında metotların okunabilirliğini arttırıyor, çünkü bir metoda bakarken yerel değişkenleri ve örnek değişkenlerini karıştırma ihtimali bırakmamış oluyoruz.

source: Often, the first argument of a method is called ``self``. This is nothing more than a convention: the name ``self`` has absolutely no special meaning to Python. Note, however, that by not following the convention your code may be less readable to other Python programmers, and it is also conceivable that a *class browser* program might be written that relies upon such a convention.
tr: Genellikle, bir metodun ilk bağımsız değişkenine ``self`` denir. Bu bir kullanım geleneğinden başka bir şey değildir, yani ``self`` adının Python için kesinlikle özel bir anlamı yoktur. Bununla birlikte, kurala uymadığınızda kodunuzun diğer Python programcıları tarafından daha az okunabilir olabileceğini ve yazılabilecek potansiyel bir *sınıf tarayıcısı* programının bu kurala dayanıyor olabileceğini unutmayın.

source: Any function object that is a class attribute defines a method for instances of that class. It is not necessary that the function definition is textually enclosed in the class definition: assigning a function object to a local variable in the class is also ok. For example::
tr: Sınıf niteliği olan herhangi bir fonksiyon nesnesi, bu sınıfın örnekleri için bir metot tanımlar. Fonksiyon tanımının metinsel olarak sınıf tanımına dahil olması gerekli değildir: sınıftaki yerel bir değişkene fonksiyon nesnesi atamak da uygundur. Mesela::

source: Now ``f``, ``g`` and ``h`` are all attributes of class :class:`C` that refer to function objects, and consequently they are all methods of instances of :class:`C` --- ``h`` being exactly equivalent to ``g``. Note that this practice usually only serves to confuse the reader of a program.
tr: Buradaki ``f``, ``g`` ve ``h`` fonksiyonları nesnelerine başvuran :class:`C` sınıfının bütün nitelikleridir ve sonuç olarak hepsi :class:`C` --- ``h`` sınıfının örneklerinin metotları olarak tümüyle ``g`` 'ye eş değerdir. Bu kullanım şeklinin genellikle yalnızca bir programı okuyan kişinin kafasını karıştırmaya yaradığını unutmayın.

source: Methods may call other methods by using method attributes of the ``self`` argument::
tr: Metotlar, ``self`` bağımsız değişkeninin metot niteliklerini kullanarak diğer metotları çağırabilir::

source: Methods may reference global names in the same way as ordinary functions. The global scope associated with a method is the module containing its definition. (A class is never used as a global scope.) While one rarely encounters a good reason for using global data in a method, there are many legitimate uses of the global scope: for one thing, functions and modules imported into the global scope can be used by methods, as well as functions and classes defined in it. Usually, the class containing the method is itself defined in this global scope, and in the next section we'll find some good reasons why a method would want to reference its own class.
tr: Metotlar, global adlara sıradan işlevler gibi başvuru yapabilir. Bir metotla ilişkili genel kapsam, tanımını içeren modüldür. (Bir sınıf hiçbir zaman genel kapsam olarak kullanılmaz.) Global verileri bir metotta kullanmak için nadiren iyi bir nedenle karşılaşılsa da, genel kapsamın birçok meşru kullanımı vardır: bir kere, genel kapsamlıya içe aktarılan fonksiyon ve modüller, metotlar ve içinde tanımlanan fonksiyonlar ve sınıflar tarafından kullanılabilir. Genellikle, metodu içeren sınıfın kendisi bu genel kapsamda tanımlanır ve sonraki bölümde bir yöntemin kendi sınıfına başvurmak istemesinin bazı iyi nedenlerini bulacağız.

source: Each value is an object, and therefore has a *class* (also called its *type*). It is stored as ``object.__class__``.
tr: Her değer bir nesnedir ve bu nedenle bir *sınıf* (*type* olarak da adlandırılır) bulundurur. ``object.__class__`` olarak depolanır.

source: Inheritance
tr: Kalıtım

source: Of course, a language feature would not be worthy of the name "class" without supporting inheritance. The syntax for a derived class definition looks like this::
tr: Tabii ki, bir dil özelliği kalıtımı desteklemeden "sınıf" adına layık olmaz. Türetilmiş sınıf tanımının söz dizimi şöyle görünür::

source: The name :class:`BaseClassName` must be defined in a scope containing the derived class definition. In place of a base class name, other arbitrary expressions are also allowed. This can be useful, for example, when the base class is defined in another module::
tr: :class:`BaseClassName` adı, türetilmiş sınıf tanımını içeren bir kapsamda tanımlanmalıdır. Temel sınıf adı yerine, diğer rasgele ifadelere de izin verilir. Bu, örneğin, temel sınıf başka bir modülde tanımlandığında yararlı olabilir::

source: Execution of a derived class definition proceeds the same as for a base class. When the class object is constructed, the base class is remembered. This is used for resolving attribute references: if a requested attribute is not found in the class, the search proceeds to look in the base class. This rule is applied recursively if the base class itself is derived from some other class.
tr: Türetilmiş bir sınıf tanımının yürütülmesi, temel sınıfla aynı şekilde devam eder. Sınıf nesnesi inşa edildiğinde, temel sınıf hatırlanır. Bu, nitelik başvurularını çözmek için kullanılır: istenen nitelik sınıfta bulunmazsa, arama temel sınıfa bakmaya devam eder. Temel sınıfın kendisi başka bir sınıftan türetilmişse, bu kural özyinelemeli olarak uygulanır.

source: There's nothing special about instantiation of derived classes: ``DerivedClassName()`` creates a new instance of the class. Method references are resolved as follows: the corresponding class attribute is searched, descending down the chain of base classes if necessary, and the method reference is valid if this yields a function object.
tr: Türetilmiş sınıfların somutlaştırılmasında özel bir şey yoktur: ``DerivedClassName()`` sınıfın yeni bir örneğini oluşturur. Metot başvuruları aşağıdaki gibi çözümlenir: ilgili sınıf niteliği aranır, gerekirse temel sınıflar zincirinin aşağısına inilir ve bu bir fonksiyon nesnesi veriyorsa metot başvurusu geçerlidir.

source: Derived classes may override methods of their base classes. Because methods have no special privileges when calling other methods of the same object, a method of a base class that calls another method defined in the same base class may end up calling a method of a derived class that overrides it. (For C++ programmers: all methods in Python are effectively ``virtual``.)
tr: Türetilmiş sınıflar, temel sınıflarının metotlarını geçersiz kılabilir. Metotlar aynı nesnenin diğer yöntemlerini çağırırken özel ayrıcalıkları olmadığından, aynı temel sınıfta tanımlanan başka bir metodu çağıran bir temel sınıfın metodu, onu geçersiz kılan türetilmiş bir sınıfın metodunu çağırabilir. (C++ programcıları için: Python'daki tüm yöntemler etkili bir şekilde ``sanal``.)

source: An overriding method in a derived class may in fact want to extend rather than simply replace the base class method of the same name. There is a simple way to call the base class method directly: just call ``BaseClassName.methodname(self, arguments)``. This is occasionally useful to clients as well. (Note that this only works if the base class is accessible as ``BaseClassName`` in the global scope.)
tr: Türetilmiş bir sınıfta geçersiz kılma yöntemi aslında yalnızca aynı adlı temel sınıf yöntemini değiştirmek yerine genişletmek isteyebilir. Temel sınıf metodunu doğrudan çağırmanın basit bir yolu vardır: sadece ``BaseClassName.methodname(self, arguments)`` çağırın. Bu bazen müşteriler için de yararlıdır. (Bunun yalnızca temel sınıfa genel kapsamda ``BaseClassName`` olarak erişilebiliyorsa çalıştığını unutmayın.)

source: Python has two built-in functions that work with inheritance:
tr: Python'un kalıtımla çalışan iki yerleşik fonksiyonu vardır:

source: Use :func:`isinstance` to check an instance's type: ``isinstance(obj, int)`` will be ``True`` only if ``obj.__class__`` is :class:`int` or some class derived from :class:`int`.
tr: Bir örneğin türünü denetlemek için :func:`isinstance` kullanın: ``isinstance(obj, int)`` yalnızca ``obj.__class__`` :class:`int` veya :class:`int` sınıfından türetilmiş bir sınıfsa ``True`` olacaktır.

source: Use :func:`issubclass` to check class inheritance: ``issubclass(bool, int)`` is ``True`` since :class:`bool` is a subclass of :class:`int`. However, ``issubclass(float, int)`` is ``False`` since :class:`float` is not a subclass of :class:`int`.
tr: Sınıf kalıtımını denetlemek için :func:`issubclass` kullanın: ``issubclass(bool, int)`` ``True`` 'dur, çünkü :class:`bool` :class:`int` 'in bir alt sınıfıdır. Ancak, ``issubclass(float, int)`` ``False`` olduğundan :class:`float`, :class:`int` alt sınıfı değildir.

source: Multiple Inheritance
tr: Çoklu Kalıtım

source: Python supports a form of multiple inheritance as well. A class definition with multiple base classes looks like this::
tr: Python, çoklu kalıtım biçimini de destekler. Birden çok temel sınıf içeren bir sınıf tanımı şöyle görünür::

source: For most purposes, in the simplest cases, you can think of the search for attributes inherited from a parent class as depth-first, left-to-right, not searching twice in the same class where there is an overlap in the hierarchy. Thus, if an attribute is not found in :class:`DerivedClassName`, it is searched for in :class:`Base1`, then (recursively) in the base classes of :class:`Base1`, and if it was not found there, it was searched for in :class:`Base2`, and so on.
tr: Basitçe, bir üst sınıftan devralınan nitelikleri aramayı, hiyerarşide çakışmanın olduğu aynı sınıfta iki kez arama yapmadan, derinlik öncelikli, soldan sağa olarak düşünebilirsiniz. Bu nedenle, bir nitelik :class:`DerivedClassName` içinde bulunamazsa, :class:`Base1` 'de, sonra (özyinelemeli olarak) :class:`Base1` temel sınıflarında aranır ve orada bulunamazsa :class:`Base2` vb.

source: In fact, it is slightly more complex than that; the method resolution order changes dynamically to support cooperative calls to :func:`super`. This approach is known in some other multiple-inheritance languages as call-next-method and is more powerful than the super call found in single-inheritance languages.
tr: Aslında, durum bundan biraz daha karmaşıktır: yöntem çözümleme sırası, :func:`super` için işbirliği çağrılarını desteklemek için dinamik olarak değişir. Bu yaklaşım, diğer bazı çoklu kalıtım dillerinde sonraki çağrı yöntemi olarak bilinir ve tekli kalıtım dillerinde bulunan süper çağrıdan daha güçlüdür.
