Repository: python/python-docs-tr
Catalog: tutorial/classes.po
Languages: tr

source: Dynamic ordering is necessary because all cases of multiple inheritance exhibit one or more diamond relationships (where at least one of the parent classes can be accessed through multiple paths from the bottommost class). For example, all classes inherit from :class:`object`, so any case of multiple inheritance provides more than one path to reach :class:`object`. To keep the base classes from being accessed more than once, the dynamic algorithm linearizes the search order in a way that preserves the left-to-right ordering specified in each class, that calls each parent only once, and that is monotonic (meaning that a class can be subclassed without affecting the precedence order of its parents). Taken together, these properties make it possible to design reliable and extensible classes with multiple inheritance. For more detail, see https://www.python.org/download/releases/2.3/mro/.
tr: Çoklu kalıtımın tüm durumları bir veya daha fazla elmas ilişkisi gösterdiğinden (üst sınıflardan en az birine, en alttaki sınıftan birden çok yol üzerinden erişilebildiği ilişkiler) dinamik sıralama gereklidir. Örneğin, tüm sınıflar :class:`object` öğesini devralır, bu nedenle çoklu kalıtım durumu :class:`object` 'e ulaşmak için birden fazla yol sağlar. Temel sınıflara birden çok kez erişilmesini önlemek için, dinamik algoritma arama sırasını her sınıfta belirtilen soldan sağa sıralamayı koruyacak şekilde doğrular, her üst öğeyi yalnızca bir kez çağırır ve monotondur (yani bir sınıf, üst sınıfının öncelik sırasını etkilemeden alt sınıflandırılabilir). Birlikte ele alındığında, bu özellikler çoklu kalıtım ile güvenilir ve genişletilebilir sınıflar tasarlamayı mümkün kılar. Daha fazla ayrıntı için bkz. https://www.python.org/download/releases/2.3/mro/.

source: Private Variables
tr: Özel Değişkenler

source: "Private" instance variables that cannot be accessed except from inside an object don't exist in Python. However, there is a convention that is followed by most Python code: a name prefixed with an underscore (e.g. ``_spam``) should be treated as a non-public part of the API (whether it is a function, a method or a data member). It should be considered an implementation detail and subject to change without notice.
tr: Python'da bir nesnenin içinden erişilmesi dışında asla erişilemeyen "özel" örnek değişkenleri yoktur. Ancak, çoğu Python kodu tarafından izlenen bir kural vardır: alt çizgi (örneğin ``_spam``) ile öneklenmiş bir ad API'nin genel olmayan bir parçası olarak kabul edilmelidir (bir fonksiyon, metot veya veri üyesi olsun). Bir uygulama detayıdır ve önceden haber verilmeksizin değiştirilebilir.

source: Since there is a valid use-case for class-private members (namely to avoid name clashes of names with names defined by subclasses), there is limited support for such a mechanism, called :dfn:`name mangling`. Any identifier of the form ``__spam`` (at least two leading underscores, at most one trailing underscore) is textually replaced with ``_classname__spam``, where ``classname`` is the current class name with leading underscore(s) stripped. This mangling is done without regard to the syntactic position of the identifier, as long as it occurs within the definition of a class.
tr: Sınıf-özel üyeler için geçerli bir kullanım örneği olduğundan (yani alt sınıflar tarafından tanımlanan adlara sahip adların ad çakışmasını önlemek için), :dfn:`name mangling` adı verilen böyle bir mekanizma için sınırlı destek vardır. ``__spam`` formunun herhangi bir tanımlayıcısı (en az iki satır altı, en fazla bir alt çizgi) metinsel olarak ``_classname__spam`` ile değiştirilir; Bu mangling, bir sınıfın tanımı içinde gerçekleştiği sürece tanımlayıcının söz dizimsel konumuna bakılmaksızın yapılır.

source: Name mangling is helpful for letting subclasses override methods without breaking intraclass method calls. For example::
tr: Ad mangling, alt sınıfların sınıf içi metot çağrılarını kesmeden metotları geçersiz kılmasına izin vermek için yararlıdır. Mesela::

source: The above example would work even if ``MappingSubclass`` were to introduce a ``__update`` identifier since it is replaced with ``_Mapping__update`` in the ``Mapping`` class and ``_MappingSubclass__update`` in the ``MappingSubclass`` class respectively.
tr: Yukarıdaki örnek, ``MappingSubclass`` sırasıyla ``Mapping`` sınıfında ``_Mapping__update`` ve ``mappingSubclass`` sınıfında ``_MappingSubclass__update`` ile değiştirildiği için ``__update`` tanımlayıcısı tanıtsa bile çalışır.

source: Note that the mangling rules are designed mostly to avoid accidents; it still is possible to access or modify a variable that is considered private. This can even be useful in special circumstances, such as in the debugger.
tr: Mangling kurallarının çoğunlukla kazaları önlemek için tasarlandığını unutmayın; özel olarak kabul edilen bir değişkene erişmek veya değiştirmek hala mümkündür. Bu, hata ayıklayıcı gibi özel durumlarda bile yararlı olabilir.

source: Notice that code passed to ``exec()`` or ``eval()`` does not consider the classname of the invoking class to be the current class; this is similar to the effect of the ``global`` statement, the effect of which is likewise restricted to code that is byte-compiled together. The same restriction applies to ``getattr()``, ``setattr()`` and ``delattr()``, as well as when referencing ``__dict__`` directly.
tr: ``exec()`` veya ``eval()`` koduna geçirilen kodun çağırma sınıfının sınıf adını geçerli sınıf olarak görmediğine dikkat edin; bu, etkisi aynı şekilde birlikte bayt derlenmiş kodla sınırlı olan ``global`` deyiminin etkisine benzer. Aynı kısıtlama ``getattr()``, ``setattr()`` ve ``delattr()`` ve doğrudan ``__dict__`` atıfta bulunurken de geçerlidir.

source: Odds and Ends
tr: Oranlar ve Bitişler

source: Sometimes it is useful to have a data type similar to the Pascal "record" or C "struct", bundling together a few named data items. The idiomatic approach is to use :mod:`dataclasses` for this purpose::
tr: Bazen, birkaç adlandırılmış veri öğesini bir araya getirerek Pascal *record* 'u veya C *struct* 'ına benzer bir veri türüne sahip olmak yararlıdır. Deyimsel yaklaşım, bu amaç için :mod:`dataclasses` kullanmaktır::

source: A piece of Python code that expects a particular abstract data type can often be passed a class that emulates the methods of that data type instead. For instance, if you have a function that formats some data from a file object, you can define a class with methods :meth:`read` and :meth:`!readline` that get the data from a string buffer instead, and pass it as an argument.
tr: Belirli bir soyut veri türünü bekleyen Python kodunun bir parçası genellikle bunun yerine bu veri türünün yöntemlerine öykünen bir sınıfa geçirilebilir. Örneğin, bir dosya nesnesinden bazı verileri biçimlendiren bir fonksiyonunuz varsa, bunun yerine verileri bir dize arabelleğinden alan ve bağımsız değişken olarak geçiren :meth:`read` ve :meth:`!readline` yöntemlerine sahip bir sınıf tanımlayabilirsiniz.

source: Instance method objects have attributes, too: ``m.__self__`` is the instance object with the method :meth:`m`, and ``m.__func__`` is the function object corresponding to the method.
tr: Örnek yöntem nesnelerinin de nitelikleri vardır: ``m.__self__`` yöntemi olan örnek nesnedir :meth:`m`, ve ``m.__func__`` yönteme karşılık gelen fonksiyon nesnesidir.

source: Iterators
tr: Yineleyiciler

source: By now you have probably noticed that most container objects can be looped over using a :keyword:`for` statement::
tr: Şimdiye kadar büyük olasılıkla çoğu kapsayıcı nesnenin bir :keyword:`for` deyimi kullanılarak döngüye alınabileceğini fark etmişsinizdir::

source: This style of access is clear, concise, and convenient. The use of iterators pervades and unifies Python. Behind the scenes, the :keyword:`for` statement calls :func:`iter` on the container object. The function returns an iterator object that defines the method :meth:`~iterator.__next__` which accesses elements in the container one at a time. When there are no more elements, :meth:`~iterator.__next__` raises a :exc:`StopIteration` exception which tells the :keyword:`!for` loop to terminate. You can call the :meth:`~iterator.__next__` method using the :func:`next` built-in function; this example shows how it all works::
tr: Bu erişim tarzı açık, özlü ve kullanışlıdır. Yineleyicilerin kullanımı Python'u istila eder ve birleştirir. Perde arkasında :keyword:`for` deyimi kapsayıcı nesne üzerinde :func:`iter` öğesini çağırır. Fonksiyon, kapsayıcıdaki öğelere teker teker erişen :meth:`~iterator.__next__` metodunu tanımlayan bir yineleyici nesnesi döndürür. Başka öğe olmadığında, :meth:`~iterator.__next__`, :keyword:`!for` döngüsünün sonlandırılacağını bildiren bir :exc:`StopIteration` hatası oluşturur. :func:`next` yerleşik fonksiyonunu kullanarak :meth:`~iterator.__next__` yöntemini çağırabilirsiniz; Bu örnek, her şeyin nasıl çalıştığını gösterir::

source: Having seen the mechanics behind the iterator protocol, it is easy to add iterator behavior to your classes. Define an :meth:`__iter__` method which returns an object with a :meth:`~iterator.__next__` method. If the class defines :meth:`__next__`, then :meth:`__iter__` can just return ``self``::
tr: Yineleme protokolünün arkasındaki mekaniği gördükten sonra, sınıflarınıza yineleme davranışı eklemek kolaydır. :meth:`~iterator.__next__` metodu ile bir nesne döndüren :meth:`__iter__` metodunu tanımlayın. Sınıf :meth:`__next__` tanımlarsa, :meth:`__iter__` sadece ``self`` döndürebilir::

source: Generators
tr: Üreteçler

source: :term:`Generators <generator>` are a simple and powerful tool for creating iterators. They are written like regular functions but use the :keyword:`yield` statement whenever they want to return data. Each time :func:`next` is called on it, the generator resumes where it left off (it remembers all the data values and which statement was last executed). An example shows that generators can be trivially easy to create::
tr: :term:`Üreteçler <generator>` yineleyiciler oluşturmak için basit ve güçlü bir araçtır. Normal fonksiyonlar gibi yazılırlar, ancak veri döndürmek istediklerinde :keyword:`yield` deyimini kullanırlar. Üzerinde her :func:`next` çağrıldığı zaman, üreteç kaldığı yerden devam eder (tüm veri değerlerini ve hangi deyimin en son yürütüldüğını hatırlar). Bu örnek, üreteçlerin oluşturulmasının ne kadar da kolay olabileceğini gösterir::

source: Anything that can be done with generators can also be done with class-based iterators as described in the previous section. What makes generators so compact is that the :meth:`__iter__` and :meth:`~generator.__next__` methods are created automatically.
tr: Üreteçlerle yapılabilecek her şey, önceki bölümde açıklandığı gibi sınıf tabanlı yineleyicilerle de yapılabilir. Üreteçleri bu kadar kompakt yapan şey: :meth:`__iter__` ve :meth:`~generator.__next__` yöntemlerinin otomatik olarak oluşturulmasıdır.

source: Another key feature is that the local variables and execution state are automatically saved between calls. This made the function easier to write and much more clear than an approach using instance variables like ``self.index`` and ``self.data``.
tr: Başka bir önemli özellik, yerel değişkenlerin ve yürütme durumunun çağrılar arasında otomatik olarak kaydedilmesidir. Bu, fonksiyonun yazılmasını kolaylaştırdı ve ``self.index`` ve ``self.data`` gibi değişkenleri kullanmaya kıyasla çok daha net hale getirdi.

source: In addition to automatic method creation and saving program state, when generators terminate, they automatically raise :exc:`StopIteration`. In combination, these features make it easy to create iterators with no more effort than writing a regular function.
tr: Otomatik metot oluşturma ve kaydetme programı durumuna ek olarak, üreteçler sonlandırıldığında otomatik olarak :exc:`StopIteration` 'ı yükseltirler. Birlikte, bu özellikler normal bir işlev yazmaktan daha fazla çaba harcamadan yinelemeler oluşturmayı kolaylaştırır.

source: Generator Expressions
tr: Üreteç İfadeleri

source: Some simple generators can be coded succinctly as expressions using a syntax similar to list comprehensions but with parentheses instead of square brackets. These expressions are designed for situations where the generator is used right away by an enclosing function. Generator expressions are more compact but less versatile than full generator definitions and tend to be more memory friendly than equivalent list comprehensions.
tr: Bazı basit üreteçler, listelere benzer bir söz dizimi kullanılarak ve köşeli ayraçlar yerine parantezlerle kısaca kodlanabilir. Bu ifadeler, üreteçlerin kapsayıcı bir fonksiyon tarafından hemen kullanıldığı durumlar için tasarlanmıştır. Üreteç ifadeleri tam üreteç tanımlarından daha kompakt ancak daha az çok yönlüdür ve aynı özellikle liste anlamalarından daha bellek dostu olma eğilimindedir.

source: Examples::
tr: Örnekler::

source: Footnotes
tr: Dipnotlar

source: Except for one thing. Module objects have a secret read-only attribute called :attr:`~object.__dict__` which returns the dictionary used to implement the module's namespace; the name :attr:`~object.__dict__` is an attribute but not a global name. Obviously, using this violates the abstraction of namespace implementation, and should be restricted to things like post-mortem debuggers.
tr: Bir şey hariç. Modül nesneleri, :attr:`~object.__dict__` denen sadece okunabilir bir özelliğe sahiptir, bu da modülün ad alanını uygulamak için bir sözlük döndürür: :attr:`~object.__dict__` ismi bir özellik olsa da global bir isim değildir. Kuşkusuz, bu durum ad alanlarının soyutlanış özelliklerine aykırı, dolayısıyla sadece programın durması sonrası çalışan hata ayıklayıcılar gibilerinin kullanımına kısıtlanmalı.
