Repository: python/python-docs-tr
Catalog: tutorial/datastructures.po
Languages: tr

source: Data Structures
tr: Veri Yapıları

source: This chapter describes some things you've learned about already in more detail, and adds some new things as well.
tr: Bu bölüm, daha önce öğrendiğiniz bazı şeyleri daha ayrıntılı olarak açıklamakta ve bazı yeni şeyler de eklemektedir.

source: More on Lists
tr: Listeler Üzerine

source: The list data type has some more methods. Here are all of the methods of list objects:
tr: Liste veri türünün bazı yöntemleri daha vardır. Liste nesnelerinin tüm metotları şunlardır:

source: Add an item to the end of the list. Equivalent to ``a[len(a):] = [x]``.
tr: Listenin sonuna bir öğe ekleyin. ``a[len(a):] = [x]`` ile eş değerdir.

source: Extend the list by appending all the items from the iterable. Equivalent to ``a[len(a):] = iterable``.
tr: Listeyi iterable'daki tüm öğeleri ekleyerek genişletin. ``a[len(a):] = iterable`` ile eş değerdir.

source: Insert an item at a given position. The first argument is the index of the element before which to insert, so ``a.insert(0, x)`` inserts at the front of the list, and ``a.insert(len(a), x)`` is equivalent to ``a.append(x)``.
tr: Verilen pozisyona bir öğe ekleyin. İlk argüman, daha önce ekleyeceğiniz öğenin indeksidir, bu nedenle ``a.insert(0, x)`` listenin önüne ekler ve ``a.insert(len(a), x)`` komutu ``a.append(x)`` komutu ile eş değerdir.

source: Remove the first item from the list whose value is equal to *x*. It raises a :exc:`ValueError` if there is no such item.
tr: Değeri *x*'e eşit olan ilk öğeyi listeden kaldırır. Böyle bir öğe yoksa :exc:`ValueError` hatası ortaya çıkar.

source: Remove the item at the given position in the list, and return it. If no index is specified, ``a.pop()`` removes and returns the last item in the list. (The square brackets around the *i* in the method signature denote that the parameter is optional, not that you should type square brackets at that position. You will see this notation frequently in the Python Library Reference.)
tr: Listede verilen konumdaki öğeyi kaldırır ve geri döndürür. Herhangi bir indis belirtilmezse, ``a.pop()`` listedeki son öğeyi kaldırır ve döndürür. (Yöntem imzasındaki *i* parametresinin etrafındaki köşeli parantezler, parametrenin isteğe bağlı olduğunu belirtir, o konumda köşeli parantez yazmanız gerektiğini değil. Bu gösterimi Python Kütüphane Referansında sıkça göreceksiniz)

source: Remove all items from the list. Equivalent to ``del a[:]``.
tr: Listeden tüm öğeleri kaldırır. ``del a[:]`` ile eş değerdir.

source: Return zero-based index in the list of the first item whose value is equal to *x*. Raises a :exc:`ValueError` if there is no such item.
tr: Değeri *x*'e eşit olan ilk öğenin listedeki sıfır tabanlı indeksini döndürür. Böyle bir öğe yoksa :exc:`ValueError` hatası ortaya çıkar.

source: The optional arguments *start* and *end* are interpreted as in the slice notation and are used to limit the search to a particular subsequence of the list. The returned index is computed relative to the beginning of the full sequence rather than the *start* argument.
tr: İsteğe bağlı *start* ve *end* argümanları dilim gösteriminde olduğu gibi yorumlanır ve aramayı listenin belirli bir alt dizisiyle sınırlamak için kullanılır. Döndürülen dizin, *start* bağımsız değişkeni yerine tam dizinin başlangıcına göre hesaplanır.

source: Return the number of times *x* appears in the list.
tr: Listede *x* öğesinin kaç kez göründüğünü döndürür.

source: Sort the items of the list in place (the arguments can be used for sort customization, see :func:`sorted` for their explanation).
tr: Listenin öğelerini yerinde sıralayın (argümanlar sıralama özelleştirmesi için kullanılabilir, açıklamaları için bkz: :func:`sorted`).

source: Reverse the elements of the list in place.
tr: Listenin öğelerini yerinde ters çevirir.

source: Return a shallow copy of the list. Equivalent to ``a[:]``.
tr: Listenin yüzeysel bir kopyasını döndürür. ``a[:]`` ile eş değerdir.

source: An example that uses most of the list methods::
tr: Liste yöntemlerinin çoğunu kullanan bir örnek::

source: You might have noticed that methods like ``insert``, ``remove`` or ``sort`` that only modify the list have no return value printed -- they return the default ``None``. [#]_ This is a design principle for all mutable data structures in Python.
tr: Listeyi yalnızca değiştiren ``insert``, ``remove`` veya ``sort`` gibi yöntemlerin hiçbir dönüş değeri yazdırmadığını fark etmiş olabilirsiniz -- onlar varsayılan ``None`` değerini döndürürler. [#]_ Bu, Python'daki tüm değiştirilebilir veri yapıları için bir tasarım ilkesidir.

source: Another thing you might notice is that not all data can be sorted or compared. For instance, ``[None, 'hello', 10]`` doesn't sort because integers can't be compared to strings and *None* can't be compared to other types. Also, there are some types that don't have a defined ordering relation. For example, ``3+4j < 5+7j`` isn't a valid comparison.
tr: Fark edebileceğiniz bir başka şey de tüm verilerin sıralanamayacağı veya karşılaştırılamayacağıdır. Örneğin, ``[None, 'hello', 10]`` sıralanamaz çünkü tamsayılar dizelerle karşılaştırılamaz ve *None* diğer türlerle karşılaştırılamaz. Ayrıca, tanımlanmış bir sıralama ilişkisine sahip olmayan bazı türler de vardır. Örneğin, ``3+4j < 5+7j`` geçerli bir karşılaştırma değildir.

source: Using Lists as Stacks
tr: Listeleri Yığın Olarak Kullanma

source: The list methods make it very easy to use a list as a stack, where the last element added is the first element retrieved ("last-in, first-out"). To add an item to the top of the stack, use :meth:`append`. To retrieve an item from the top of the stack, use :meth:`pop` without an explicit index. For example::
tr: Liste yöntemleri, bir listeyi, eklenen son öğenin alınan ilk öğe olduğu bir yığın olarak kullanmayı çok kolaylaştırır ("son giren ilk çıkar"). Yığının en üstüne bir öğe eklemek için :meth:`append` kullanın. Yığının en üstünden bir öğe almak için, açık bir indeks olmadan :meth:`pop` kullanın. Örneğin::

source: Using Lists as Queues
tr: Listeleri Kuyruk Olarak Kullanma

source: It is also possible to use a list as a queue, where the first element added is the first element retrieved ("first-in, first-out"); however, lists are not efficient for this purpose. While appends and pops from the end of list are fast, doing inserts or pops from the beginning of a list is slow (because all of the other elements have to be shifted by one).
tr: Bir listeyi, eklenen ilk elemanın alınan ilk eleman olduğu bir kuyruk olarak kullanmak da mümkündür ("ilk giren ilk çıkar"); ancak listeler bu amaç için verimli değildir. Listenin sonundan ekleme ve çıkarma işlemleri hızlıyken, listenin başından ekleme veya çıkarma yapmak yavaştır (çünkü diğer tüm öğelerin bir adım kaydırılması gerekir).

source: To implement a queue, use :class:`collections.deque` which was designed to have fast appends and pops from both ends. For example::
tr: Bir kuyruk uygulamak için, her iki uçtan da hızlı ekleme ve çıkarma yapmak üzere tasarlanmış :class:`collections.deque` kullanın. Örneğin::

source: List Comprehensions
tr: Liste Kavramaları

source: List comprehensions provide a concise way to create lists. Common applications are to make new lists where each element is the result of some operations applied to each member of another sequence or iterable, or to create a subsequence of those elements that satisfy a certain condition.
tr: Liste kavramaları, listeler oluşturmak için kısa bir yol sağlar. Yaygın uygulamalar, her bir öğenin başka bir dizinin veya yinelenebilir öğenin her bir üyesine uygulanan bazı işlemlerin sonucu olduğu yeni listeler oluşturmak veya belirli bir koşulu karşılayan öğelerin bir alt dizisini oluşturmaktır.

source: For example, assume we want to create a list of squares, like::
tr: Örneğin, aşağıdaki gibi bir kareler listesi oluşturmak istediğimizi varsayalım:

source: Note that this creates (or overwrites) a variable named ``x`` that still exists after the loop completes. We can calculate the list of squares without any side effects using::
tr: Bunun, ``x`` adında bir değişken yarattığına (veya üzerine yazdığına) ve bu değişkenin döngü tamamlandıktan sonra da var olduğuna dikkat edin. Kareler listesini, şunu kullanarak herhangi bir yan etki olmadan hesaplayabiliriz:

source: or, equivalently::
tr: veya aynı şekilde::

source: which is more concise and readable.
tr: ki bu daha kısa ve okunaklıdır.

source: A list comprehension consists of brackets containing an expression followed by a :keyword:`!for` clause, then zero or more :keyword:`!for` or :keyword:`!if` clauses. The result will be a new list resulting from evaluating the expression in the context of the :keyword:`!for` and :keyword:`!if` clauses which follow it. For example, this listcomp combines the elements of two lists if they are not equal::
tr: Bir liste kavrayışı, bir ifade içeren parantezlerden ve ardından bir :keyword:`!for` cümlesinden, ardından sıfır veya daha fazla :keyword:`!for` veya :keyword:`!if` cümlesinden oluşur. Sonuç, ifadenin kendisini takip eden :keyword:`!for` ve :keyword:`!if` cümleleri bağlamında değerlendirilmesiyle elde edilen yeni bir liste olacaktır. Örneğin, listcomp, eşit değillerse iki listenin öğelerini birleştirir::

source: and it's equivalent to::
tr: ve şuna eş değerdir::

source: Note how the order of the :keyword:`for` and :keyword:`if` statements is the same in both these snippets.
tr: Her iki kod parçacığında da :keyword:`for` ve :keyword:`if` ifadelerinin sıralamasının aynı olduğuna dikkat edin.

source: If the expression is a tuple (e.g. the ``(x, y)`` in the previous example), it must be parenthesized. ::
tr: Eğer ifade bir veri grubu ise (örneğin önceki örnekteki ``(x, y)``), parantez içine alınmalıdır. ::

source: List comprehensions can contain complex expressions and nested functions::
tr: Liste kavramaları karmaşık ifadeler ve iç içe geçmiş fonksiyonlar içerebilir::

source: Nested List Comprehensions
tr: İç İçe Liste Kavramaları

source: The initial expression in a list comprehension can be any arbitrary expression, including another list comprehension.
tr: Bir liste kavrayışındaki ilk ifade, başka bir liste kavrayışı da dahil olmak üzere rastgele herhangi bir ifade olabilir.

source: Consider the following example of a 3x4 matrix implemented as a list of 3 lists of length 4::
tr: Uzunluğu 4 olan 3 listeden oluşan bir liste olarak uygulanan 3x4'lük bir matrisin aşağıdaki örneğini düşünün::

source: The following list comprehension will transpose rows and columns::
tr: Aşağıdaki liste kavraması satır ve sütunların yerlerini değiştirir::

source: As we saw in the previous section, the inner list comprehension is evaluated in the context of the :keyword:`for` that follows it, so this example is equivalent to::
tr: Önceki bölümde gördüğümüz gibi, iç liste kavrayışı, onu takip eden :keyword:`for` bağlamında değerlendirilir, bu nedenle bu örnek şuna eş değerdir::

source: which, in turn, is the same as::
tr: ki bu da şununla aynıdır::

source: In the real world, you should prefer built-in functions to complex flow statements. The :func:`zip` function would do a great job for this use case::
tr: Gerçek dünyada, karmaşık akışlı ifadeler yerine yerleşik işlevleri tercih etmelisiniz. Bu kullanım durumu için :func:`zip` fonksiyonu harika bir iş çıkaracaktır::

source: See :ref:`tut-unpacking-arguments` for details on the asterisk in this line.
tr: Bu satırdaki yıldız işaretiyle ilgili ayrıntılar için :ref:`tut-unpacking-arguments` bölümüne bakın.

source: The :keyword:`!del` statement
tr: :keyword:`!del` ifadesi

source: There is a way to remove an item from a list given its index instead of its value: the :keyword:`del` statement. This differs from the :meth:`pop` method which returns a value. The :keyword:`!del` statement can also be used to remove slices from a list or clear the entire list (which we did earlier by assignment of an empty list to the slice). For example::
tr: Değer yerine indeksi verilen bir öğeyi listeden kaldırmanın bir yolu vardır: :keyword:`del` ifadesi. Bu, bir değer döndüren :meth:`pop` yönteminden farklıdır. :keyword:`!del` ifadesi ayrıca bir listeden dilimleri kaldırmak veya tüm listeyi temizlemek için de kullanılabilir (bunu daha önce dilime boş bir liste atayarak yapmıştık). Örneğin::

source: :keyword:`del` can also be used to delete entire variables::
tr: :keyword:`del` değişkenlerin tamamını silmek için de kullanılabilir::

source: Referencing the name ``a`` hereafter is an error (at least until another value is assigned to it). We'll find other uses for :keyword:`del` later.
tr: Bundan sonra ``a`` ismine referans vermek bir hatadır (en azından ona başka bir değer atanana kadar). Daha sonra :keyword:`del` için başka kullanımlar bulacağız.

source: Tuples and Sequences
tr: Veri Grupları ve Diziler

source: We saw that lists and strings have many common properties, such as indexing and slicing operations. They are two examples of *sequence* data types (see :ref:`typesseq`). Since Python is an evolving language, other sequence data types may be added. There is also another standard sequence data type: the *tuple*.
tr: Listelerin ve dizelerin indeksleme ve dilimleme işlemleri gibi birçok ortak özelliğe sahip olduğunu gördük. Bunlar *dizi* veri tiplerinin iki örneğidir (bkz. :ref:`typesseq`). Python gelişen bir dil olduğu için başka dizi veri tipleri de eklenebilir. Ayrıca başka bir standart dizi veri tipi daha vardır: *tuple*.

source: A tuple consists of a number of values separated by commas, for instance::
tr: Bir veri grubu, virgülle ayrılmış bir dizi değerden oluşur, örneğin::

source: As you see, on output tuples are always enclosed in parentheses, so that nested tuples are interpreted correctly; they may be input with or without surrounding parentheses, although often parentheses are necessary anyway (if the tuple is part of a larger expression). It is not possible to assign to the individual items of a tuple, however it is possible to create tuples which contain mutable objects, such as lists.
tr: Gördüğünüz gibi, çıktıda veri grupları her zaman parantez içine alınır, böylece iç içe geçmiş veri grupları doğru şekilde yorumlanır; parantezli veya parantezsiz olarak girilebilirler, ancak genellikle parantezler gereklidir (eğer grup daha büyük bir ifadenin parçasıysa). Bir veri grubunun öğelerine tek tek atama yapmak mümkün değildir, ancak listeler gibi değiştirilebilir nesneler içeren veri grupları oluşturmak mümkündür.

source: Though tuples may seem similar to lists, they are often used in different situations and for different purposes. Tuples are :term:`immutable`, and usually contain a heterogeneous sequence of elements that are accessed via unpacking (see later in this section) or indexing (or even by attribute in the case of :func:`namedtuples <collections.namedtuple>`). Lists are :term:`mutable`, and their elements are usually homogeneous and are accessed by iterating over the list.
tr: Veri grupları listelere benzer görünse de, genellikle farklı durumlarda ve farklı amaçlar için kullanılırlar. Veri grupları :term:`immutable` 'dır ve genellikle paket açma (bu bölümün ilerleyen kısımlarına bakınız) veya indeksleme (hatta :func:`namedtuples <collections.namedtuple>` durumunda öznitelik ile) yoluyla erişilen heterojen bir dizi eleman içerir. Listeler :term:`mutable` 'dır ve elemanları genellikle homojendir ve listenin üzerinde yinelenerek erişilir.

source: A special problem is the construction of tuples containing 0 or 1 items: the syntax has some extra quirks to accommodate these. Empty tuples are constructed by an empty pair of parentheses; a tuple with one item is constructed by following a value with a comma (it is not sufficient to enclose a single value in parentheses). Ugly, but effective. For example::
tr: Özel bir sorun, 0 veya 1 öğe içeren veri gruplarının oluşturulmasıdır: söz diziminin bunlar ile başa çıkan bazı ekstra tuhaflıkları vardır. Boş veri grupları boş bir parantez çifti ile oluşturulur; bir öğeli bir veri grubu, bir değeri virgülle takip ederek oluşturulur (tek bir değeri parantez içine almak yeterli değildir). Çirkin olsa da etkilidir. Örneğin::

source: The statement ``t = 12345, 54321, 'hello!'`` is an example of *tuple packing*: the values ``12345``, ``54321`` and ``'hello!'`` are packed together in a tuple. The reverse operation is also possible::
tr: ``t = 12345, 54321, ‘hello!’`` ifadesi bir *veri grubu paketleme* örneğidir: ``12345``, ``54321`` ve ``'hello!'`` değerleri bir veri grubu içinde bir araya getirilmiştir. Bu işlemin tersi de mümkündür::

source: This is called, appropriately enough, *sequence unpacking* and works for any sequence on the right-hand side. Sequence unpacking requires that there are as many variables on the left side of the equals sign as there are elements in the sequence. Note that multiple assignment is really just a combination of tuple packing and sequence unpacking.
tr: Buna uygun bir şekilde *dizi açma (sequence unpacking)* denir ve sağ taraftaki herhangi bir dizi için çalışır. Dizi açma, eşittir işaretinin sol tarafında dizideki eleman sayısı kadar değişken olmasını gerektirir. Çoklu atamanın aslında tuple paketleme ve dizi açmanın bir kombinasyonu olduğunu unutmayın.

source: Sets
tr: Kümeler

source: Python also includes a data type for *sets*. A set is an unordered collection with no duplicate elements. Basic uses include membership testing and eliminating duplicate entries. Set objects also support mathematical operations like union, intersection, difference, and symmetric difference.
tr: Python ayrıca *kümeler* için bir veri türü içerir. Bir küme, yinelenen öğeleri olmayan sırasız bir koleksiyondur. Temel kullanımları içerisinde üyelik testi ve yinelenen girdilerin elenmesi yer alır. Küme nesneleri ayrıca birleşim, kesişim, fark ve simetrik fark gibi matematiksel işlemleri de destekler.

source: Curly braces or the :func:`set` function can be used to create sets. Note: to create an empty set you have to use ``set()``, not ``{}``; the latter creates an empty dictionary, a data structure that we discuss in the next section.
tr: Küme oluşturmak için küme parantezleri veya :func:`set` fonksiyonu kullanılabilir. Not: boş bir küme oluşturmak için ``{}`` değil ``set()`` kullanmanız gerekir, çünkü birincisi boş bir sözlük oluşturur, ki bu da bir sonraki bölümde tartışacağımız bir veri yapısıdır.

source: Here is a brief demonstration::
tr: İşte kısa bir gösterim::

source: Similarly to :ref:`list comprehensions <tut-listcomps>`, set comprehensions are also supported::
tr: :ref:`liste kavramaları <tut-listcomps>` gibi küme kavramaları da desteklenmektedir::

source: Dictionaries
tr: Sözlükler

source: Another useful data type built into Python is the *dictionary* (see :ref:`typesmapping`). Dictionaries are sometimes found in other languages as "associative memories" or "associative arrays". Unlike sequences, which are indexed by a range of numbers, dictionaries are indexed by *keys*, which can be any immutable type; strings and numbers can always be keys. Tuples can be used as keys if they contain only strings, numbers, or tuples; if a tuple contains any mutable object either directly or indirectly, it cannot be used as a key. You can't use lists as keys, since lists can be modified in place using index assignments, slice assignments, or methods like :meth:`append` and :meth:`extend`.
tr: Python'da yerleşik olarak bulunan bir başka kullanışlı veri türü de *sözlüktür* (bkz :ref:`typesmapping`). Sözlükler bazen diğer dillerde "ilişkisel bellekler" veya "ilişkisel diziler" olarak bulunur. Bir sayı aralığı ile indekslenen dizilerin aksine, sözlükler herhangi bir değişmez tip olabilen *anahtarlar* ile indekslenir, ki dizgiler ve sayılar her zaman birer anahtar olabilir. Veri grupları yalnızca dizgi, sayı ya da veri grubu içeriyorsa anahtar olarak kullanılabilir. Ancak bir veri grubu doğrudan ya da dolaylı olarak değişebilir herhangi bir nesne içeriyorsa anahtar olarak kullanılamaz. Listeler; dizin atamaları, dilim atamaları veya :meth:`append` ve :meth:`extend` gibi yöntemler kullanılarak yerinde değiştirilebildiğinden listeleri anahtar olarak kullanamazsınız.

source: It is best to think of a dictionary as a set of *key: value* pairs, with the requirement that the keys are unique (within one dictionary). A pair of braces creates an empty dictionary: ``{}``. Placing a comma-separated list of key:value pairs within the braces adds initial key:value pairs to the dictionary; this is also the way dictionaries are written on output.
tr: Bir sözlüğü *anahtar: değer* çiftleri olarak düşünmek en iyisidir. Bir sözlük içerisindeki her anahtarın benzersiz olması gerektiğini ise unutmayın. Bir çift parantez boş bir sözlük oluşturur: ``{}``. Anahtar:değer çiftlerinin virgülle ayrılmış bir listesini parantezler içine yerleştirmek sözlüğe ilk anahtar:değer çiftlerini ekler; sözlükler çıktıda da aynı bu şekilde görünürler.

source: The main operations on a dictionary are storing a value with some key and extracting the value given the key. It is also possible to delete a key:value pair with ``del``. If you store using a key that is already in use, the old value associated with that key is forgotten. It is an error to extract a value using a non-existent key.
tr: Bir sözlük üzerindeki ana işlemler, bir değeri bir anahtarla depolamak ve anahtarı verilen değeri geri çıkarmaktır. Ayrıca ``del`` ile bir anahtar:değer çiftini silmek de mümkündür. Zaten bir değeri kullanımda olan bir anahtar kullanarak saklarsanız, bu anahtarla ilişkili eski değer unutulur. Var olmayan bir anahtar kullanarak değer çıkarmak bir hatadır.

source: Performing ``list(d)`` on a dictionary returns a list of all the keys used in the dictionary, in insertion order (if you want it sorted, just use ``sorted(d)`` instead). To check whether a single key is in the dictionary, use the :keyword:`in` keyword.
tr: Bir sözlük üzerinde ``list(d)`` işlemini gerçekleştirmek, sözlükte kullanılan tüm anahtarların bir listesini eklenme sırasına göre döndürür (başka bir düzenle sıralanmasını istiyorsanız, bunun yerine ``sorted(d)`` kullanın). Tek bir anahtarın sözlükte olup olmadığını kontrol etmek için :keyword:`in` anahtar sözcüğünü kullanın.

source: Here is a small example using a dictionary::
tr: İşte sözlük kullanılan bir örnek::

source: The :func:`dict` constructor builds dictionaries directly from sequences of key-value pairs::
tr: :func:`dict` yapıcısı, doğrudan anahtar-değer dizilerinden sözlükler oluşturur::

source: In addition, dict comprehensions can be used to create dictionaries from arbitrary key and value expressions::
tr: Buna ek olarak, sözlük kavramaları rastgele anahtar ve değer ifadelerinden sözlükler oluşturmak için de kullanılabilir::

source: When the keys are simple strings, it is sometimes easier to specify pairs using keyword arguments::
tr: Anahtarlar basit dizgiler olduğunda, anahtar sözcük argümanlarını kullanarak çiftleri belirtmek bazen daha kolaydır::

source: Looping Techniques
tr: Döngü Teknikleri

source: When looping through dictionaries, the key and corresponding value can be retrieved at the same time using the :meth:`items` method. ::
tr: Sözlükler arasında döngü yaparken, :meth:`items` yöntemi kullanılarak anahtar ve karşılık gelen değer aynı anda alınabilir. ::

source: When looping through a sequence, the position index and corresponding value can be retrieved at the same time using the :func:`enumerate` function. ::
tr: Bir dizi boyunca döngü yaparken, :func:`enumerate` fonksiyonu kullanılarak konum indeksi ve karşılık gelen değer aynı anda alınabilir. ::

source: To loop over two or more sequences at the same time, the entries can be paired with the :func:`zip` function. ::
tr: Aynı anda iki veya daha fazla dizi üzerinde döngü yapmak için, girdiler :func:`zip` fonksiyonu ile eşleştirilebilir. ::
