Repository: python/python-docs-tr
Catalog: tutorial/datastructures.po
Languages: tr

source: To loop over a sequence in reverse, first specify the sequence in a forward direction and then call the :func:`reversed` function. ::
tr: Bir dizi üzerinde ters yönde döngü yapmak için, önce diziyi ileri yönde belirtin ve ardından :func:`reversed` fonksiyonunu çağırın. ::

source: To loop over a sequence in sorted order, use the :func:`sorted` function which returns a new sorted list while leaving the source unaltered. ::
tr: Bir dizi üzerinde sıralı olarak döngü yapmak için, listenin kaynağını değiştirmeksizin yeni bir sıralı liste döndüren :func:`sorted` fonksiyonunu kullanın. ::

source: Using :func:`set` on a sequence eliminates duplicate elements. The use of :func:`sorted` in combination with :func:`set` over a sequence is an idiomatic way to loop over unique elements of the sequence in sorted order. ::
tr: Bir dizi üzerinde :func:`set` kullanmak yinelenen öğeleri ortadan kaldırır. Bir dizi üzerinde :func:`set` ile birlikte :func:`sorted` kullanımı, dizinin benzersiz öğeleri üzerinde sıralı olarak döngü oluşturmanın deyimsel bir yoludur. ::

source: It is sometimes tempting to change a list while you are looping over it; however, it is often simpler and safer to create a new list instead. ::
tr: Bazen bir liste üzerinde döngü yaparken değiştirmek cazip gelebilir; ancak bunun yerine yeni bir liste oluşturmak genellikle daha basit ve daha güvenlidir. ::

source: More on Conditions
tr: Koşullar Üzerine

source: The conditions used in ``while`` and ``if`` statements can contain any operators, not just comparisons.
tr: ``while`` ve ``if`` deyimlerinde kullanılan koşullar sadece karşılaştırma değil, herhangi bir operatör içerebilir.

source: The comparison operators ``in`` and ``not in`` are membership tests that determine whether a value is in (or not in) a container. The operators ``is`` and ``is not`` compare whether two objects are really the same object. All comparison operators have the same priority, which is lower than that of all numerical operators.
tr: Karşılaştırma operatörleri ``in`` ve ``not in`` bir değerin bir dizide olup olmadığını kontrol eder. ``is`` ve ``is not`` operatörleri iki nesnenin gerçekten aynı nesne olup olmadığını karşılaştırır. Tüm karşılaştırma operatörleri aynı önceliğe sahiptir, bu öncelik ise tüm sayısal operatörlerden daha düşüktür.

source: Comparisons can be chained. For example, ``a < b == c`` tests whether ``a`` is less than ``b`` and moreover ``b`` equals ``c``.
tr: Karşılaştırmalar art arda zincirlenebilir. Örneğin, ``a < b == c`` ifadesi ``a`` değerinin ``b`` değerinden küçük olup olmadığını test ederken aynı zamanda ``b`` değerinin ``c`` değerine eşit olup olmadığını test eder.

source: Comparisons may be combined using the Boolean operators ``and`` and ``or``, and the outcome of a comparison (or of any other Boolean expression) may be negated with ``not``. These have lower priorities than comparison operators; between them, ``not`` has the highest priority and ``or`` the lowest, so that ``A and not B or C`` is equivalent to ``(A and (not B)) or C``. As always, parentheses can be used to express the desired composition.
tr: Karşılaştırmalar ``and`` ve ``or`` Boolean operatörleri kullanılarak birleştirilebilir ve bir karşılaştırmanın (veya başka bir Boolean ifadesinin) sonucu ``not`` ile olumsuzlanabilir. Bunlar karşılaştırma operatörlerinden daha düşük önceliklere sahiptir; aralarında, ``not`` en yüksek önceliğe ve ``or`` en düşük önceliğe sahiptir, böylece ``A ve B değil veya C``, ``(A ve (B değil)) veya C`` ile eş değerdir. Her zaman olduğu gibi, istenen bileşimi ifade etmek için parantezler kullanılabilir.

source: The Boolean operators ``and`` and ``or`` are so-called *short-circuit* operators: their arguments are evaluated from left to right, and evaluation stops as soon as the outcome is determined. For example, if ``A`` and ``C`` are true but ``B`` is false, ``A and B and C`` does not evaluate the expression ``C``. When used as a general value and not as a Boolean, the return value of a short-circuit operator is the last evaluated argument.
tr: Boolean operatörleri ``and`` ve ``or`` *kısa devre* operatörleri olarak adlandırılır: argümanları soldan sağa doğru değerlendirilir ve sonuç belirlenir belirlenmez değerlendirme durur. Örneğin, ``A`` ve ``C`` doğru ancak ``B`` yanlış ise, ``A ve B ve C`` ``C`` ifadesini değerlendirmez. Boolean olarak değil de genel bir değer olarak kullanıldığında, kısa devre işlecinin dönüş değeri son değerlendirilen bağımsız değişkendir.

source: It is possible to assign the result of a comparison or other Boolean expression to a variable. For example, ::
tr: Bir değişkene, bir karşılaştırmanın sonucunu veya başka bir Boolean ifadesini atamak mümkündür. Örneğin::

source: Note that in Python, unlike C, assignment inside expressions must be done explicitly with the :ref:`walrus operator <why-can-t-i-use-an-assignment-in-an-expression>` ``:=``. This avoids a common class of problems encountered in C programs: typing ``=`` in an expression when ``==`` was intended.
tr: Python'da, C'den farklı olarak, ifadelerin içindeki atamanın :ref:`walrus operatörü <why-can-t-i-use-an-assignment-in-an-expression>` ``=`` ile açıkça yapılması gerektiğini unutmayın. Bu, C programlarında karşılaşılan yaygın bir sorunu önler: ``==`` yazmak isterken ``=`` yazmak.

source: Comparing Sequences and Other Types
tr: Diziler ile Diğer Veri Tiplerinin Karşılaştırılması

source: Sequence objects typically may be compared to other objects with the same sequence type. The comparison uses *lexicographical* ordering: first the first two items are compared, and if they differ this determines the outcome of the comparison; if they are equal, the next two items are compared, and so on, until either sequence is exhausted. If two items to be compared are themselves sequences of the same type, the lexicographical comparison is carried out recursively. If all items of two sequences compare equal, the sequences are considered equal. If one sequence is an initial sub-sequence of the other, the shorter sequence is the smaller (lesser) one. Lexicographical ordering for strings uses the Unicode code point number to order individual characters. Some examples of comparisons between sequences of the same type::
tr: Dizi nesneleri tipik olarak aynı dizi türüne sahip diğer nesnelerle karşılaştırılabilir. Karşılaştırmada *sözlüksel* sıralama kullanılır: önce ilk iki öğe karşılaştırılır ve farklılarsa bu karşılaştırmanın sonucunu belirler; eşitlerse, sonraki iki öğe karşılaştırılır ve her iki dizi de tükenene kadar böyle devam eder. Karşılaştırılacak iki öğenin kendileri de aynı türden diziler ise, sözlükbilimsel karşılaştırma özyinelemeli olarak gerçekleştirilir. İki dizinin tüm öğeleri eşit çıkarsa, diziler eşit kabul edilir. Eğer dizilerden biri diğerinin alt dizisi ise, daha kısa olan dizi daha küçük (küçük) olandır. Dizgiler için sözlükbilimsel sıralama, tek tek karakterleri sıralamak için Unicode kod noktası numarasını kullanır. Aynı türdeki diziler arasındaki karşılaştırmalara bazı örnekler::

source: Note that comparing objects of different types with ``<`` or ``>`` is legal provided that the objects have appropriate comparison methods. For example, mixed numeric types are compared according to their numeric value, so 0 equals 0.0, etc. Otherwise, rather than providing an arbitrary ordering, the interpreter will raise a :exc:`TypeError` exception.
tr: Nesnelerin uygun karşılaştırma yöntemlerine sahip olması koşuluyla, farklı türlerdeki nesnelerin ``<`` veya ``>`` ile karşılaştırılabileceğini unutmayın. Örneğin, karışık sayısal türler sayısal değerlerine göre karşılaştırılır, bu nedenle 0 eşittir 0.0, vb. Bu türler uygun yöntemlere sahip değillerse, yorumlayıcı rastgele bir sıralama döndürmek yerine :exc:`TypeError` hatası verir.

source: Footnotes
tr: Dipnotlar

source: Other languages may return the mutated object, which allows method chaining, such as ``d->insert("a")->remove("b")->sort();``.
tr: Diğer diller, ``d->insert("a")->remove("b")->sort();`` gibi yöntem zincirlemesine izin veren değiştirilmiş nesneyi döndürebilir.
