Repository: python/python-docs-tr
Catalog: tutorial/errors.po
Languages: tr

source: Errors and Exceptions
tr: Hatalar ve Özel Durumlar

source: Until now error messages haven't been more than mentioned, but if you have tried out the examples you have probably seen some. There are (at least) two distinguishable kinds of errors: *syntax errors* and *exceptions*.
tr: Şimdiye kadar hata mesajlarından fazla bahsedilmedi, ancak örnekleri denediyseniz muhtemelen bazılarını görmüşsünüzdür. (En azından) iki ayırt edilebilir hata türü vardır: *söz dizimi hataları* (*syntax errors*) ve *özel durumlar* (*exceptions*).

source: Syntax Errors
tr: Söz Dizimi Hataları

source: Syntax errors, also known as parsing errors, are perhaps the most common kind of complaint you get while you are still learning Python::
tr: Ayrıştırma hataları olarak da bilinen söz dizimi hataları, Python öğrenirken belki de en sık karşılaşılan hatalardan biridir::

source: The parser repeats the offending line and displays a little 'arrow' pointing at the earliest point in the line where the error was detected. The error is caused by (or at least detected at) the token *preceding* the arrow: in the example, the error is detected at the function :func:`print`, since a colon (``':'``) is missing before it. File name and line number are printed so you know where to look in case the input came from a script.
tr: Ayrıştırıcı, hatalı satırı yineler ve hatanın algılandığı en erken noktayı gösteren küçük bir 'ok' görüntüler. Hata oktan *önceki* dizgede meydana gelmiştir: örnekte, hata :func:`print` fonksiyonunda algılanır, çünkü öncesinde iki nokta üst üste (``':'``) eksiktir. Dosya adı ve satır numarası yazdırılır, böylece girişin bir komut dosyasından gelmesi durumunda nereye bakacağınızı bilirsiniz.

source: Exceptions
tr: Özel Durumlar

source: Even if a statement or expression is syntactically correct, it may cause an error when an attempt is made to execute it. Errors detected during execution are called *exceptions* and are not unconditionally fatal: you will soon learn how to handle them in Python programs. Most exceptions are not handled by programs, however, and result in error messages as shown here::
tr: Bir komut veya ifade söz dizimsel olarak doğru olsa bile, yürütülmeye çalışıldığında hataya neden olabilir. Yürütme sırasında algılanan hatalara *exceptions (özel durumlar)* denir ve bazıları programlar için kritik değildir: yakında Python programlarında bunların üstesinden gelmeyi öğreneceksiniz. Ancak, çoğu özel durum programlar tarafından önlenemez ve burada gösterildiği gibi hata iletileriyle sonuçlanır::

source: The last line of the error message indicates what happened. Exceptions come in different types, and the type is printed as part of the message: the types in the example are :exc:`ZeroDivisionError`, :exc:`NameError` and :exc:`TypeError`. The string printed as the exception type is the name of the built-in exception that occurred. This is true for all built-in exceptions, but need not be true for user-defined exceptions (although it is a useful convention). Standard exception names are built-in identifiers (not reserved keywords).
tr: Hata iletisinin son satırı hataya neyin sebep olduğu gösterir. Özel durumlar farklı türlerde gelir ve tür iletinin bir parçası olarak yazdırılır: örnekteki türler şunlardır :exc:`ZeroDivisionError`, :exc:`NameError` ve :exc:`TypeError`. Özel durum türü olarak yazdırılan dize, oluşan gömülü özel durumun adıdır. Bu, tüm gömülü özel durumlar için geçerlidir, ancak kullanıcı tanımlı özel durumlar için doğru olması gerekmez (yararlı bir kural olmasına rağmen). Standart özel durum adları gömülü tanımlayıcılardır (ayrılmış anahtar sözcükler değildir).

source: The rest of the line provides detail based on the type of exception and what caused it.
tr: Satırın geri kalanı, özel durum türüne ve buna neyin neden olduğuna bağlı olarak ayrıntı gösterir.

source: The preceding part of the error message shows the context where the exception occurred, in the form of a stack traceback. In general it contains a stack traceback listing source lines; however, it will not display lines read from standard input.
tr: Hata iletisinin önceki bölümü, özel durumun oluştuğu bağlamı yığın izleme geri dönüşü biçiminde gösterir. Genel olarak, kaynak satırları listeleyen bir yığın izleme listesi içerir; ancak, standart girişten okunan satırları görüntülemez.

source: :ref:`bltin-exceptions` lists the built-in exceptions and their meanings.
tr: :ref:`bltin-exceptions` yerleşik özel durumları ve anlamlarını listeler.

source: Handling Exceptions
tr: Özel Durumları İşleme

source: It is possible to write programs that handle selected exceptions. Look at the following example, which asks the user for input until a valid integer has been entered, but allows the user to interrupt the program (using :kbd:`Control-C` or whatever the operating system supports); note that a user-generated interruption is signalled by raising the :exc:`KeyboardInterrupt` exception. ::
tr: Seçili özel durumları işleyen programlar yazmak mümkündür. Geçerli bir tam sayı girilene kadar kullanıcıdan giriş isteyen, ancak kullanıcının programı kesmesine izin veren aşağıdaki örneğe bakın (:kbd:`Control-C` veya işletim sistemi ne destekliyorsa onu kullanarak); kullanıcı kaynaklı kesintilerin :exc:`KeyboardInterrupt` özel durumu ile gösterildiğini unutmayın. ::

source: The :keyword:`try` statement works as follows.
tr: :keyword:`try` ifadesi aşağıdaki gibi çalışır.

source: First, the *try clause* (the statement(s) between the :keyword:`try` and :keyword:`except` keywords) is executed.
tr: İlk olarak, *try yan tümcesi* (:keyword:`try` ve :keyword:`except` anahtar kelimeleri arasındaki ifadeler) yürütülür.

source: If no exception occurs, the *except clause* is skipped and execution of the :keyword:`try` statement is finished.
tr: Özel durum oluşmazsa, *except yan tümcesi* atlanır ve :keyword:`try` ifadesinin yürütülmesi tamamlanır.

source: If an exception occurs during execution of the :keyword:`try` clause, the rest of the clause is skipped. Then, if its type matches the exception named after the :keyword:`except` keyword, the *except clause* is executed, and then execution continues after the try/except block.
tr: :keyword:`try` yan tümcesinin yürütülmesi sırasında bir özel durum oluşursa, yan tümcenin geri kalanı atlanır. Daha sonra belirtilen :keyword:`except` türü ile karşılaşılırsa, *except yan tümcesi* yürütülür ve try/except bloğundan sonra yürütme devam eder.

source: If an exception occurs which does not match the exception named in the *except clause*, it is passed on to outer :keyword:`try` statements; if no handler is found, it is an *unhandled exception* and execution stops with a message as shown above.
tr: *except yan tümcesinde* adı geçen özel durumla eşleşmeyen bir özel durum oluşursa, daha dışarıda olan :keyword:`try` ifadelerine geçirilir; işleyici bulunamazsa, bu bir *işlenmeyen özel durum* olur ve yürütme yukarıda gösterildiği gibi bir iletiyle durur.

source: A :keyword:`try` statement may have more than one *except clause*, to specify handlers for different exceptions. At most one handler will be executed. Handlers only handle exceptions that occur in the corresponding *try clause*, not in other handlers of the same :keyword:`!try` statement. An *except clause* may name multiple exceptions as a parenthesized tuple, for example::
tr: :keyword:`try` ifadesi, farklı özel durumlar için işleyiciler belirtmek üzere birden fazla *except yan tümcesi* alabilir. Maksimum bir tane işleyici yürütülür. İşleyiciler yalnızca karşılık gelen *try yan tümcesinde* oluşan özel durumları işler, aynı :keyword:`!try` ifadesinin diğer işleyicilerinde işlemez. *except yan tümcesi* birden çok özel durumu parantezli demet olarak adlandırabilir, örneğin::

source: A class in an :keyword:`except` clause is compatible with an exception if it is the same class or a base class thereof (but not the other way around --- an *except clause* listing a derived class is not compatible with a base class). For example, the following code will print B, C, D in that order::
tr: :keyword:`except` yan tümcesi, aynı sınıf veya temel sınıf ise özel durum ile uyumludur (ancak türetilmiş bir sınıfı listeleyen *except yan tümcesi* temel sınıfla uyumlu olmadığından tersi olamaz). Örneğin, aşağıdaki kod B, C, D'yi bu sırada yazdırır::

source: Note that if the *except clauses* were reversed (with ``except B`` first), it would have printed B, B, B --- the first matching *except clause* is triggered.
tr: *except yan tümceleri* tersine çevrilmişse (ilk olarak ``except B`` ile) B, B, B şeklinde yazdırılacaktır --- ilk eşleşen *except yan tümcesi* tetiklenir.

source: When an exception occurs, it may have associated values, also known as the exception's *arguments*. The presence and types of the arguments depend on the exception type.
tr: Bir istisna oluştuğunda, istisnanın *argümanı* olarak da bilinen ilişkili bir değeri olabilir. Argümanın varlığı ve türü, istisna türüne bağlıdır.

source: The *except clause* may specify a variable after the exception name. The variable is bound to the exception instance which typically has an ``args`` attribute that stores the arguments. For convenience, builtin exception types define :meth:`__str__` to print all the arguments without explicitly accessing ``.args``. ::
tr: *except yan tümcesi*, istisna adından sonra bir değişken belirtebilir. Değişken, genellikle bağımsız değişkenleri depolayan bir ``args`` özniteliğine sahip istisna örneğine bağlıdır. Kolaylık sağlamak için, yerleşik istisna türleri :meth:`__str__`, ``.args`` öğesine açıkça erişmeden tüm argümanları yazdırmak için tanımlar. ::

source: The exception's :meth:`__str__` output is printed as the last part ('detail') of the message for unhandled exceptions.
tr: İstisnanın :meth:`__str__` çıktısı, işlenmeyen istisnalar için mesajın son kısmı ('ayrıntı') olarak yazdırılır.

source: :exc:`BaseException` is the common base class of all exceptions. One of its subclasses, :exc:`Exception`, is the base class of all the non-fatal exceptions. Exceptions which are not subclasses of :exc:`Exception` are not typically handled, because they are used to indicate that the program should terminate. They include :exc:`SystemExit` which is raised by :meth:`sys.exit` and :exc:`KeyboardInterrupt` which is raised when a user wishes to interrupt the program.
tr: :exc:`BaseException`, tüm istisnaların ortak temel sınıfıdır. Alt sınıflarından biri olan :exc:`Exception`, tüm önemli olmayan istisnaların temel sınıfıdır. :exc:`Exception` öğesinin alt sınıfları olmayan istisnalar genellikle işlenmez, çünkü bunlar programın sona ermesi gerektiğini belirtmek için kullanılır. Bunlar :meth:`sys.exit` tarafından oluşturulan :exc:`SystemExit` ve bir kullanıcı programı kesmek istediğinde ortaya çıkan :exc:`KeyboardInterrupt` içerir.

source: :exc:`Exception` can be used as a wildcard that catches (almost) everything. However, it is good practice to be as specific as possible with the types of exceptions that we intend to handle, and to allow any unexpected exceptions to propagate on.
tr: :exc:`Exception` (neredeyse) her şeyi yakalayan bir joker karakter (wildcard) olarak kullanılabilir. Ancak, işlemeyi amaçladığımız istisna türleri konusunda mümkün olduğunca spesifik olmak ve beklenmeyen istisnaların yayılmasına izin vermek iyi bir uygulamadır.

source: The most common pattern for handling :exc:`Exception` is to print or log the exception and then re-raise it (allowing a caller to handle the exception as well)::
tr: :exc:`Exception` işlemek için en yaygın model, istisnayı yazdırmak veya log'a kaydetmek ve ardından yeniden yükseltmektir (arayanın istisnayı da işlemesine izin verir)::

source: The :keyword:`try` ... :keyword:`except` statement has an optional *else clause*, which, when present, must follow all *except clauses*. It is useful for code that must be executed if the *try clause* does not raise an exception. For example::
tr: :keyword:`try` ... :keyword:`except` ifadesinin isteğe bağlı bir *else yan tümcesi* vardır, bu da mevcut olduğunda tüm *except yan tümcelerini* izlemelidir. *try yan tümcesi* bir özel durum oluşturmazsa yürütülmesi gereken kod için yararlıdır. Mesela::

source: The use of the :keyword:`!else` clause is better than adding additional code to the :keyword:`try` clause because it avoids accidentally catching an exception that wasn't raised by the code being protected by the :keyword:`!try` ... :keyword:`!except` statement.
tr: :keyword:`!else` yan tümcesinin kullanılması, :keyword:`try` yan tümcesine ek kod eklemekten daha iyidir çünkü yanlışlıkla :keyword:`!try` tarafından korunan kod tarafından oluşturulmamış bir istisnayı yakalamayı önler. ... :keyword:`!except` ifadesi.

source: Exception handlers do not handle only exceptions that occur immediately in the *try clause*, but also those that occur inside functions that are called (even indirectly) in the *try clause*. For example::
tr: İstisna işleyicileri, yalnızca *try yan tümcesinde* anında ortaya çıkan istisnaları değil, aynı zamanda *try yan tümcesinde* çağrılan (dolaylı olarak da olsa) işlevlerin içinde oluşan istisnaları da işler. Örneğin::

source: Raising Exceptions
tr: Hata Yükseltme

source: The :keyword:`raise` statement allows the programmer to force a specified exception to occur. For example::
tr: :keyword:`raise` ifadesi, programcının belirli bir istisnanın gerçekleşmesini zorlamasını sağlar. Örneğin::

source: The sole argument to :keyword:`raise` indicates the exception to be raised. This must be either an exception instance or an exception class (a class that derives from :class:`BaseException`, such as :exc:`Exception` or one of its subclasses). If an exception class is passed, it will be implicitly instantiated by calling its constructor with no arguments::
tr: :keyword:`raise` için tek argüman, ortaya çıkacak istisnayı belirtir. Bu, bir istisna örneği veya bir istisna sınıfı (:class:`BaseException` 'dan türetilen bir sınıf, örneğin :exc:`Exception` veya alt sınıflarından) olmalıdır. Bir istisna sınıfı iletilirse, yapıcısını hiçbir argüman olmadan çağırarak dolaylı olarak başlatılır::

source: If you need to determine whether an exception was raised but don't intend to handle it, a simpler form of the :keyword:`raise` statement allows you to re-raise the exception::
tr: Bir istisnanın oluşturulup oluşturulmadığını belirlemeniz gerekiyorsa ancak onu işlemeyi düşünmüyorsanız, :keyword:`raise` ifadesinin daha basit bir biçimi, istisnayı yeniden oluşturmanıza olanak tanır::

source: Exception Chaining
tr: İstisna Zincirleme

source: If an unhandled exception occurs inside an :keyword:`except` section, it will have the exception being handled attached to it and included in the error message::
tr: Bir :keyword:`except` bölümü içinde işlenmeyen bir istisna meydana gelirse, istisnanın kendisine eklenmiş olarak işlenmesi ve şu hata mesajına dahil edilmesi gerekir::

source: To indicate that an exception is a direct consequence of another, the :keyword:`raise` statement allows an optional :keyword:`from<raise>` clause::
tr: :keyword:`raise` ifadesi, bir istisnanın başka bir istisnanın doğrudan sonucu olduğunu belirtmek için isteğe bağlı :keyword:`from<raise>` yan tümcesine izin verir::

source: This can be useful when you are transforming exceptions. For example::
tr: Bu, özel durumları dönüştürürken yararlı olabilir. Mesela::

source: It also allows disabling automatic exception chaining using the ``from None`` idiom::
tr: Ayrıca, ``from None`` deyimi kullanılarak otomatik istisna zincirlemenin devre dışı bırakılmasına izin verir::

source: For more information about chaining mechanics, see :ref:`bltin-exceptions`.
tr: Zincirleme mekaniği hakkında daha fazla bilgi için bkz. :ref:`bltin-exceptions`.

source: User-defined Exceptions
tr: Kullanıcı Tanımlı İstisnalar

source: Programs may name their own exceptions by creating a new exception class (see :ref:`tut-classes` for more about Python classes). Exceptions should typically be derived from the :exc:`Exception` class, either directly or indirectly.
tr: Programlar yeni bir istisna sınıfı oluşturarak kendi özel durumlarını adlandırabilir (Python sınıfları hakkında daha fazla bilgi için bkz: :ref:`tut-classes` ). Özel durumlar genellikle doğrudan veya dolaylı olarak :exc:`Exception` sınıfından türetilmelidir.

source: Exception classes can be defined which do anything any other class can do, but are usually kept simple, often only offering a number of attributes that allow information about the error to be extracted by handlers for the exception.
tr: İstisna sınıfları, başka herhangi bir sınıfın yapabileceği her şeyi yapan tanımlanabilir, ancak genellikle basit tutulur ve çoğu zaman yalnızca istisna için işleyiciler tarafından hatayla ilgili bilgilerin çıkarılmasına izin veren bir dizi öznitelik sunar.

source: Most exceptions are defined with names that end in "Error", similar to the naming of the standard exceptions.
tr: Çoğu özel durum, standart özel durumların adlandırışına benzer şekilde "Hata" ile biten adlarla tanımlanır.

source: Many standard modules define their own exceptions to report errors that may occur in functions they define.
tr: Birçok standart modül, tanımladıkları işlevlerde oluşabilecek hataları raporlamak için kendi istisnalarını tanımlar.

source: Defining Clean-up Actions
tr: Temizleme Eylemlerini Tanımlama

source: The :keyword:`try` statement has another optional clause which is intended to define clean-up actions that must be executed under all circumstances. For example::
tr: :keyword:`try` deyimi, her koşulda yürütülmesi gereken temizleme eylemlerini tanımlamayı amaçlayan başka bir opsiyonel yan tümceye sahiptir. Mesela::

source: If a :keyword:`finally` clause is present, the :keyword:`!finally` clause will execute as the last task before the :keyword:`try` statement completes. The :keyword:`!finally` clause runs whether or not the :keyword:`!try` statement produces an exception. The following points discuss more complex cases when an exception occurs:
tr: Bir :keyword:`finally` yan tümcesi varsa, :keyword:`!finally` yan tümcesi :keyword:`try` deyimi tamamlanmadan önceki son görev olarak yürütülür. :keyword:`!finally` yan tümcesi :keyword:`!try` deyiminin bir istisna oluşturup oluşturmadığından bağımsız çalışır. Aşağıdaki noktalarda, bir istisna oluştuğunda daha karmaşık durumlar anlatılmaktadır:

source: If an exception occurs during execution of the :keyword:`!try` clause, the exception may be handled by an :keyword:`except` clause. If the exception is not handled by an :keyword:`!except` clause, the exception is re-raised after the :keyword:`!finally` clause has been executed.
tr: :keyword:`!try` yan tümcesinin yürütülmesi sırasında bir istisna oluşursa, istisna bir :keyword:`except` yan tümcesi tarafından işlenebilir. İstisna bir :keyword:`!except` yan tümcesi tarafından ele alınmıyorsa, istisna :keyword:`!finally` yan tümcesi yürütüldükten sonra yeniden oluşturulur.

source: An exception could occur during execution of an :keyword:`!except` or :keyword:`!else` clause. Again, the exception is re-raised after the :keyword:`!finally` clause has been executed.
tr: Bir :keyword:`!except` veya :keyword:`!else` yan tümcesinin yürütülmesi sırasında bir istisna oluşabilir. Yine, istisna, :keyword:`!finally` yan tümcesi yürütüldükten sonra yeniden oluşturulur.

source: If the :keyword:`!finally` clause executes a :keyword:`break`, :keyword:`continue` or :keyword:`return` statement, exceptions are not re-raised.
tr: :keyword:`!finally` yan tümcesi bir :keyword:`break`, :keyword:`continue` veya :keyword:`return` deyimini yürütürse, istisnalar yeniden oluşturulmaz.

source: If the :keyword:`!try` statement reaches a :keyword:`break`, :keyword:`continue` or :keyword:`return` statement, the :keyword:`!finally` clause will execute just prior to the :keyword:`!break`, :keyword:`!continue` or :keyword:`!return` statement's execution.
tr: :keyword:`!try` ifadesi bir :keyword:`break`, :keyword:`continue` veya :keyword:`return` ifadesine ulaşırsa, :keyword:`!finally` yan tümcesi :keyword:`!break`, :keyword:`!continue` veya :keyword:`!return` ifadesinin yürütülmesinin hemen öncesinde yürütülür.

source: If a :keyword:`!finally` clause includes a :keyword:`!return` statement, the returned value will be the one from the :keyword:`!finally` clause's :keyword:`!return` statement, not the value from the :keyword:`!try` clause's :keyword:`!return` statement.
tr: Bir :keyword:`!finally` yan tümcesi bir :keyword:`!return` ifadesini içeriyorsa, döndürülen değer, :keyword:`!finally` yan tümcesinin :keyword:`!return` ifadesindeki değer olacaktır, :keyword:`!try` yan tümcesinin :keyword:`!return` ifadesindeki değer değil.

source: For example::
tr: Mesela::

source: A more complicated example::
tr: Daha karmaşık bir örnek::

source: As you can see, the :keyword:`finally` clause is executed in any event. The :exc:`TypeError` raised by dividing two strings is not handled by the :keyword:`except` clause and therefore re-raised after the :keyword:`!finally` clause has been executed.
tr: Gördüğünüz gibi, :keyword:`finally` yan tümcesi her durumda yürütülür. İki dizeyi bölerek oluşturulan :exc:`TypeError`, :keyword:`except` yan tümcesi tarafından işlenmez ve bu nedenle :keyword:`!finally` yan tümcesi yürütüldikten sonra yeniden yükseltilir.

source: In real world applications, the :keyword:`finally` clause is useful for releasing external resources (such as files or network connections), regardless of whether the use of the resource was successful.
tr: Gerçek dünyadaki uygulamalarda :keyword:`finally` yan tümcesi, kaynağın kullanımının başarılı olup olmadığına bakılmaksızın dış kaynakları (dosyalar veya ağ bağlantıları gibi) serbest bırakmak için yararlıdır.

source: Predefined Clean-up Actions
tr: Önceden Tanımlanmış Temizleme Eylemleri

source: Some objects define standard clean-up actions to be undertaken when the object is no longer needed, regardless of whether or not the operation using the object succeeded or failed. Look at the following example, which tries to open a file and print its contents to the screen. ::
tr: Bazı nesneler, nesneyi kullanan işlemin başarılı veya başarısız olup olmadığına bakılmaksızın, nesne artık gerekli olmadığında gerçekleştirilecek standart temizleme eylemlerini tanımlar. Bir dosyayı açmaya ve içeriğini ekrana yazdırmaya çalışan aşağıdaki örneğe bakın. ::

source: The problem with this code is that it leaves the file open for an indeterminate amount of time after this part of the code has finished executing. This is not an issue in simple scripts, but can be a problem for larger applications. The :keyword:`with` statement allows objects like files to be used in a way that ensures they are always cleaned up promptly and correctly. ::
tr: Bu kodla ilgili sorun, kodun bu bölümünün yürütülmesi tamamlandıktan sonra dosyayı belirsiz bir süre açık bırakmasıdır. Bu basit komut dosyalarında bir sorun değildir, ancak daha büyük uygulamalar için bir sorun olabilir. :keyword:`with` ifadesi, dosyalar gibi nesnelerin her zaman hızlı ve doğru temizlenmesini sağlayacak şekilde kullanılmasına izin verir. ::

source: After the statement is executed, the file *f* is always closed, even if a problem was encountered while processing the lines. Objects which, like files, provide predefined clean-up actions will indicate this in their documentation.
tr: İfade çalıştırıldıktan sonra, satırlar işlenirken bir sorunla karşılaşılsa bile *f* dosyası her zaman kapatılır. Dosyalar gibi önceden tanımlanmış temizleme eylemleri sağlayan nesneler dokümantasyonlarında bunu gösterir.

source: Raising and Handling Multiple Unrelated Exceptions
tr: Birden Fazla Alakasız İstisna Oluşturma ve İşleme
