Repository: python/python-docs-tr
Catalog: tutorial/inputoutput.po
Languages: tr

source: File objects have some additional methods, such as :meth:`~file.isatty` and :meth:`~file.truncate` which are less frequently used; consult the Library Reference for a complete guide to file objects.
tr: Dosya nesnelerinin daha az kullanılan :meth:`~file.isatty` ve :meth:`~file.truncate` gibi bazı ek metotları vardır; dosya nesneleri için eksiksiz bir kılavuz için Kütüphane Referansı'na bakın.

source: Saving structured data with :mod:`json`
tr: Yapılandırılmış verileri :mod:`json` ile kaydetme

source: Strings can easily be written to and read from a file. Numbers take a bit more effort, since the :meth:`read` method only returns strings, which will have to be passed to a function like :func:`int`, which takes a string like ``'123'`` and returns its numeric value 123. When you want to save more complex data types like nested lists and dictionaries, parsing and serializing by hand becomes complicated.
tr: Dizeler bir dosyaya kolayca yazılabilir ve dosyadan okunabilir. Sayılar biraz daha fazla çaba gerektirir, çünkü :meth:`read` yöntemi yalnızca ``'123'`` gibi bir dize alan ve sayısal değeri 123'ü döndüren :func:`int` gibi bir işleve geçirilmesi gereken dizeleri döndürür. İç içe geçmiş listeler ve sözlükler gibi daha karmaşık veri türlerini kaydetmek istediğinizde, elle ayrıştırma ve seri hale getirmek karmaşık hale gelir.

source: Rather than having users constantly writing and debugging code to save complicated data types to files, Python allows you to use the popular data interchange format called `JSON (JavaScript Object Notation) <https://json.org>`_. The standard module called :mod:`json` can take Python data hierarchies, and convert them to string representations; this process is called :dfn:`serializing`. Reconstructing the data from the string representation is called :dfn:`deserializing`. Between serializing and deserializing, the string representing the object may have been stored in a file or data, or sent over a network connection to some distant machine.
tr: Python, kullanıcıların karmaşık veri türlerini dosyalara kaydetmek için sürekli olarak kod yazmasını ve hata ayıklamasını sağlamak yerine, `JSON (JavaScript Object Notation) <https://json.org>`_ adlı popüler veri değişim biçimini kullanmanıza olanak tanır. :mod:`json` adlı standart modül, Python veri hiyerarşilerini alabilir ve bunları dize temsillerine dönüştürebilir; bu işleme :dfn:`serializing` adı verilir. Dize gösteriminden verilerin yeniden yapılandırılmasına :dfn:`deserializing` denir. Serileştirme ve seri durumdan çıkarma arasında, nesneyi temsil eden dizi bir dosyada veya veride saklanmış olabilir veya bir ağ bağlantısı üzerinden uzaktaki bir makineye gönderilmiş olabilir.

source: The JSON format is commonly used by modern applications to allow for data exchange. Many programmers are already familiar with it, which makes it a good choice for interoperability.
tr: JSON biçimi, veri alışverişine izin vermek için modern uygulamalar tarafından yaygın olarak kullanılır. Birçok programcı zaten buna aşinadır, bu da onu birlikte çalışabilirlik için iyi bir seçim haline getirir.

source: If you have an object ``x``, you can view its JSON string representation with a simple line of code::
tr: ``x`` nesnesiniz varsa, JSON dize gösterimini basit bir kod satırıyla görüntüleyebilirsiniz::

source: Another variant of the :func:`~json.dumps` function, called :func:`~json.dump`, simply serializes the object to a :term:`text file`. So if ``f`` is a :term:`text file` object opened for writing, we can do this::
tr: :func:`~json.dumps` işlevinin başka bir çeşidi, :func:`~json.dump` adı verilen nesneyi bir :term:`text file` (metin dosyası) olarak seri hale getirmektedir. Yani ``f`` bir :term:`text file` nesnesi yazmak için açılmışsa, bunu yapabiliriz::

source: To decode the object again, if ``f`` is a :term:`binary file` or :term:`text file` object which has been opened for reading::
tr: Nesnenin kodunu tekrar çözmek için, ``f`` okuma için açılmış bir :term:`binary file` veya :term:`text file` nesnesiyse::

source: JSON files must be encoded in UTF-8. Use ``encoding="utf-8"`` when opening JSON file as a :term:`text file` for both of reading and writing.
tr: JSON dosyaları UTF-8'de kodlanmalıdır. Hem okuma hem de yazma için JSON dosyasını :term:`text file` olarak açarken ``encoding="utf-8"`` kullanın.

source: This simple serialization technique can handle lists and dictionaries, but serializing arbitrary class instances in JSON requires a bit of extra effort. The reference for the :mod:`json` module contains an explanation of this.
tr: Bu basit seri hale getirme tekniği listeleri ve sözlükleri işleyebilir, ancak JSON'da rasgele sınıf örneklerini seri hale getirmek biraz daha fazla çaba gerektirir. :mod:`json` modülü için olan örnek bunun bir açıklamasını içerir.

source: :mod:`pickle` - the pickle module
tr: :mod:`pickle` - pickle modülü

source: Contrary to :ref:`JSON <tut-json>`, *pickle* is a protocol which allows the serialization of arbitrarily complex Python objects. As such, it is specific to Python and cannot be used to communicate with applications written in other languages. It is also insecure by default: deserializing pickle data coming from an untrusted source can execute arbitrary code, if the data was crafted by a skilled attacker.
tr: :ref:`JSON <tut-json>` ifadesinin aksine, *pickle*, gelişigüzel olarak karmaşık Python nesnelerinin seri hale getirilmesine izin veren bir protokoldür. Bu nedenle, Python'a özgüdür ve diğer dillerde yazılmış uygulamalarla iletişim kurmak için kullanılamaz. Varsayılan olarak da güvensizdir: güvenilmeyen bir kaynaktan gelen pickle verilerinin dizilerinin seri halden çıkarılması, veriler yetenekli bir saldırgan tarafından hazırlanmışsa rasgele kod yürütebilir.
