Repository: python/python-docs-tr
Catalog: tutorial/inputoutput.po
Languages: tr

source: Input and Output
tr: Girdi ve Çıktı

source: There are several ways to present the output of a program; data can be printed in a human-readable form, or written to a file for future use. This chapter will discuss some of the possibilities.
tr: Bir programın çıktısını sunmanın birkaç yolu vardır; veriler okunabilir bir biçimde yazdırılabilir veya ileride kullanılmak üzere bir dosyaya yazılabilir. Bu bölümde bazı olasılıklar tartışılacaktır.

source: Fancier Output Formatting
tr: Güzel Çıktı Biçimlendirmesi

source: So far we've encountered two ways of writing values: *expression statements* and the :func:`print` function. (A third way is using the :meth:`write` method of file objects; the standard output file can be referenced as ``sys.stdout``. See the Library Reference for more information on this.)
tr: Şimdiye kadar iki değer yazma yolu ile karşılaştık: *expression statements* ve :func:`print` fonksiyonu. (Üçüncü bir yol, dosya nesnelerinin :meth:`write` yöntemini kullanmaktır; standart çıktı dosyasına ``sys.stdout`` olarak başvurulabilir. Bu konuda daha fazla bilgi için Kütüphane Referansı'na bakın.)

source: Often you'll want more control over the formatting of your output than simply printing space-separated values. There are several ways to format output.
tr: Genellikle, yalnızca boşlukla ayrılmış değerleri yazdırmaktansa, çıktınızın biçimlendirmesi üzerinde daha fazla denetim istersiniz. Çıktıyı biçimlendirmenin birkaç yolu vardır.

source: To use :ref:`formatted string literals <tut-f-strings>`, begin a string with ``f`` or ``F`` before the opening quotation mark or triple quotation mark. Inside this string, you can write a Python expression between ``{`` and ``}`` characters that can refer to variables or literal values.
tr: :ref:`formatted string literals <tut-f-strings>` kullanmak için, açılış tırnak işaretinden veya üç tırnak işaretinden önce ``f`` veya ``F`` ile bir dize başlatın. Bu dizenin içinde, değişkenlere veya hazır bilgi değerlerine başvurabilen ``{`` ve ``}`` karakterleri arasında bir Python ifadesi yazabilirsiniz.

source: The :meth:`str.format` method of strings requires more manual effort. You'll still use ``{`` and ``}`` to mark where a variable will be substituted and can provide detailed formatting directives, but you'll also need to provide the information to be formatted.
tr: :meth:`str.format` dize yöntemi daha manuel çaba gerektirir. Bir değişkenin değiştirileceği yeri işaretlemek için ``{`` ve ``}`` kullanmaya devam edersiniz ve ayrıntılı biçimlendirme yönergeleri sağlayabilirsiniz, ancak biçimlendirilecek bilgileri de sağlamanız gerekir.

source: Finally, you can do all the string handling yourself by using string slicing and concatenation operations to create any layout you can imagine. The string type has some methods that perform useful operations for padding strings to a given column width.
tr: Son olarak, hayal edebileceğiniz herhangi bir düzen oluşturmak için dize dilimleme ve birleştirme işlemlerini kullanarak tüm dize işlemeyi kendiniz yapabilirsiniz. Dize türü, dizeleri belirli bir sütun genişliğine doldurma için yararlı işlemler gerçekleştiren bazı yöntemlere sahiptir.

source: When you don't need fancy output but just want a quick display of some variables for debugging purposes, you can convert any value to a string with the :func:`repr` or :func:`str` functions.
tr: Daha güzel görünen bir çıktıya ihtiyacınız olmadığında, ancak hata ayıklama amacıyla bazı değişkenlerin hızlı bir şekilde görüntülenmesini istediğinizde, herhangi bir değeri :func:`repr` veya :func:`str` işlevleriyle bir dizeye dönüştürebilirsiniz.

source: The :func:`str` function is meant to return representations of values which are fairly human-readable, while :func:`repr` is meant to generate representations which can be read by the interpreter (or will force a :exc:`SyntaxError` if there is no equivalent syntax). For objects which don't have a particular representation for human consumption, :func:`str` will return the same value as :func:`repr`. Many values, such as numbers or structures like lists and dictionaries, have the same representation using either function. Strings, in particular, have two distinct representations.
tr: :func:`str` işlevi açıkça okunabilir değerlerin gösterimlerini döndürmek için, :func:`repr` ise yorumlayıcı tarafından okunabilecek gösterimler oluşturmak içindir (veya eş değer bir sözdizimi yoksa :exc:`SyntaxError` 'ı zorlar). İnsan tüketimi için belirli bir temsili olmayan nesneler için :func:`str`, :func:`repr` ile aynı değeri döndürür. Sayılar veya listeler ve sözlükler benzeri yapılar gibi birçok değer, her iki işlevi de kullanarak aynı gösterime sahiptir. Özellikle dizelerin iki farklı gösterimi vardır.

source: Some examples::
tr: Bazı örnekler::

source: The :mod:`string` module contains a :class:`~string.Template` class that offers yet another way to substitute values into strings, using placeholders like ``$x`` and replacing them with values from a dictionary, but offers much less control of the formatting.
tr: :mod:`string` modülü bir :class:`~string.Template` sınıfını içerir; bu sınıf, ``$x`` gibi yer tutucuları kullanarak ve bunları bir sözlükten değerlerle değiştirerek, değerleri dizelerle değiştirmenin başka bir yolunu sunar, ancak biçimlendirme üzerinde çok daha az kontrol sağlar.

source: Formatted String Literals
tr: Biçimlendirilmiş Dize Değişmezleri

source: :ref:`Formatted string literals <f-strings>` (also called f-strings for short) let you include the value of Python expressions inside a string by prefixing the string with ``f`` or ``F`` and writing expressions as ``{expression}``.
tr: :ref:`Formatted string literals <f-strings>` (kısaltmak için f-string olarak da adlandırılır), dizenin önüne ``f`` veya ``F`` yazarak ve ifadeleri ``{expression}`` olarak yazarak Python ifadelerinin değerini bir dizenin içine eklemenize olanak tanır.

source: An optional format specifier can follow the expression. This allows greater control over how the value is formatted. The following example rounds pi to three places after the decimal::
tr: Opsiyonel biçim belirleyicisi ifadeyi izleyebilir. Bu, değerin nasıl biçimlendirileceğini daha fazla denetlemenizi sağlar. Aşağıdaki örnek pi sayısını ondalık sayıdan sonra üç basamağa yuvarlar::

source: Passing an integer after the ``':'`` will cause that field to be a minimum number of characters wide. This is useful for making columns line up. ::
tr: ``':'`` öğesinin ardından bir tamsayı geçmek, bu alanın en az sayıda karakter genişliğinde olmasına neden olur. Bu, sütunların hizaya getirilmesi için yararlıdır. ::

source: Other modifiers can be used to convert the value before it is formatted. ``'!a'`` applies :func:`ascii`, ``'!s'`` applies :func:`str`, and ``'!r'`` applies :func:`repr`::
tr: Diğer değiştiriciler, değeri biçimlendirilmeden önce dönüştürmek için kullanılabilir. ``'!a'`` :func:`ascii`, ``'!s'`` :func:`str`, ve ``'!r'`` :func:`repr` uygular::

source: The ``=`` specifier can be used to expand an expression to the text of the expression, an equal sign, then the representation of the evaluated expression:
tr: ``=`` belirleyicisi, bir ifadeyi ifadenin metnine, eşittir işaretine ve ardından değerlendirilen ifadenin temsiline genişletmek için kullanılabilir:

source: See :ref:`self-documenting expressions <bpo-36817-whatsnew>` for more information on the ``=`` specifier. For a reference on these format specifications, see the reference guide for the :ref:`formatspec`.
tr: ``=`` belirtici hakkında daha fazla bilgi için :ref:`kendi kendini belgeleyen ifadeler <bpo-36817-whatsnew>` konusuna bakın. Bu biçim belirtimleriyle ilgili bir referans için, :ref:`formatspec` için başvuru kılavuzuna bakın.

source: The String format() Method
tr: String format() Metodu

source: Basic usage of the :meth:`str.format` method looks like this::
tr: :meth:`str.format` metodunun temel kullanımı şöyle görünür::

source: The brackets and characters within them (called format fields) are replaced with the objects passed into the :meth:`str.format` method. A number in the brackets can be used to refer to the position of the object passed into the :meth:`str.format` method. ::
tr: İçlerindeki köşeli ayraçlar ve karakterler (format fields olarak adlandırılır) :meth:`str.format` yöntemine geçirilen nesnelerle değiştirilir. Köşeli ayraçlardaki bir sayı, :meth:`str.format` yöntemine geçirilen nesnenin konumuna başvurmak için kullanılabilir. ::

source: If keyword arguments are used in the :meth:`str.format` method, their values are referred to by using the name of the argument. ::
tr: Anahtar sözcük argümanları :meth:`str.format` yönteminde kullanılıyorsa, değerlerine argümanın adı kullanılarak başvurulmaktadır. ::

source: Positional and keyword arguments can be arbitrarily combined::
tr: Konumsal ve anahtar sözcük argümanları isteğe bağlı olarak birleştirilebilir::

source: If you have a really long format string that you don't want to split up, it would be nice if you could reference the variables to be formatted by name instead of by position. This can be done by simply passing the dict and using square brackets ``'[]'`` to access the keys. ::
tr: Bölmek istemediğiniz gerçekten uzun biçimli bir dizeniz varsa, konuma göre değil de ada göre biçimlendirilecek değişkenlere başvurursanız iyi olur. Bu, sadece dict'i geçirerek ve tuşlara erişmek için ``'[]'`` köşeli ayraçları kullanarak yapılabilir. ::

source: This could also be done by passing the ``table`` dictionary as keyword arguments with the ``**`` notation. ::
tr: Bu, ``table`` sözlüğünü ``**`` gösterimiyle anahtar kelime bağımsız değişkenleri olarak ileterek de yapılabilir. ::

source: This is particularly useful in combination with the built-in function :func:`vars`, which returns a dictionary containing all local variables.
tr: Bu, özellikle tüm yerel değişkenleri içeren bir sözlük döndüren yerleşik işlev :func:`vars` ile birlikte yararlıdır.

source: As an example, the following lines produce a tidily aligned set of columns giving integers and their squares and cubes::
tr: Örnek olarak, aşağıdaki satırlar, tamsayıları ve bunların karelerini ve küplerini veren düzenli bir şekilde hizalanmış bir sütun kümesi oluşturur::

source: For a complete overview of string formatting with :meth:`str.format`, see :ref:`formatstrings`.
tr: :meth:`str.format` ile dize biçimlendirmeye tam bir genel bakış için bkz. :ref:`formatstrings`.

source: Manual String Formatting
tr: Manuel Dize Biçimlendirmesi

source: Here's the same table of squares and cubes, formatted manually::
tr: Manuel olarak biçimlendirilmiş aynı kare ve küp tablosu aşağıdadır::

source: (Note that the one space between each column was added by the way :func:`print` works: it always adds spaces between its arguments.)
tr: (Her sütun arasındaki tek boşluğun :func:`print` çalışma şekliyle ekli olduğunu unutmayın: her zaman argümanları arasına boşluk ekler.)

source: The :meth:`str.rjust` method of string objects right-justifies a string in a field of a given width by padding it with spaces on the left. There are similar methods :meth:`str.ljust` and :meth:`str.center`. These methods do not write anything, they just return a new string. If the input string is too long, they don't truncate it, but return it unchanged; this will mess up your column lay-out but that's usually better than the alternative, which would be lying about a value. (If you really want truncation you can always add a slice operation, as in ``x.ljust(n)[:n]``.)
tr: Dize nesnelerinin :meth:`str.rjust` yöntemi, belirli bir genişlikteki bir alandaki dizeyi soldaki boşluklarla doldurmayı haklı hale getirir. Benzer yöntemler vardır :meth:`str.ljust` ve :meth:`str.center`. Bu yöntemler hiçbir şey yazmaz, yalnızca yeni bir dize döndürür. Giriş dizesi çok uzunsa, onu kesmezler, değiştirmeden döndürürler; bu, sütununuzu mahvedecektir, ancak bu genellikle bir değer hakkında yalan söylemek olan alternatiften daha iyidir. (Gerçekten kesilme istiyorsanız, ``x.ljust(n)[:n]`` gibi her zaman bir dilim işlemi ekleyebilirsiniz.)

source: There is another method, :meth:`str.zfill`, which pads a numeric string on the left with zeros. It understands about plus and minus signs::
tr: Soldaki sayısal bir dizeyi sıfırlarla dolduran başka bir metot vardır: :meth:`str.zfill`. Bu metot artı ve eksi işaretlerini anlar::

source: Old string formatting
tr: Eski dize biçimlendirmesi

source: The % operator (modulo) can also be used for string formatting. Given ``'string' % values``, instances of ``%`` in ``string`` are replaced with zero or more elements of ``values``. This operation is commonly known as string interpolation. For example::
tr: % operatör (modulo) dize biçimlendirmesi için de kullanılabilir. ``'string' % values`` göz önüne alındığında, ``string`` öğesindeki ``%`` örnekleri sıfır veya daha fazla ``values`` öğesiyle değiştirilir. Bu işlem genellikle dize enterpolasyonu olarak bilinir. Mesela::

source: More information can be found in the :ref:`old-string-formatting` section.
tr: Daha fazla bilgiyi :ref:`old-string-formatting` bölümünde bulabilirsiniz.

source: Reading and Writing Files
tr: Dosyaları Okuma ve Yazma

source: :func:`open` returns a :term:`file object`, and is most commonly used with two positional arguments and one keyword argument: ``open(filename, mode, encoding=None)``
tr: :func:`open` bir :term:`file object` döndürür ve en yaygın olarak iki konum argümanı ve bir anahtar sözcük argümanı ile kullanılır: ``open(filename, mode, encoding=None)``

source: The first argument is a string containing the filename. The second argument is another string containing a few characters describing the way in which the file will be used. *mode* can be ``'r'`` when the file will only be read, ``'w'`` for only writing (an existing file with the same name will be erased), and ``'a'`` opens the file for appending; any data written to the file is automatically added to the end. ``'r+'`` opens the file for both reading and writing. The *mode* argument is optional; ``'r'`` will be assumed if it's omitted.
tr: İlk parametre dosya adını içeren bir dizedir. İkinci parametre dosyanın nasıl kullanılacağını açıklayan birkaç karakter içeren başka bir dizedir. *mode*, dosya yalnızca okunacağı zaman ``'r'``, yalnızca yazmak için ``'w'`` olabilir (aynı ada sahip varolan bir dosya temizlenir) ve ``'a'`` dosyayı ekleme için açar; dosyaya yazılan tüm veriler otomatik olarak sonuna eklenir. ``'r+'`` dosyayı hem okumak hem de yazmak için açar. *mode* parametresi isteğe bağlıdır; verilmezse ``'r'`` varsayılacaktır.

source: Normally, files are opened in :dfn:`text mode`, that means, you read and write strings from and to the file, which are encoded in a specific *encoding*. If *encoding* is not specified, the default is platform dependent (see :func:`open`). Because UTF-8 is the modern de-facto standard, ``encoding="utf-8"`` is recommended unless you know that you need to use a different encoding. Appending a ``'b'`` to the mode opens the file in :dfn:`binary mode`. Binary mode data is read and written as :class:`bytes` objects. You can not specify *encoding* when opening file in binary mode.
tr: Normalde dosyalar :dfn:`text mode` 'unda açılır, yani belirli bir *kodlamada (encoding)* kodlanmış dizeleri dosyadan okur ve dosyaya yazarsınız. *kodlama* belirtilmezse, varsayılan değer platforma bağlıdır (bakınız :func:`open`). UTF-8 modern de-fakto standart olduğundan, farklı bir kodlama kullanmanız gerekmiyorsa ``encoding="utf-8"`` kullanmanız önerilir. Moda ``'b'`` eklemek, dosyayı :dfn:`binary` modunda açar. İkili mod verileri, :class:`bytes` nesneleri olarak okunur ve yazılır. Dosyayı ikili modda açarken *kodlama* belirtemezsiniz.

source: In text mode, the default when reading is to convert platform-specific line endings (``\n`` on Unix, ``\r\n`` on Windows) to just ``\n``. When writing in text mode, the default is to convert occurrences of ``\n`` back to platform-specific line endings. This behind-the-scenes modification to file data is fine for text files, but will corrupt binary data like that in :file:`JPEG` or :file:`EXE` files. Be very careful to use binary mode when reading and writing such files.
tr: Metin modunda, okurken varsayılan değer platforma özgü satır sonlarını (``\n`` on Unix, ``\r\n`` on Windows) yalnızca ``\n`` olarak dönüştürmektir. Metin modunda yazarken, varsayılan değer ``\n`` oluşumlarını platforma özgü satır sonlarına geri dönüştürmektir. Dosya verilerinde yapılan bu sahne arkası değişikliği metin dosyaları için iyidir, ancak :file:`JPEG` veya :file:`EXE` dosyalarında bunun gibi ikili verileri bozacaktır. Bu tür dosyaları okurken ve yazarken ikili modu kullanmaya çok dikkat edin.

source: It is good practice to use the :keyword:`with` keyword when dealing with file objects. The advantage is that the file is properly closed after its suite finishes, even if an exception is raised at some point. Using :keyword:`!with` is also much shorter than writing equivalent :keyword:`try`\ -\ :keyword:`finally` blocks::
tr: Dosya nesneleriyle uğraşırken :keyword:`with` anahtar sözcüğünü kullanmak iyi bir uygulamadır. Avantajı, herhangi bir noktada bir hata oluşsa bile, paketi bittikten sonra dosyanın düzgün bir şekilde kapatılmasıdır. :keyword:`!with` kullanmak da eş değer :keyword:`try` \ -\ :keyword:`finally` blokları yazmaktançok daha kısadır::

source: If you're not using the :keyword:`with` keyword, then you should call ``f.close()`` to close the file and immediately free up any system resources used by it.
tr: :keyword:`with` anahtar sözcüğünü kullanmıyorsanız, dosyayı kapatmak ve kullandığı sistem kaynaklarını hemen boşaltmak için ``f.close()`` metodunu çağırmalısınız.

source: Calling ``f.write()`` without using the :keyword:`!with` keyword or calling ``f.close()`` **might** result in the arguments of ``f.write()`` not being completely written to the disk, even if the program exits successfully.
tr: :keyword:`!with` anahtar sözcüğünü kullanmadan ``f.write()`` çağırmak veya ``f.close()`` çağırmak, program başarıyla çıksa bile ``f.write()`` parametrelerinin diske tamamen yazılmamasıyla sonuçlanabilir.

source: After a file object is closed, either by a :keyword:`with` statement or by calling ``f.close()``, attempts to use the file object will automatically fail. ::
tr: Bir dosya nesnesi kapatıldıktan sonra, bir :keyword:`with` deyimiyle veya ``f.close()`` çağırarak dosya nesnesini kullanma girişimleri otomatik olarak başarısız olur. ::

source: Methods of File Objects
tr: Dosya Nesnelerinin Metotları

source: The rest of the examples in this section will assume that a file object called ``f`` has already been created.
tr: Bu bölümdeki örneklerin geri kalanı, ``f`` adlı bir dosya nesnesinin zaten oluşturulduğunu varsayar.

source: To read a file's contents, call ``f.read(size)``, which reads some quantity of data and returns it as a string (in text mode) or bytes object (in binary mode). *size* is an optional numeric argument. When *size* is omitted or negative, the entire contents of the file will be read and returned; it's your problem if the file is twice as large as your machine's memory. Otherwise, at most *size* characters (in text mode) or *size* bytes (in binary mode) are read and returned. If the end of the file has been reached, ``f.read()`` will return an empty string (``''``). ::
tr: Bir dosyanın içeriğini okumak için, bir miktar veriyi okuyan ve dize (metin modunda) veya bayt nesnesi (ikili modda) olarak döndüren ``f.read(size)`` öğesini çağırın. *size* isteğe bağlı bir sayısal parametredir. *size* boş bırakıldığında veya negatif olduğunda, dosyanın tüm içeriği okunur ve döndürülür; dosya makinenizin belleğinden iki kat daha büyükse bu sizin sorununuzdur. Aksi takdirde, en fazla *size* karakterleri (metin modunda) veya *size* bayt (ikili modda) okunur ve döndürülür. Dosyanın sonuna ulaşıldıysa, ``f.read()`` boş bir dize (``''``) döndürür. ::

source: ``f.readline()`` reads a single line from the file; a newline character (``\n``) is left at the end of the string, and is only omitted on the last line of the file if the file doesn't end in a newline. This makes the return value unambiguous; if ``f.readline()`` returns an empty string, the end of the file has been reached, while a blank line is represented by ``'\n'``, a string containing only a single newline. ::
tr: ``f.readline()`` dosyadan tek bir satır okur; dizenin sonunda bir newline karakteri (``\n``) bırakılır ve dosya yalnızca dosya yeni satırda bitmezse dosyanın son satırında atlanır. Bu, dönüş değerini netleştirir; ``f.readline()`` boş bir dize döndürürse, dosyanın sonuna ulaşılmış demektir, boş bir satır ise yalnızca tek bir yeni satır içeren bir dize olan ``'\n'`` ile temsil edilir. ::

source: For reading lines from a file, you can loop over the file object. This is memory efficient, fast, and leads to simple code::
tr: Bir dosyadan satırları okumak için, dosya nesnesinin üzerinde döngü oluşturabilirsiniz. Bu bellek verimliliğine, hızlılığına ve basit koda yol açar::

source: If you want to read all the lines of a file in a list you can also use ``list(f)`` or ``f.readlines()``.
tr: Listedeki bir dosyanın tüm satırlarını okumak istiyorsanız, ``list(f)`` veya ``f.readlines()`` öğelerini de kullanabilirsiniz.

source: ``f.write(string)`` writes the contents of *string* to the file, returning the number of characters written. ::
tr: ``f.write(string)`` *string* içeriğini dosyaya yazar ve yazılan karakter sayısını döndürür. ::

source: Other types of objects need to be converted -- either to a string (in text mode) or a bytes object (in binary mode) -- before writing them::
tr: Diğer nesne türlerinin yazmadan önce bir dizeye (metin modunda) veya bayt nesnesine (ikili modda) dönüştürülmesi gerekir::

source: ``f.tell()`` returns an integer giving the file object's current position in the file represented as number of bytes from the beginning of the file when in binary mode and an opaque number when in text mode.
tr: ``f.tell()`` dosya nesnesinin dosyadaki geçerli konumunu ikili moddayken dosyanın başından itibaren bayt sayısı ve metin modundayken opak bir sayı olarak veren bir tamsayı döndürür.

source: To change the file object's position, use ``f.seek(offset, whence)``. The position is computed from adding *offset* to a reference point; the reference point is selected by the *whence* argument. A *whence* value of 0 measures from the beginning of the file, 1 uses the current file position, and 2 uses the end of the file as the reference point. *whence* can be omitted and defaults to 0, using the beginning of the file as the reference point. ::
tr: Dosya nesnesinin konumunu değiştirmek için ``f.seek(offset, whence)`` kullanın. Konum, bir referans noktasına *offset* eklenerek hesaplanır; referans noktası *whence* parametresi tarafından seçilir. *whence* değeri dosyanın başından itibaren 0 ölçerken, 1 geçerli dosya konumunu, 2 ise başvuru noktası olarak dosyanın sonunu kullanır. *whence* atlanabilir ve başvuru noktası için dosyanın başlangıcını kullanarak 0 olarak varsayılabilir. ::

source: In text files (those opened without a ``b`` in the mode string), only seeks relative to the beginning of the file are allowed (the exception being seeking to the very file end with ``seek(0, 2)``) and the only valid *offset* values are those returned from the ``f.tell()``, or zero. Any other *offset* value produces undefined behaviour.
tr: Metin dosyalarında (mod dizesinde ``b`` olmadan açılanlar), yalnızca dosyanın başına göre aramalara izin verilir (dosyanın sonuna ``seek(0, 2)`` ile arayan özel durum) ve tek geçerli *offset* değerleri ``f.tell()`` veya sıfırdan döndürülen değerlerdir. Başka herhangi bir *offset* değeri tanımsız davranış üretir.
