Repository: python/python-docs-tr
Catalog: tutorial/interpreter.po
Languages: tr

source: Using the Python Interpreter
tr: Python Yorumlayıcısını Kullanma

source: Invoking the Interpreter
tr: Yorumlayıcıyı Çağırma

source: The Python interpreter is usually installed as :file:`/usr/local/bin/python3.11` on those machines where it is available; putting :file:`/usr/local/bin` in your Unix shell's search path makes it possible to start it by typing the command:
tr: Python yorumlayıcısı genellikle mevcut olduğu makinelerde :file:`/usr/local/bin/python3.10` 'a yüklenir; Unix kabuğunuzun arama yoluna (path) :file:`/usr/local/bin` yazmak, komutu yazarak başlatmayı mümkün kılar:

source: to the shell. [#]_ Since the choice of the directory where the interpreter lives is an installation option, other places are possible; check with your local Python guru or system administrator. (E.g., :file:`/usr/local/python` is a popular alternative location.)
tr: kabuğa. [#]_ Yorumlayıcının bulunduğu dizinin seçimi bir yükleme seçeneği olduğundan, Python dizini başka bir yerde de olabilir; yerel Python gurunuza veya sistem yöneticinize danışın. (Örneğin, :file:`/usr/local/python` popüler bir alternatif konumdur.)

source: On Windows machines where you have installed Python from the :ref:`Microsoft Store <windows-store>`, the :file:`python3.11` command will be available. If you have the :ref:`py.exe launcher <launcher>` installed, you can use the :file:`py` command. See :ref:`setting-envvars` for other ways to launch Python.
tr: Python'ı :ref:`Microsoft Store <windows-store>` yüklediğiniz Windows makinelerinde :file:`python3.10` komutu kullanılabilir. :ref:`py.exe launcher <launcher>` başlatıcısı yüklüyse, :file:`py` komutunu kullanabilirsiniz. Python'u başlatmanın diğer yolları için :ref:`setting-envvars` 'a bakın.

source: Typing an end-of-file character (:kbd:`Control-D` on Unix, :kbd:`Control-Z` on Windows) at the primary prompt causes the interpreter to exit with a zero exit status. If that doesn't work, you can exit the interpreter by typing the following command: ``quit()``.
tr: Dosya sonu karakteri (Unix'te :kbd:`Control-D`, Windows'ta :kbd:`Control-Z`) yazılması, yorumlayıcının sıfır durumuyla (zero exit status) sonlanmasına neden olur. Bu işe yaramazsa, aşağıdaki komutu yazarak yorumlayıcıdan çıkabilirsiniz: ``quit()``.

source: The interpreter's line-editing features include interactive editing, history substitution and code completion on systems that support the `GNU Readline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_ library. Perhaps the quickest check to see whether command line editing is supported is typing :kbd:`Control-P` to the first Python prompt you get. If it beeps, you have command line editing; see Appendix :ref:`tut-interacting` for an introduction to the keys. If nothing appears to happen, or if ``^P`` is echoed, command line editing isn't available; you'll only be able to use backspace to remove characters from the current line.
tr: Yorumlayıcının satır düzenleme özellikleri arasında etkileşimli düzenleme, geçmiş değiştirme ve `GNU Readline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_ kütüphanesini destekleyen sistemlerde kod tamamlama bulunur. Komut satırı düzenlemenin desteklenip desteklenmediğini görmek için belki de en hızlı denetim, elde ettiğiniz ilk Python istemine :kbd:`Control-P` yazmaktır. Bip sesi çıkarsa komut satırı düzenlemeniz vardır; Tuşların tanıtımı için :ref:`tut-interacting` 'e göz atabilirsiniz. Hiçbir şey görünmüyorsa veya ``^P`` yankılanıyorsa, komut satırı düzenlemesi kullanılamaz; yalnızca geçerli satırdaki karakterleri kaldırmak için geri alabiliyorsunuz.

source: The interpreter operates somewhat like the Unix shell: when called with standard input connected to a tty device, it reads and executes commands interactively; when called with a file name argument or with a file as standard input, it reads and executes a *script* from that file.
tr: Yorumlayıcı bir şekilde Unix kabuğu gibi çalışır: bir tty aygıtına bağlı standart girdi ile çağrıldığında, komutları etkileşimli olarak okur ve yürütür; bir dosya adı argümanıyla veya standart girdi olarak bir dosyayla çağrıldığında, o dosyadan bir *komut dosyası* okur ve yürütür.

source: A second way of starting the interpreter is ``python -c command [arg] ...``, which executes the statement(s) in *command*, analogous to the shell's :option:`-c` option. Since Python statements often contain spaces or other characters that are special to the shell, it is usually advised to quote *command* in its entirety.
tr: Yorumlayıcıyı başlatmanın ikinci bir yolu, kabuğun :option:`-c` seçeneğine benzer şekilde *command* içindeki deyimleri çalıştıran ``python -c command [arg] ...`` komutudur. Python deyimleri genellikle boşluk veya kabuğa özel başka karakterler içerdiğinden, genellikle *command* ifadesinin tamamının alıntılanması tavsiye edilir.

source: Some Python modules are also useful as scripts. These can be invoked using ``python -m module [arg] ...``, which executes the source file for *module* as if you had spelled out its full name on the command line.
tr: Bazı Python modülleri komut dosyası olarak da yararlıdır. Bunlar, eğer tam adını komut satırına yazarsanız *modül* için kaynak dosyası ``python -m *modül* [argüman] ...`` kullanılarak çağrılabilir.

source: When a script file is used, it is sometimes useful to be able to run the script and enter interactive mode afterwards. This can be done by passing :option:`-i` before the script.
tr: Bir komut dosyası kullanıldığında, bazen komut dosyasını çalıştırabilmek ve daha sonra etkileşimli moda girebilmek yararlıdır. Bu komut dosyasından önce :option:`-i` geçirilerek yapılabilir.

source: All command line options are described in :ref:`using-on-general`.
tr: Tüm komut satırı seçenekleri :ref:`using-on-general` bölümünde açıklanmıştır.

source: Argument Passing
tr: Değişken Geçirme

source: When known to the interpreter, the script name and additional arguments thereafter are turned into a list of strings and assigned to the ``argv`` variable in the ``sys`` module. You can access this list by executing ``import sys``. The length of the list is at least one; when no script and no arguments are given, ``sys.argv[0]`` is an empty string. When the script name is given as ``'-'`` (meaning standard input), ``sys.argv[0]`` is set to ``'-'``. When :option:`-c` *command* is used, ``sys.argv[0]`` is set to ``'-c'``. When :option:`-m` *module* is used, ``sys.argv[0]`` is set to the full name of the located module. Options found after :option:`-c` *command* or :option:`-m` *module* are not consumed by the Python interpreter's option processing but left in ``sys.argv`` for the command or module to handle.
tr: Yorumlayıcı tarafından bilindiğinde, komut dosyası adı ve bundan sonraki ek argüman dizelerin listesine dönüştürülür ve ``sys`` modülündeki ``argv`` değişkenine atanır. Bu listeye ``import sys`` öğesini yürüterek erişebilirsiniz. Listenin uzunluğu en az birdir; komut dosyası ve argüman verilmediğinde ``sys.argv[0]`` boş bir dizedir. Komut dosyası adı ``'-'`` (standart giriş anlamına gelir) olarak verildiğinde, ``sys.argv[0]`` ``'-'`` olarak ayarlanır. :option:`-c` *komut* kullanıldığında, ``sys.argv[0]``, ``-c`` olarak ayarlanır. :option:`-m` *modül* kullanıldığında, ``sys.argv[0]`` bulunan modülün tam adına ayarlanır. :option:`-c` *komut* veya :option:`-m` *modül* 'den sonra bulunan seçenekler, Python yorumlayıcısının seçenek işlemesi tarafından tüketilmez, ancak komut veya modülün işlemesi için ``sys.argv`` içinde bırakılır.

source: Interactive Mode
tr: Etkileşimli Mod

source: When commands are read from a tty, the interpreter is said to be in *interactive mode*. In this mode it prompts for the next command with the *primary prompt*, usually three greater-than signs (``>>>``); for continuation lines it prompts with the *secondary prompt*, by default three dots (``...``). The interpreter prints a welcome message stating its version number and a copyright notice before printing the first prompt:
tr: Komutlar bir tty'den okunduğunda, yorumlayıcının *etkileşimli modda* olduğu söylenir. Bu modda, genellikle üç büyük işaret olan *öncelikli bilgi istemi* ile bir sonraki komutu ister (``>>>``); devam satırları için *ikincil istem* ile sorar, varsayılan olarak üç nokta (``...``). Yorumlayıcı, ilk istemi yazdırmadan önce sürüm numarasını ve telif hakkı bildirimini belirten bir karşılama iletisi yazdırır:

source: Continuation lines are needed when entering a multi-line construct. As an example, take a look at this :keyword:`if` statement::
tr: Çok satırlı bir yapıya girilirken devamlılık satırları gereklidir. Örnek olarak, :keyword:`if` ifadesine bir göz atın::

source: For more on interactive mode, see :ref:`tut-interac`.
tr: Etkileşimli mod hakkında daha fazlası için bkz. :ref:`tut-interac`.

source: The Interpreter and Its Environment
tr: Yorumlayıcı ve Çevresi

source: Source Code Encoding
tr: Kaynak Kodu Şeması

source: By default, Python source files are treated as encoded in UTF-8. In that encoding, characters of most languages in the world can be used simultaneously in string literals, identifiers and comments --- although the standard library only uses ASCII characters for identifiers, a convention that any portable code should follow. To display all these characters properly, your editor must recognize that the file is UTF-8, and it must use a font that supports all the characters in the file.
tr: Varsayılan olarak, Python kaynak dosyaları UTF-8'de kodlanmış olarak kabul edilir. Bu kodlamada, dünyadaki çoğu dilin karakterleri dize değişmezlerinde, tanımlayıcılarda ve yorumlarda aynı anda kullanılabilir --- standart kütüphane tanımlayıcılar için yalnızca ASCII karakterleri kullansa da, herhangi bir taşınabilir kodun izlemesi gereken bir kuraldır. Tüm bu karakterleri düzgün görüntülemek için, düzenleyicinizin dosyanın UTF-8 olduğunu tanıması ve dosyadaki tüm karakterleri destekleyen bir yazı tipi kullanması gerekir.

source: To declare an encoding other than the default one, a special comment line should be added as the *first* line of the file. The syntax is as follows::
tr: Varsayılan dil şeması dışında bir şema bildirmek için, dosyanın *ilk* satırı olarak özel bir yorum satırı eklenmelidir. Sözdizimi aşağıdaki gibidir::

source: where *encoding* is one of the valid :mod:`codecs` supported by Python.
tr: burada *kodlama*, Python tarafından desteklenen geçerli :mod:`codec` bileşenlerinden biridir.

source: For example, to declare that Windows-1252 encoding is to be used, the first line of your source code file should be::
tr: Örneğin, Windows-1252 şemasının kullanılacağını bildirmek için, kaynak kod dosyanızın ilk satırı şu olmalıdır::

source: One exception to the *first line* rule is when the source code starts with a :ref:`UNIX "shebang" line <tut-scripts>`. In this case, the encoding declaration should be added as the second line of the file. For example::
tr: *İlk satır* kuralının bir istisnası, kaynak kodun :ref:`UNIX "shebang" line <tut-scripts>` satırı ile başlamasıdır. Bu durumda, şema bildirimi dosyanın ikinci satırı olarak eklenmelidir. Örneğin::

source: Footnotes
tr: Dipnotlar

source: On Unix, the Python 3.x interpreter is by default not installed with the executable named ``python``, so that it does not conflict with a simultaneously installed Python 2.x executable.
tr: Unix'te, Python 3.x yorumlayıcısı varsayılan olarak ``python`` adlı yürütülebilir dosyayla yüklenmez, böylece aynı anda yüklenen bir Python 2.x yürütülebilir dosyasıyla çakışmaz.
