Repository: python/python-docs-tr
Catalog: tutorial/introduction.po
Languages: tr

source: An Informal Introduction to Python
tr: Python'a Resmi Olmayan Bir Giriş

source: In the following examples, input and output are distinguished by the presence or absence of prompts (:term:`>>>` and :term:`...`): to repeat the example, you must type everything after the prompt, when the prompt appears; lines that do not begin with a prompt are output from the interpreter. Note that a secondary prompt on a line by itself in an example means you must type a blank line; this is used to end a multi-line command.
tr: İlerleyen örneklerde; giriş ve çıkış, bilgi istemlerinin olup olmamasına göre ayırt edilir (:term:`>>>` ve :term:`...`): örneği tekrarlamak için bilgi isteminden sonra her şeyi yazmalısınız, istem göründüğünde bir bilgi istemi ile başlamayan satırlar yorumlayıcıdan çıkar. Bir örnekte tek başına bir satırdaki ikincil istemin boş bir satır yazmanız gerektiği anlamına geldiğini unutmayın; bu, çok satırlı bir komutu sonlandırmak için kullanılır.

source: You can toggle the display of prompts and output by clicking on ``>>>`` in the upper-right corner of an example box. If you hide the prompts and output for an example, then you can easily copy and paste the input lines into your interpreter.
tr: Bir örnek kutusunun sağ üst köşesindeki ``>>>`` üzerine tıklayarak istemlerin ve çıktıların görüntülenmesini değiştirebilirsiniz. Bir örnek için istemleri ve çıktıyı gizlerseniz, giriş satırlarını kolayca kopyalayıp yorumlayıcınıza yapıştırabilirsiniz.

source: Many of the examples in this manual, even those entered at the interactive prompt, include comments. Comments in Python start with the hash character, ``#``, and extend to the end of the physical line. A comment may appear at the start of a line or following whitespace or code, but not within a string literal. A hash character within a string literal is just a hash character. Since comments are to clarify code and are not interpreted by Python, they may be omitted when typing in examples.
tr: Bu kılavuzdaki örneklerin çoğu, etkileşimli komut isteminde girilenler dahil, yorumlar içerir. Python'da yorumlar, ``#`` hash karakteriyle başlar ve fiziksel satırın sonuna kadar uzanır. Bir satırın başında veya boşluk veya kodun ardından bir yorum görünebilir, ancak bir dize sabiti içinde değil. Bir dize sabiti içindeki bir hash karakteri, yalnızca bir hash karakterdir. Yorumlar kodu netleştirmek için olduğundan ve Python tarafından yorumlanmadığından örnekler yazarken atlanabilirler.

source: Some examples::
tr: Bazı örnekler::

source: Using Python as a Calculator
tr: Python'ı Hesap Makinesi Olarak Kullanmak

source: Let's try some simple Python commands. Start the interpreter and wait for the primary prompt, ``>>>``. (It shouldn't take long.)
tr: Bazı basit Python komutlarını deneyelim. Yorumlayıcıyı başlatın ve ``>>>`` birincil istemini bekleyin. (Uzun sürmemelidir.)

source: Numbers
tr: Sayılar

source: The interpreter acts as a simple calculator: you can type an expression at it and it will write the value. Expression syntax is straightforward: the operators ``+``, ``-``, ``*`` and ``/`` work just like in most other languages (for example, Pascal or C); parentheses (``()``) can be used for grouping. For example::
tr: Yorumlayıcı basit bir hesap makinesi görevi görür: ona bir ifade yazabilirsiniz ve değeri yazacaktır. İfade sözdizimi basittir: ``+``, ``-``, ``*`` ve ``/`` operatörleri, tıpkı diğer birçok dilde (örneğin, Pascal veya C) olduğu gibi çalışır; gruplama için parantezler (``()``) kullanılabilir. Örneğin::

source: The integer numbers (e.g. ``2``, ``4``, ``20``) have type :class:`int`, the ones with a fractional part (e.g. ``5.0``, ``1.6``) have type :class:`float`. We will see more about numeric types later in the tutorial.
tr: Tam sayıların (örneğin ``2``, ``4``, ``20``) türü :class:`int` olup, kesirli kısmı olanlar (örneğin ``5.0``, ``1.6``) :class:`float` türüne sahiptir. Sayısal türler hakkında sonrasında daha fazlasını göreceğiz.

source: Division (``/``) always returns a float. To do :term:`floor division` and get an integer result you can use the ``//`` operator; to calculate the remainder you can use ``%``::
tr: Bölme (``/``) her zaman bir ondalıklı sayı döndürür. :term:`floor division` yapmak ve bir tam sayı sonucu almak için ``//`` operatörünü kullanabilirsiniz; kalanı hesaplamak içinse ``%`` operatörünü kullanabilirsiniz::

source: With Python, it is possible to use the ``**`` operator to calculate powers [#]_::
tr: Python ile üslü sayıları hesaplamak için ``**`` operatörünü kullanmak mümkündür [#]_::

source: The equal sign (``=``) is used to assign a value to a variable. Afterwards, no result is displayed before the next interactive prompt::
tr: Bir değişkene değer atamak için eşittir işareti (``=``) kullanılır. Daha sonra, bir sonraki etkileşimli komut isteminden önce hiçbir sonuç görüntülenmez::

source: If a variable is not "defined" (assigned a value), trying to use it will give you an error::
tr: Bir değişken "tanımlı" değilse (bir değer atanmamışsa), onu kullanmaya çalışmak size bir hata verecektir::

source: There is full support for floating point; operators with mixed type operands convert the integer operand to floating point::
tr: Ondalıklı sayı için tam destek var; karışık türde işlenenlere sahip operatörler, tam sayı işlenenini ondalıklı sayıya dönüştürür::

source: In interactive mode, the last printed expression is assigned to the variable ``_``. This means that when you are using Python as a desk calculator, it is somewhat easier to continue calculations, for example::
tr: Etkileşimli modda, son yazdırılan ifade ``_`` değişkenine atanır. Bu, Python'ı bir masa hesap makinesi olarak kullandığınızda, hesaplamalara devam etmenin biraz daha kolay olduğu anlamına gelir, örneğin::

source: This variable should be treated as read-only by the user. Don't explicitly assign a value to it --- you would create an independent local variable with the same name masking the built-in variable with its magic behavior.
tr: Bu değişken, kullanıcı tarafından salt okunur olarak ele alınmalıdır. Açıkça ona bir değer atamayın --- sihirli davranışları olan bu gömülü değişkeni maskeleyen aynı ada sahip bağımsız bir yerel değişken yaratırsınız.

source: In addition to :class:`int` and :class:`float`, Python supports other types of numbers, such as :class:`~decimal.Decimal` and :class:`~fractions.Fraction`. Python also has built-in support for :ref:`complex numbers <typesnumeric>`, and uses the ``j`` or ``J`` suffix to indicate the imaginary part (e.g. ``3+5j``).
tr: :class:`int` ve :class:`float` 'a ek olarak Python, :class:`~decimal.Decimal` ve :class:`~fractions.Fraction` gibi diğer sayı türlerini de destekler. Python ayrıca :ref:`karmaşık sayılar <typesnumeric>` için gömülü desteğe sahiptir ve hayali kısmı belirtmek için ``j`` veya ``J`` son ekini kullanır (ör. ``3+5j``).

source: Strings
tr: Dizeler

source: Besides numbers, Python can also manipulate strings, which can be expressed in several ways. They can be enclosed in single quotes (``'...'``) or double quotes (``"..."``) with the same result [#]_. ``\`` can be used to escape quotes::
tr: Sayıların yanı sıra Python, çeşitli şekillerde ifade edilebilen dizeleri de değiştirebilir. Tek tırnak (``'...'``) veya çift tırnak (``"..."``) içine alınabilirler ve aynı sonuç olur [#]_. ``\`` tırnaklardan kaçmak için kullanılabilir::

source: In the interactive interpreter, the output string is enclosed in quotes and special characters are escaped with backslashes. While this might sometimes look different from the input (the enclosing quotes could change), the two strings are equivalent. The string is enclosed in double quotes if the string contains a single quote and no double quotes, otherwise it is enclosed in single quotes. The :func:`print` function produces a more readable output, by omitting the enclosing quotes and by printing escaped and special characters::
tr: Etkileşimli yorumlayıcıda, çıktı dizesi tırnak işaretleri içine alınır ve özel karakterler ters eğik çizgiyle çıkarılır. Bu bazen girdiden farklı görünse de (ilgili tırnak işaretleri değişebilir), iki dize eş değerdir. Dize tek bir tırnak işareti içeriyorsa ve çift tırnak içermiyorsa dize çift tırnak içine alınır, aksi takdirde tek tırnak içine alınır. :func:`print` fonksiyonu, ekteki tırnak işaretlerini atlayarak ve çıkış karakterlerini ve özel karakterleri yazdırarak daha okunaklı bir çıktı üretir::

source: If you don't want characters prefaced by ``\`` to be interpreted as special characters, you can use *raw strings* by adding an ``r`` before the first quote::
tr: ``\`` ile başlayan karakterlerin özel karakterler olarak yorumlanmasını istemiyorsanız, ilk alıntıdan önce bir ``r`` ekleyerek *ham dizeleri (raw strings)* kullanabilirsiniz::

source: There is one subtle aspect to raw strings: a raw string may not end in an odd number of ``\`` characters; see :ref:`the FAQ entry <faq-programming-raw-string-backslash>` for more information and workarounds.
tr: Ham dizelerin ince bir yönü vardır: ham bir dize tek sayıda ``\`` karakterle bitmeyebilir; daha fazla bilgi ve geçici çözümler için :ref:`SSS <faq-programming-raw-string-backslash>` 'e bakın.

source: String literals can span multiple lines. One way is using triple-quotes: ``"""..."""`` or ``'''...'''``. End of lines are automatically included in the string, but it's possible to prevent this by adding a ``\`` at the end of the line. The following example::
tr: Dize sabitleri birden çok satıra yayılabilir. Bunun bir yolu üçlü tırnak kullanmaktır: ``"""..."""`` veya ``'''...'''``. Satır sonu otomatik olarak dizeye dahil edilir, ancak satırın sonuna ``\`` ekleyerek bunu önlemek mümkündür. Aşağıdaki örnek::

source: produces the following output (note that the initial newline is not included):
tr: aşağıdaki çıktıyı üretir (ilk yeni satırın dahil olmadığını unutmayın):

source: Strings can be concatenated (glued together) with the ``+`` operator, and repeated with ``*``::
tr: Dizeler ``+`` operatörüyle birleştirilebilir (birbirine yapıştırılabilir) ve ``*`` ile tekrarlanabilir::

source: Two or more *string literals* (i.e. the ones enclosed between quotes) next to each other are automatically concatenated. ::
tr: Yan yana iki veya daha fazla *dize sabiti* (yani, tırnak işaretleri arasına alınanlar) otomatik olarak birleştirilir. ::

source: This feature is particularly useful when you want to break long strings::
tr: Bu özellik, özellikle uzun dizeleri kırmak istediğinizde kullanışlıdır::

source: This only works with two literals though, not with variables or expressions::
tr: Bu, değişkenler veya ifadelerle değil, yalnızca iki sabit değerle çalışır::

source: If you want to concatenate variables or a variable and a literal, use ``+``::
tr: Değişkenleri veya bir değişkeni ve bir sabiti birleştirmek istiyorsanız, ``+`` kullanın:

source: Strings can be *indexed* (subscripted), with the first character having index 0. There is no separate character type; a character is simply a string of size one::
tr: Dizeler, ilk karakterin indeksi 0 olacak şekilde *dizine eklenebilir* (abone olabilir). Karakterler için ayrı bir tür yoktur; karakterler yalnızca *bir* uzunluğunda dizelerdir::

source: Indices may also be negative numbers, to start counting from the right::
tr: Sağdan saymaya başlamak için indeksler negatif sayılar da olabilir::

source: Note that since -0 is the same as 0, negative indices start from -1.
tr: -0 ile 0 aynı olduğundan, negatif endekslerin -1'den başladığını unutmayın.

source: In addition to indexing, *slicing* is also supported. While indexing is used to obtain individual characters, *slicing* allows you to obtain substring::
tr: İndekslemeye ek olarak *dilimleme* de desteklenir. Tek tek karakterleri elde etmek için indeksleme kullanılırken, *dilimleme* alt dizeyi elde etmenizi sağlar::

source: Slice indices have useful defaults; an omitted first index defaults to zero, an omitted second index defaults to the size of the string being sliced. ::
tr: Dilim indekslerinin kullanışlı varsayılanları vardır; atlanmış bir ilk dizin varsayılanı sıfırdır, atlanmış bir ikinci dizin varsayılanı dilimlenmekte olan dizenin boyutudur. ::

source: Note how the start is always included, and the end always excluded. This makes sure that ``s[:i] + s[i:]`` is always equal to ``s``::
tr: Başlangıcın her zaman dahil edildiğine ve sonun her zaman hariç tutulduğuna dikkat edin. Bu, ``s[:i] + s[i:]`` değerinin her zaman ``s`` değerine eşit olmasını sağlar::

source: One way to remember how slices work is to think of the indices as pointing *between* characters, with the left edge of the first character numbered 0. Then the right edge of the last character of a string of *n* characters has index *n*, for example::
tr: Dilimlerin nasıl çalıştığını hatırlamanın bir yolu, dizinleri ilk karakterin sol kenarı 0 ile *arasındaki* karakterleri işaret ediyor olarak düşünmektir. Ardından, *n* karakterli bir dizenin son karakterinin sağ kenarında *n* dizini vardır, örneğin::

source: The first row of numbers gives the position of the indices 0...6 in the string; the second row gives the corresponding negative indices. The slice from *i* to *j* consists of all characters between the edges labeled *i* and *j*, respectively.
tr: İlk sayı satırı, dizideki 0...6 endekslerinin konumunu verir; ikinci satır, karşılık gelen negatif endeksleri verir. *i* ile *j* arasındaki dilim, sırasıyla *i* ve *j* etiketli kenarlar arasındaki tüm karakterlerden oluşur.

source: For non-negative indices, the length of a slice is the difference of the indices, if both are within bounds. For example, the length of ``word[1:3]`` is 2.
tr: Negatif olmayan indeksler için, her ikisi de sınırlar içindeyse, bir dilimin uzunluğu indekslerin farkıdır. Örneğin, ``kelime[1:3]`` 'ün uzunluğu 2'dir.

source: Attempting to use an index that is too large will result in an error::
tr: Çok büyük bir dizin kullanmaya çalışmak bir hataya neden olur::

source: However, out of range slice indexes are handled gracefully when used for slicing::
tr: Ancak, aralık dışı dilim endeksleri, dilimleme için kullanıldığında zarif bir şekilde işlenir::

source: Python strings cannot be changed --- they are :term:`immutable`. Therefore, assigning to an indexed position in the string results in an error::
tr: Python dizeleri değiştirilemez --- bunlar :term:`immutable` 'dır. Bu nedenle, dizide dizine alınmış bir konuma atamak bir hatayla sonuçlanır::

source: If you need a different string, you should create a new one::
tr: Farklı bir dizeye ihtiyacınız varsa, yeni bir tane oluşturmalısınız::

source: The built-in function :func:`len` returns the length of a string::
tr: Yerleşik işlev :func:`len`, bir dizenin uzunluğunu döndürür::

source: Strings are examples of *sequence types*, and support the common operations supported by such types.
tr: Dizeler, *sıra türlerinin* örnekleridir ve bu türler tarafından desteklenen genel işlemleri destekler.

source: :ref:`string-methods`
tr: :ref:`dize-yöntemleri <string-methods>`

source: Strings support a large number of methods for basic transformations and searching.
tr: Dizeler, temel dönüşümler ve arama için çok sayıda yöntemi destekler.

source: String literals that have embedded expressions.
tr: Gömülü ifadelere sahip dize sabitleri.

source: Information about string formatting with :meth:`str.format`.
tr: :meth:`str.format` ile dize biçimlendirme hakkında bilgi.

source: The old formatting operations invoked when strings are the left operand of the ``%`` operator are described in more detail here.
tr: Dizeler ``%`` operatörünün sol işleneni olduğunda çağrılan eski biçimlendirme işlemleri burada daha ayrıntılı olarak açıklanmaktadır.

source: Lists
tr: Listeler

source: Python knows a number of *compound* data types, used to group together other values. The most versatile is the *list*, which can be written as a list of comma-separated values (items) between square brackets. Lists might contain items of different types, but usually the items all have the same type. ::
tr: Python, diğer değerleri gruplamak için kullanılan bir dizi *bileşik* veri türünü bilir. En çok yönlü olanı, köşeli parantezler arasında virgülle ayrılmış değerlerin (ögelerin) bir listesi olarak yazılabilen *liste*'dir. Listeler farklı türde ögeler içerebilir, ancak genellikle ögelerin tümü aynı türdedir. ::

source: Like strings (and all other built-in :term:`sequence` types), lists can be indexed and sliced::
tr: Dizeler gibi (ve diğer tüm yerleşik :term:`sequence` türleri), listeler dizine alınabilir ve dilimlenebilir::

source: All slice operations return a new list containing the requested elements. This means that the following slice returns a :ref:`shallow copy <shallow_vs_deep_copy>` of the list::
tr: Tüm dilim işlemleri, istenen ögeleri içeren yeni bir liste döndürür. Bu, aşağıdaki dilimin listenin bir :ref:`shallow copy <shallow_vs_deep_copy>` döndürdüğü anlamına gelir::

source: Lists also support operations like concatenation::
tr: Ayrıca listeler birleştirme gibi işlemleri de destekler::

source: Unlike strings, which are :term:`immutable`, lists are a :term:`mutable` type, i.e. it is possible to change their content::
tr: :term:`immutable` olan dizelerin aksine, listeler :term:`mutable` türündedir, yani içeriklerini değiştirmek mümkündür::

source: You can also add new items at the end of the list, by using the :meth:`~list.append` *method* (we will see more about methods later)::
tr: Ayrıca, :meth:`~list.append` *method*'u kullanarak listenin sonuna yeni öğeler ekleyebilirsiniz (yöntemler hakkında daha fazla bilgiyi daha sonra göreceğiz)::

source: Assignment to slices is also possible, and this can even change the size of the list or clear it entirely::
tr: Dilimlere atama da mümkündür ve bu, listenin boyutunu bile değiştirebilir veya tamamen temizleyebilir::

source: The built-in function :func:`len` also applies to lists::
tr: Yerleşik işlev :func:`len` ayrıca listeler için de geçerlidir::

source: It is possible to nest lists (create lists containing other lists), for example::
tr: Listeleri iç içe yerleştirmek (diğer listeleri içeren listeler oluşturmak) mümkündür, örneğin::

source: First Steps Towards Programming
tr: Programlamaya Doğru İlk Adımlar

source: Of course, we can use Python for more complicated tasks than adding two and two together. For instance, we can write an initial sub-sequence of the `Fibonacci series <https://en.wikipedia.org/wiki/Fibonacci_number>`_ as follows::
tr: Elbette Python'ı iki ile ikiyi toplamaktan daha komplike görevler için kullanabiliriz. Örneğin, `Fibonacci serisinin <https://en.wikipedia.org/wiki/Fibonacci_number>`_ ilk alt dizisini aşağıdaki gibi yazabiliriz:

source: This example introduces several new features.
tr: Bu örnek, birkaç yeni özellik sunar.

source: The first line contains a *multiple assignment*: the variables ``a`` and ``b`` simultaneously get the new values 0 and 1. On the last line this is used again, demonstrating that the expressions on the right-hand side are all evaluated first before any of the assignments take place. The right-hand side expressions are evaluated from the left to the right.
tr: İlk satır bir *çoklu atama*: ``a`` ve ``b`` değişkenleri aynı anda yeni 0 ve 1 değerlerini alır. Tarafların tümü, herhangi bir görev yapılmadan önce değerlendirilir. Sağ taraftaki ifadeler soldan sağa doğru değerlendirilir.

source: The :keyword:`while` loop executes as long as the condition (here: ``a < 10``) remains true. In Python, like in C, any non-zero integer value is true; zero is false. The condition may also be a string or list value, in fact any sequence; anything with a non-zero length is true, empty sequences are false. The test used in the example is a simple comparison. The standard comparison operators are written the same as in C: ``<`` (less than), ``>`` (greater than), ``==`` (equal to), ``<=`` (less than or equal to), ``>=`` (greater than or equal to) and ``!=`` (not equal to).
tr: :keyword:`while` döngüsü, koşul (burada: ``a < 10``) doğru kaldığı sürece yürütülür. Python'da, C'de olduğu gibi, sıfır olmayan herhangi bir tam sayı değeri doğrudur; sıfır yanlıştır. Koşul ayrıca bir dizi veya liste değeri, aslında herhangi bir dizi olabilir; uzunluğu sıfır olmayan her şey doğrudur, boş diziler yanlıştır. Örnekte kullanılan test basit bir karşılaştırmadır. Standart karşılaştırma işleçleri C'dekiyle aynı şekilde yazılır: ``<`` (küçüktür), ``>`` (büyüktür), ``==`` (eşittir), ``<=`` ( küçük veya eşit), ``>=`` (büyük veya eşit) ve ``!=`` (eşit değil).

source: The *body* of the loop is *indented*: indentation is Python's way of grouping statements. At the interactive prompt, you have to type a tab or space(s) for each indented line. In practice you will prepare more complicated input for Python with a text editor; all decent text editors have an auto-indent facility. When a compound statement is entered interactively, it must be followed by a blank line to indicate completion (since the parser cannot guess when you have typed the last line). Note that each line within a basic block must be indented by the same amount.
tr: Döngünün *gövdesi girintilidir*: girinti, Python'un ifadeleri gruplama şeklidir. Etkileşimli komut isteminde, girintili her satır için bir sekme veya boşluk(lar) yazmanız gerekir. Pratikte, bir metin düzenleyici ile Python için daha karmaşık girdiler hazırlayacaksınız; tüm düzgün metin editörlerinin otomatik girinti özelliği vardır. Bir bileşik deyim etkileşimli olarak girildiğinde, tamamlandığını belirtmek için boş bir satırdan sonra gelmelidir (çünkü ayrıştırıcı son satırı ne zaman yazdığınızı tahmin edemez). Bir temel blok içindeki her satırın aynı miktarda girintili olması gerektiğini unutmayın.

source: The :func:`print` function writes the value of the argument(s) it is given. It differs from just writing the expression you want to write (as we did earlier in the calculator examples) in the way it handles multiple arguments, floating point quantities, and strings. Strings are printed without quotes, and a space is inserted between items, so you can format things nicely, like this::
tr: :func:`print` işlevi, kendisine verilen argüman(lar)ın değerini yazar. Yalnızca yazmak istediğiniz ifadeyi yazmaktan (daha önce hesap makinesi örneklerinde yaptığımız gibi) birden çok bağımsız değişkeni, kayan nokta miktarlarını ve dizeleri işleme biçiminden farklıdır. Dizeler tırnak işaretleri olmadan yazdırılır ve öğelerin arasına bir boşluk eklenir, böylece şunları güzel bir şekilde biçimlendirebilirsiniz:

source: The keyword argument *end* can be used to avoid the newline after the output, or end the output with a different string::
tr: *end* anahtar sözcüğü argümanı, çıktıdan sonra yeni satırı önlemek veya çıktıyı farklı bir dizeyle bitirmek için kullanılabilir::

source: Footnotes
tr: Dipnotlar

source: Since ``**`` has higher precedence than ``-``, ``-3**2`` will be interpreted as ``-(3**2)`` and thus result in ``-9``. To avoid this and get ``9``, you can use ``(-3)**2``.
tr: ``**``, ``-`` 'den daha yüksek önceliğe sahip olduğundan, ``-3**2``, ``-(3**2)`` olarak yorumlanacak ve dolayısıyla ``-9`` ile sonuçlanacaktır. Bundan kaçınmak ve ``9`` elde etmek için ``(-3)**2`` kullanabilirsiniz.

source: Unlike other languages, special characters such as ``\n`` have the same meaning with both single (``'...'``) and double (``"..."``) quotes. The only difference between the two is that within single quotes you don't need to escape ``"`` (but you have to escape ``\'``) and vice versa.
tr: Diğer dillerden farklı olarak, ``\n`` gibi özel karakterler hem tek (``'...'``) hem de çift (``"..."``) tırnak işaretleri ile aynı anlama sahiptir. İkisi arasındaki tek fark, tek tırnak içinde ``"`` dan kaçmanıza gerek olmamasıdır (ancak ``\'`` dan kaçmanız gerekir) ve bunun tersi de geçerlidir.
