Repository: python/python-docs-tr
Catalog: tutorial/modules.po
Languages: tr

source: Modules
tr: Modüller

source: If you quit from the Python interpreter and enter it again, the definitions you have made (functions and variables) are lost. Therefore, if you want to write a somewhat longer program, you are better off using a text editor to prepare the input for the interpreter and running it with that file as input instead. This is known as creating a *script*. As your program gets longer, you may want to split it into several files for easier maintenance. You may also want to use a handy function that you've written in several programs without copying its definition into each program.
tr: Python yorumlayıcısından çıkıp tekrar girerseniz, yaptığınız tanımlar (fonksiyonlar ve değişkenler) kaybolur. Bu nedenle, daha uzun bir program yazmak istiyorsanız, girdiyi yorumlayıcıya hazırlarken bir metin düzenleyicisi kullanmak ve o dosyayla girdi olarak çalıştırmak daha iyidir. Bu bir *script* oluşturma olarak bilinir. Programınız uzadıkça, daha kolay bakım için birkaç dosyaya bölmek isteyebilirsiniz. Ayrıca, tanımını her programa kopyalamadan, birkaç programda yazdığınız kullanışlı bir fonksiyonu kullanmak isteyebilirsiniz.

source: To support this, Python has a way to put definitions in a file and use them in a script or in an interactive instance of the interpreter. Such a file is called a *module*; definitions from a module can be *imported* into other modules or into the *main* module (the collection of variables that you have access to in a script executed at the top level and in calculator mode).
tr: Bunu desteklemek için Python, tanımları bir dosyaya koymanın ve bunları bir komut dosyasında veya yorumlayıcının etkileşimli bir örneğinde kullanmanın bir yolunu sağlar. Böyle bir dosyaya *module* denir; bir modülden alınan tanımlar diğer modüllere veya *main* modülüne (en üst düzeyde ve hesap makinesi modunda yürütülen bir komut dosyasında erişiminiz olan değişkenlerin derlenmesi) aktarılabilir.

source: A module is a file containing Python definitions and statements. The file name is the module name with the suffix :file:`.py` appended. Within a module, the module's name (as a string) is available as the value of the global variable ``__name__``. For instance, use your favorite text editor to create a file called :file:`fibo.py` in the current directory with the following contents::
tr: Modül, Python tanımlarını ve ifadelerini içeren bir dosyadır. Dosya adı, :file:`.py` son ekini içeren modül adıdır. Bir modül içinde, modülün adı (dize olarak) ``__name__`` genel değişkeninin değeri olarak kullanılabilir. Örneğin, geçerli dizinde aşağıdaki içeriklerle :file:`fibo.py` adlı bir dosya oluşturmak için en sevdiğiniz metin düzenleyicisini kullanın::

source: Now enter the Python interpreter and import this module with the following command::
tr: Şimdi Python yorumlayıcısına girin ve bu modülü aşağıdaki komutla içe aktarın::

source: This does not add the names of the functions defined in ``fibo`` directly to the current :term:`namespace` (see :ref:`tut-scopes` for more details); it only adds the module name ``fibo`` there. Using the module name you can access the functions::
tr: Bu, ``fibo`` 'da tanımlanan işlevlerin adlarını doğrudan geçerli :term:`namespace` 'e eklemez (daha fazla ayrıntı için bkz. :ref:`tut-scopes`); oraya sadece ``fibo`` modül adını ekler. Modül adını kullanarak şu işlevlere erişebilirsiniz:

source: If you intend to use a function often you can assign it to a local name::
tr: Bir işlevi sık sık kullanmayı düşünüyorsanız, işlevi yerel bir ada atayabilirsiniz::

source: More on Modules
tr: Modüller hakkında daha fazla

source: A module can contain executable statements as well as function definitions. These statements are intended to initialize the module. They are executed only the *first* time the module name is encountered in an import statement. [#]_ (They are also run if the file is executed as a script.)
tr: Bir modül, işlev tanımlarının yanı sıra çalıştırılabilir ifadeler de içerebilir. Bu ifadeler modülü başlatmayı amaçlamaktadır. Yalnızca bir import ifadesinde modül adıyla karşılaşıldığında *ilk* kez yürütülürler. [#]_ (Dosya komut dosyası olarak yürütülürse de çalıştırılırlar.)

source: Each module has its own private namespace, which is used as the global namespace by all functions defined in the module. Thus, the author of a module can use global variables in the module without worrying about accidental clashes with a user's global variables. On the other hand, if you know what you are doing you can touch a module's global variables with the same notation used to refer to its functions, ``modname.itemname``.
tr: Her modülün, modülde tanımlanan tüm işlevler tarafından genel ad alanı olarak kullanılan kendi özel ad alanı vardır. Böylece, bir modülün yazarı, bir kullanıcının genel değişkenleriyle yanlışlıkla çakışma endişesi duymadan, modüldeki genel değişkenleri kullanabilir. Öte yandan, ne yaptığınızı biliyorsanız, bir modülün global değişkenlerine, işlevlerine atıfta bulunmak için kullanılan ``modname.itemname`` notasyonuyla dokunabilirsiniz.

source: Modules can import other modules. It is customary but not required to place all :keyword:`import` statements at the beginning of a module (or script, for that matter). The imported module names, if placed at the top level of a module (outside any functions or classes), are added to the module's global namespace.
tr: Modüller diğer modülleri içe aktarabilir. Tüm :keyword:`import` ifadelerinin bir modülün (veya bu konuda betiğin) başına yerleştirilmesi alışılmış bir durumdur ancak gerekli değildir. İçe aktarılan modül adları, bir modülün en üst düzeyine yerleştirilirse (herhangi bir işlev veya sınıfın dışında), modülün genel ad alanına eklenir.

source: There is a variant of the :keyword:`import` statement that imports names from a module directly into the importing module's namespace. For example::
tr: :keyword:`import` ifadesinin, bir modülden adları doğrudan içe aktaran modülün ad alanına aktaran bir çeşidi vardır. Örneğin::

source: This does not introduce the module name from which the imports are taken in the local namespace (so in the example, ``fibo`` is not defined).
tr: Bu, içe aktarmaların yerel ad alanında alındığı modül adını tanıtmaz(bu nedenle örnekte ``fibo`` tanımlanmamıştır).

source: There is even a variant to import all names that a module defines::
tr: Bir modülün tanımladığı tüm adları içe aktarmak için bir varyant bile vardır::

source: This imports all names except those beginning with an underscore (``_``). In most cases Python programmers do not use this facility since it introduces an unknown set of names into the interpreter, possibly hiding some things you have already defined.
tr: Bu, alt çizgiyle başlayanlar (``_``) dışındaki tüm isimleri alır. Çoğu durumda Python programcıları bu özelliği kullanmaz, çünkü yorumlayıcıya bilinmeyen bir ad kümesi ekler ve muhtemelen önceden tanımladığınız bazı şeyleri gizler.

source: Note that in general the practice of importing ``*`` from a module or package is frowned upon, since it often causes poorly readable code. However, it is okay to use it to save typing in interactive sessions.
tr: Genel olarak, bir modülden veya paketten ``*`` içeri aktarma uygulamasının, genellikle okunamayan koda neden olduğundan hoş karşılanmadığına dikkat edin. Ancak, etkileşimli oturumlarda yazmayı kaydetmek için kullanmak sorun değildir.

source: If the module name is followed by :keyword:`!as`, then the name following :keyword:`!as` is bound directly to the imported module.
tr: Modül adının ardından :keyword:`!as` geliyorsa, :keyword:`!as` 'den sonraki ad doğrudan içe aktarılan modüle bağlanır.

source: This is effectively importing the module in the same way that ``import fibo`` will do, with the only difference of it being available as ``fib``.
tr: Bu, modülün ``import fibo`` 'nun yapacağı şekilde etkin bir şekilde içe aktarılmasıdır, tek farkı ``fib`` olarak mevcut olmasıdır.

source: It can also be used when utilising :keyword:`from` with similar effects::
tr: Benzer efektlere sahip :keyword:`from` kullanılırken de kullanılabilir::

source: For efficiency reasons, each module is only imported once per interpreter session. Therefore, if you change your modules, you must restart the interpreter -- or, if it's just one module you want to test interactively, use :func:`importlib.reload`, e.g. ``import importlib; importlib.reload(modulename)``.
tr: Verimlilik nedeniyle, her modül yorumlayıcı oturumu başına yalnızca bir kez içe aktarılır. Bu nedenle, modüllerinizi değiştirirseniz, yorumlayıcıyı yeniden başlatmanız gerekir - veya etkileşimli olarak test etmek istediğiniz tek bir modülse, :func:`importlib.reload`, örneğin ``importlib; importlib.reload(modulename)``.

source: Executing modules as scripts
tr: Modülleri komut dosyası olarak yürütme

source: When you run a Python module with ::
tr: Bir Python modülünü :: ile çalıştırdığınızda::

source: the code in the module will be executed, just as if you imported it, but with the ``__name__`` set to ``"__main__"``. That means that by adding this code at the end of your module::
tr: modüldeki kod, içe aktardığınız gibi yürütülür, ancak ``__name__`` ``"__main__"`` olarak ayarlanır. Bu, modülünüzün sonuna bu kodu ekleyerek:

source: you can make the file usable as a script as well as an importable module, because the code that parses the command line only runs if the module is executed as the "main" file:
tr: dosyayı bir komut dosyası ve içe aktarılabilir bir modül olarak kullanılabilir hale getirebilirsiniz, çünkü komut satırını ayrıştıran kod yalnızca modül "main" dosya olarak yürütülürse çalışır:

source: If the module is imported, the code is not run::
tr: Modül içe aktarılırsa kod çalıştırılmaz::

source: This is often used either to provide a convenient user interface to a module, or for testing purposes (running the module as a script executes a test suite).
tr: Bu genellikle bir modüle uygun bir kullanıcı arabirimi sağlamak veya test amacıyla kullanılır (modülü komut dosyası olarak çalıştırmak bir test paketi yürütür).

source: The Module Search Path
tr: Modül Arama Yolu

source: When a module named :mod:`spam` is imported, the interpreter first searches for a built-in module with that name. These module names are listed in :data:`sys.builtin_module_names`. If not found, it then searches for a file named :file:`spam.py` in a list of directories given by the variable :data:`sys.path`. :data:`sys.path` is initialized from these locations:
tr: :mod:`spam` adlı bir modül içe aktarıldığında, yorumlayıcı önce bu ada sahip yerleşik bir modül arar. Bu modül adları :data:`sys.builtin_module_names` içinde listelenmiştir. Bulunamazsa, :data:`sys.path` değişkeni tarafından verilen dizin listesinde :file:`spam.py` adlı bir dosyayı arar. :data:`sys.path` şu konumlardan başlatılır:

source: The directory containing the input script (or the current directory when no file is specified).
tr: Girdi komut dosyasını içeren dizin (veya dosya belirtilmediğinde geçerli dizin).

source: :envvar:`PYTHONPATH` (a list of directory names, with the same syntax as the shell variable :envvar:`PATH`).
tr: :envvar:`PYTHONPATH` (kabuk değişkeni :envvar:`PATH` ile aynı sözdizimine sahip dizin adlarının listesi).

source: The installation-dependent default (by convention including a ``site-packages`` directory, handled by the :mod:`site` module).
tr: Kuruluma bağlı varsayılan (kural olarak, :mod:`site` modülü tarafından işlenen bir "site-packages" dizini dahil).

source: More details are at :ref:`sys-path-init`.
tr: Daha fazla ayrıntı :ref:`sys-path-init` adresindedir.

source: On file systems which support symlinks, the directory containing the input script is calculated after the symlink is followed. In other words the directory containing the symlink is **not** added to the module search path.
tr: Symlink'leri destekleyen dosya sistemlerinde, symlink izlendikten sonra girdi komut dosyasını içeren dizin hesaplanır. Başka bir deyişle, symlink içeren dizin modül arama yoluna **not** eklenir.

source: After initialization, Python programs can modify :data:`sys.path`. The directory containing the script being run is placed at the beginning of the search path, ahead of the standard library path. This means that scripts in that directory will be loaded instead of modules of the same name in the library directory. This is an error unless the replacement is intended. See section :ref:`tut-standardmodules` for more information.
tr: Başlatıldıktan sonra Python programları :data:`sys.path` değiştirebilir. Çalıştırılmakta olan komut dosyasını içeren dizin, arama yolunun başına, standart kitaplık yolunun önüne yerleştirilir. Bu, kitaplık dizininde aynı ada sahip modüller yerine bu dizindeki komut dosyalarının yüklanacağı anlamına gelir. Değiştirme amaçlanmadığı sürece bu bir hatadır. Daha fazla bilgi için :ref:`tut-standardmodules` bölümüne bakın.

source: "Compiled" Python files
tr: "Derlenmiş" Python dosyaları

source: To speed up loading modules, Python caches the compiled version of each module in the ``__pycache__`` directory under the name :file:`module.{version}.pyc`, where the version encodes the format of the compiled file; it generally contains the Python version number. For example, in CPython release 3.3 the compiled version of spam.py would be cached as ``__pycache__/spam.cpython-33.pyc``. This naming convention allows compiled modules from different releases and different versions of Python to coexist.
tr: Modüllerin yüklenmesini hızlandırmak için Python, her modülün derlenmiş sürümünü ``__pycache__`` dizininde :file:`module.{version}.pyc` adı altında önbelleğe alır; burada sürüm, derlenen dosyanın biçimini kodlar; genellikle Python sürüm numarasını içerir. Örneğin, CPython 3.3 sürümünde spam.py'nin derlenmiş sürümü ``__pycache__/spam.cpython-33.pyc`` olarak önbelleğe alınacaktır. Bu adlandırma kuralı, farklı sürümlerden ve Python'un farklı sürümlerinden derlenmiş modüllerin bir arada var olmasına izin verir.

source: Python checks the modification date of the source against the compiled version to see if it's out of date and needs to be recompiled. This is a completely automatic process. Also, the compiled modules are platform-independent, so the same library can be shared among systems with different architectures.
tr: Python, eski olup olmadığını ve yeniden derlenmesi gerekip gerekmediğini görmek için kaynağın değişiklik tarihini derlenmiş sürümle karşılaştırır. Bu tamamen otomatik bir işlemdir. Ayrıca, derlenen modüller platformdan bağımsızdır, bu nedenle aynı kitaplık farklı mimarilere sahip sistemler arasında paylaşılabilir.

source: Python does not check the cache in two circumstances. First, it always recompiles and does not store the result for the module that's loaded directly from the command line. Second, it does not check the cache if there is no source module. To support a non-source (compiled only) distribution, the compiled module must be in the source directory, and there must not be a source module.
tr: Python iki durumda önbelleği kontrol etmez. İlk olarak, doğrudan komut satırından yüklenen modülün sonucunu her zaman yeniden derler ve saklamaz. İkincisi, kaynak modül yoksa önbelleği kontrol etmez. Kaynak olmayan (yalnızca derlenmiş) bir dağıtımı desteklemek için, derlenen modül kaynak dizinde olmalı ve bir kaynak modül olmamalıdır.

source: Some tips for experts:
tr: Uzmanlar için bazı ipuçları:

source: You can use the :option:`-O` or :option:`-OO` switches on the Python command to reduce the size of a compiled module. The ``-O`` switch removes assert statements, the ``-OO`` switch removes both assert statements and __doc__ strings. Since some programs may rely on having these available, you should only use this option if you know what you're doing. "Optimized" modules have an ``opt-`` tag and are usually smaller. Future releases may change the effects of optimization.
tr: Derlenmiş bir modülün boyutunu küçültmek için Python komutundaki :option:`-O` veya :option:`-OO` anahtarlarını kullanabilirsiniz. ``-O`` anahtarı, onaylama ifadelerini kaldırır, ``-OO`` anahtarı, hem assert ifadelerini hem de __doc__ dizelerini kaldırır. Bazı programlar bunların kullanılabilir olmasına güvenebileceğinden, bu seçeneği yalnızca ne yaptığınızı biliyorsanız kullanmalısınız. "Optimize edilmiş" modüller bir "opt-" etiketine sahiptir ve genellikle daha küçüktür. Gelecekteki sürümler, optimizasyonun etkilerini değiştirebilir.

source: A program doesn't run any faster when it is read from a ``.pyc`` file than when it is read from a ``.py`` file; the only thing that's faster about ``.pyc`` files is the speed with which they are loaded.
tr: Bir program ``.pyc`` dosyasından okunduğunda, ``.py`` dosyasından okunduğundan daha hızlı çalışmaz; ``.pyc`` dosyaları hakkında daha hızlı olan tek şey, yüklenme hızlarıdır.

source: The module :mod:`compileall` can create .pyc files for all modules in a directory.
tr: :mod:`compileall` modülü, bir dizindeki tüm modüller için .pyc dosyaları oluşturabilir.

source: There is more detail on this process, including a flow chart of the decisions, in :pep:`3147`.
tr: :pep:`3147` 'de, kararların bir akış şeması da dahil olmak üzere, bu süreç hakkında daha fazla ayrıntı bulunmaktadır.

source: Standard Modules
tr: Standart modüller

source: Python comes with a library of standard modules, described in a separate document, the Python Library Reference ("Library Reference" hereafter). Some modules are built into the interpreter; these provide access to operations that are not part of the core of the language but are nevertheless built in, either for efficiency or to provide access to operating system primitives such as system calls. The set of such modules is a configuration option which also depends on the underlying platform. For example, the :mod:`winreg` module is only provided on Windows systems. One particular module deserves some attention: :mod:`sys`, which is built into every Python interpreter. The variables ``sys.ps1`` and ``sys.ps2`` define the strings used as primary and secondary prompts::
tr: Python, ayrı bir belge olan Python Kütüphanesi Referansında (bundan sonra "Kütüphane Referansı") açıklanan standart modüllerden oluşan bir kütüphane ile birlikte gelir. Bazı modüller yorumlayıcıya yerleştirilmiştir; bunlar, dilin çekirdeğinin bir parçası olmayan, ancak yine de verimlilik için veya sistem çağrıları gibi işletim sistemi ilkellerine erişim sağlamak için yerleşik olan işlemlere erişim sağlar. Bu tür modüller seti, aynı zamanda temel platforma da bağlı olan bir yapılandırma seçeneğidir. Örneğin, :mod:`winreg` modülü yalnızca Windows sistemlerinde sağlanır. Belirli bir modül biraz ilgiyi hak ediyor: Her Python yorumlayıcısında yerleşik olan :mod:`sys`. ``sys.ps1`` ve ``sys.ps2`` değişkenleri, birincil ve ikincil bilgi istemleri olarak kullanılan dizeleri tanımlar:

source: These two variables are only defined if the interpreter is in interactive mode.
tr: Bu iki değişken yalnızca yorumlayıcı etkileşimli moddaysa tanımlanır.

source: The variable ``sys.path`` is a list of strings that determines the interpreter's search path for modules. It is initialized to a default path taken from the environment variable :envvar:`PYTHONPATH`, or from a built-in default if :envvar:`PYTHONPATH` is not set. You can modify it using standard list operations::
tr: ``sys.path`` değişkeni, yorumlayıcının modüller için arama yolunu belirleyen bir dizeler listesidir. :envvar:`PYTHONPATH` ortam değişkeninden veya :envvar:`PYTHONPATH` ayarlanmamışsa yerleşik bir varsayılan değerden alınan varsayılan bir yola başlatılır. Standart liste işlemlerini kullanarak değiştirebilirsiniz::

source: The :func:`dir` Function
tr: :func:`dir` Fonksiyonu

source: The built-in function :func:`dir` is used to find out which names a module defines. It returns a sorted list of strings::
tr: Yerleşik fonksiyon :func:`dir`, bir modülün hangi adları tanımladığını bulmak için kullanılır. Sıralanmış bir dize listesi döndürür::

source: Without arguments, :func:`dir` lists the names you have defined currently::
tr: Argümanlar olmadan, :func:`dir`, şu anda tanımladığınız adları listeler::

source: Note that it lists all types of names: variables, modules, functions, etc.
tr: Her tür adın listelendiğini unutmayın: değişkenler, modüller, fonksiyonlar vb.

source: :func:`dir` does not list the names of built-in functions and variables. If you want a list of those, they are defined in the standard module :mod:`builtins`::
tr: :func:`dir` yerleşik fonksiyonlarun ve değişkenlerin adlarını listelemez. Bunların bir listesini istiyorsanız, standart modül :mod:`builtins` 'de tanımlanırlar::

source: Packages
tr: Paketler

source: Packages are a way of structuring Python's module namespace by using "dotted module names". For example, the module name :mod:`A.B` designates a submodule named ``B`` in a package named ``A``. Just like the use of modules saves the authors of different modules from having to worry about each other's global variable names, the use of dotted module names saves the authors of multi-module packages like NumPy or Pillow from having to worry about each other's module names.
tr: Paketler, "noktalı modül adlarını" kullanarak Python'un modül ad alanını yapılandırmanın bir yoludur. Örneğin, modül adı :mod:`A.B`, "A" adlı bir pakette "B" adlı bir alt modülü belirtir. Modüllerin kullanılması, farklı modüllerin yazarlarını birbirlerinin global değişken adları hakkında endişelenmekten kurtardığı gibi, noktalı modül adlarının kullanılması, NumPy veya Pillow gibi çok modüllü paketlerin yazarlarını birbirlerinin modül adları hakkında endişelenmekten kurtarır.

source: Suppose you want to design a collection of modules (a "package") for the uniform handling of sound files and sound data. There are many different sound file formats (usually recognized by their extension, for example: :file:`.wav`, :file:`.aiff`, :file:`.au`), so you may need to create and maintain a growing collection of modules for the conversion between the various file formats. There are also many different operations you might want to perform on sound data (such as mixing, adding echo, applying an equalizer function, creating an artificial stereo effect), so in addition you will be writing a never-ending stream of modules to perform these operations. Here's a possible structure for your package (expressed in terms of a hierarchical filesystem):
tr: Ses dosyalarının ve ses verilerinin tek tip işlenmesi için bir modül koleksiyonu ("paket") tasarlamak istediğinizi varsayalım. Birçok farklı ses dosyası biçimi vardır (genellikle uzantılarıyla tanınır, örneğin: :file:`.wav`, :file:`.aiff`, :file:`.au`) bu nedenle, çeşitli dosya biçimleri arasında dönüşüm için büyüyen bir modül koleksiyonu oluşturmanız ve sürdürmeniz gerekebilir. Ses verileri üzerinde gerçekleştirmek isteyebileceğiniz birçok farklı işlem de vardır (karıştırma, eko ekleme, ekolayzır işlevi uygulama, yapay bir stereo efekti oluşturma gibi) bu nedenle ek olarak, bu işlemleri gerçekleştirmek için hiç bitmeyen bir modül akışı yazıyor olacaksınız. İşte paketiniz için olası bir yapı (hiyerarşik bir dosya sistemi cinsinden ifade edilir):

source: When importing the package, Python searches through the directories on ``sys.path`` looking for the package subdirectory.
tr: Paketi içe aktarırken Python, paket alt dizinini arayan ``sys.path`` üzerindeki dizinleri arar.
