Repository: python/python-docs-tr
Catalog: tutorial/modules.po
Languages: tr

source: The :file:`__init__.py` files are required to make Python treat directories containing the file as packages. This prevents directories with a common name, such as ``string``, unintentionally hiding valid modules that occur later on the module search path. In the simplest case, :file:`__init__.py` can just be an empty file, but it can also execute initialization code for the package or set the ``__all__`` variable, described later.
tr: Python'un dosyayı içeren dizinleri paketler olarak ele alması için :file:`__init__.py` dosyaları gereklidir. Bu, ``string`` gibi ortak bir ada sahip dizinlerin, daha sonra modül arama yolunda oluşan geçerli modülleri istemeden gizlemesini önler. En basit durumda, :file:`__init__.py` yalnızca boş bir dosya olabilir, ancak aynı zamanda paket için başlatma kodunu çalıştırabilir veya daha sonra açıklanacak olan ``__all__`` değişkenini ayarlayabilir.

source: Users of the package can import individual modules from the package, for example::
tr: Paketin kullanıcıları, paketin içindeki ayrı modülleri içe aktarabilir, örneğin::

source: This loads the submodule :mod:`sound.effects.echo`. It must be referenced with its full name. ::
tr: Bu, :mod:`sound.effects.echo` alt modülünü yükler. Tam adı ile referans gösterilmelidir. ::

source: An alternative way of importing the submodule is::
tr: Alt modülü içe aktarmanın alternatif bir yolu::

source: This also loads the submodule :mod:`echo`, and makes it available without its package prefix, so it can be used as follows::
tr: Bu ayrıca :mod:`echo` alt modülünü yükler ve paket öneki olmadan kullanılabilir hale getirir, böylece aşağıdaki gibi kullanılabilir::

source: Yet another variation is to import the desired function or variable directly::
tr: Yine başka bir varyasyon, istenen işlevi veya değişkeni doğrudan içe aktarmaktır::

source: Again, this loads the submodule :mod:`echo`, but this makes its function :func:`echofilter` directly available::
tr: Yine, bu, :mod:`echo` alt modülünü yükler, ancak bu, :func:`echofilter` fonksiyonunu doğrudan kullanılabilir hale getirir::

source: Note that when using ``from package import item``, the item can be either a submodule (or subpackage) of the package, or some other name defined in the package, like a function, class or variable. The ``import`` statement first tests whether the item is defined in the package; if not, it assumes it is a module and attempts to load it. If it fails to find it, an :exc:`ImportError` exception is raised.
tr: ``from package import item`` kullanırken, öğenin paketin bir alt modülü (veya alt paketi) veya pakette tanımlanmış bir fonksiyon, sınıf veya değişken gibi başka bir ad olabileceğini unutmayın. ``import`` ifadesi önce öğenin pakette tanımlanıp tanımlanmadığını test eder; değilse modül olduğunu varsayar ve yüklemeye çalışır. Onu bulamazsa, bir :exc:`ImportError` istisnası ortaya çıkar.

source: Contrarily, when using syntax like ``import item.subitem.subsubitem``, each item except for the last must be a package; the last item can be a module or a package but can't be a class or function or variable defined in the previous item.
tr: Aksine, ``import item.subitem.subsubitem`` gibi bir sözdizimi kullanırken, sonuncusu hariç her öğe bir paket olmalıdır; son öğe bir modül veya paket olabilir, ancak önceki öğede tanımlanan bir sınıf, fonksiyon veya değişken olamaz.

source: Importing \* From a Package
tr: Bir Paketten \* İçe Aktarma

source: Now what happens when the user writes ``from sound.effects import *``? Ideally, one would hope that this somehow goes out to the filesystem, finds which submodules are present in the package, and imports them all. This could take a long time and importing sub-modules might have unwanted side-effects that should only happen when the sub-module is explicitly imported.
tr: Şimdi, kullanıcı ``from sound.effects import *`` yazdığında ne olur? İdeal olarak, bunun bir şekilde dosya sistemine gitmesi, pakette hangi alt modüllerin bulunduğunu bulması ve hepsini içe aktarması umulur. Bu uzun zaman alabilir ve alt modüllerin içe aktarılması, yalnızca alt modül açıkça içe aktarıldığında gerçekleşmesi gereken istenmeyen yan etkilere neden olabilir.

source: The only solution is for the package author to provide an explicit index of the package. The :keyword:`import` statement uses the following convention: if a package's :file:`__init__.py` code defines a list named ``__all__``, it is taken to be the list of module names that should be imported when ``from package import *`` is encountered. It is up to the package author to keep this list up-to-date when a new version of the package is released. Package authors may also decide not to support it, if they don't see a use for importing \* from their package. For example, the file :file:`sound/effects/__init__.py` could contain the following code::
tr: Tek çözüm, paket yazarının paketin açık bir dizinini sağlamasıdır. :keyword:`import` ifadesi aşağıdaki kuralı kullanır: eğer bir paketin :file:`__init__.py` kodu ``__all__`` adlı bir liste tanımlarsa, ``from package import *`` ile karşılaşıldığında alınması gereken modül adlarının listesi olarak alınır. Paketin yeni bir sürümü yayınlandığında bu listeyi güncel tutmak paket yazarının sorumluluğundadır. Paket yazarları, paketlerinden \* içe aktarmak için bir kullanım görmezlerse, onu desteklememeye de karar verebilirler. Örneğin, :file:`sound/effects/__init__.py` dosyası şu kodu içerebilir::

source: This would mean that ``from sound.effects import *`` would import the three named submodules of the :mod:`sound.effects` package.
tr: Bu, ``from sound.effects import *`` öğesinin :mod:`sound` paketinin adlandırılmış üç alt modülünü içe aktaracağı anlamına gelir.

source: If ``__all__`` is not defined, the statement ``from sound.effects import *`` does *not* import all submodules from the package :mod:`sound.effects` into the current namespace; it only ensures that the package :mod:`sound.effects` has been imported (possibly running any initialization code in :file:`__init__.py`) and then imports whatever names are defined in the package. This includes any names defined (and submodules explicitly loaded) by :file:`__init__.py`. It also includes any submodules of the package that were explicitly loaded by previous :keyword:`import` statements. Consider this code::
tr: ``__all__`` tanımlı değilse, ``from sound.effects import *`` ifadesi :mod:`sound.effects` paketindeki tüm alt modülleri geçerli ad alanına *almaz*; yalnızca :mod:`sound.effects` paketinin içe aktarılmasını sağlar (mümkünse herhangi bir başlatma kodunu :file:`__init__.py` içinde çalıştırır) ve ardından pakette tanımlanan adları içe aktarır. Bu, :file:`__init__.py` tarafından tanımlanan tüm adları (ve açıkça yüklenen alt modülleri) içerir. Ayrıca, önceki :keyword:`import` ifadeleri tarafından açıkça yüklenen paketin tüm alt modüllerini de içerir. Bu kodu dikkate alın ::

source: In this example, the :mod:`echo` and :mod:`surround` modules are imported in the current namespace because they are defined in the :mod:`sound.effects` package when the ``from...import`` statement is executed. (This also works when ``__all__`` is defined.)
tr: Bu örnekte, :mod:`echo` ve :mod:`surround` modülleri geçerli ad alanına aktarılır, çünkü bunlar ``from...import`` ifadesi yürütüldüğünde :mod:`sound.effects` paketinde tanımlanmışlardır. (Bu aynı zamanda ``__all__`` tanımlandığında da çalışır.)

source: Although certain modules are designed to export only names that follow certain patterns when you use ``import *``, it is still considered bad practice in production code.
tr: Bazı modüller, ``import *`` kullandığınızda yalnızca belirli kalıpları takip eden adları dışa aktarmak üzere tasarlanmış olsa da, üretim kodunda yine de kötü uygulama olarak kabul edilir.

source: Remember, there is nothing wrong with using ``from package import specific_submodule``! In fact, this is the recommended notation unless the importing module needs to use submodules with the same name from different packages.
tr: Unutmayın, ``from package import specific_submodule`` kullanmanın yanlış bir tarafı yok! Aslında, içe aktarma modülünün farklı paketlerden aynı ada sahip alt modülleri kullanması gerekmedikçe, önerilen gösterim budur.

source: Intra-package References
tr: Paket İçi Referanslar

source: When packages are structured into subpackages (as with the :mod:`sound` package in the example), you can use absolute imports to refer to submodules of siblings packages. For example, if the module :mod:`sound.filters.vocoder` needs to use the :mod:`echo` module in the :mod:`sound.effects` package, it can use ``from sound.effects import echo``.
tr: Paketler alt paketler halinde yapılandırıldığında (örnekteki :mod:`sound` paketinde olduğu gibi), kardeş paketlerin alt modüllerine atıfta bulunmak için mutlak içe aktarma kullanabilirsiniz. Örneğin, :mod:`sound.filters.vocoder` modülünün :mod:`sound.effects` paketindeki :mod:`echo` modülünü kullanması gerekiyorsa, ``from sound.effects import echo`` 'yu kullanabilir.

source: You can also write relative imports, with the ``from module import name`` form of import statement. These imports use leading dots to indicate the current and parent packages involved in the relative import. From the :mod:`surround` module for example, you might use::
tr: Ayrıca, içe aktarma ifadesinin ``from module import name`` formuyla göreli içe aktarmaları da yazabilirsiniz. Bu içe aktarmalar, göreli içe aktarmada yer alan mevcut ve ana paketleri belirtmek için baştaki noktaları kullanır. Örneğin :mod:`surround` modülünden şunları kullanabilirsiniz::

source: Note that relative imports are based on the name of the current module. Since the name of the main module is always ``"__main__"``, modules intended for use as the main module of a Python application must always use absolute imports.
tr: Göreceli içe aktarmaların geçerli modülün adını temel aldığını unutmayın. Ana modülün adı her zaman ``"__main__"`` olduğundan, Python uygulamasının ana modülü olarak kullanılması amaçlanan modüller her zaman mutlak içe aktarma kullanmalıdır.

source: Packages in Multiple Directories
tr: Birden Çok Dizindeki Paketler

source: Packages support one more special attribute, :attr:`__path__`. This is initialized to be a list containing the name of the directory holding the package's :file:`__init__.py` before the code in that file is executed. This variable can be modified; doing so affects future searches for modules and subpackages contained in the package.
tr: Paketler bir özel özelliği daha destekler, :attr:`__path__`. Bu, o dosyadaki kod yürütülmeden önce paketin :file:`__init__.py` dosyasını tutan dizinin adını içeren bir liste olacak şekilde başlatılır. Bu değişken değiştirilebilir; bunu yapmak, pakette bulunan modüller ve alt paketler için gelecekteki aramaları etkiler.

source: While this feature is not often needed, it can be used to extend the set of modules found in a package.
tr: Bu özelliğe sıklıkla ihtiyaç duyulmasa da, bir pakette bulunan modül dizisini genişletmek için kullanılabilir.

source: Footnotes
tr: Dipnotlar

source: In fact function definitions are also 'statements' that are 'executed'; the execution of a module-level function definition adds the function name to the module's global namespace.
tr: Aslında işlev tanımları aynı zamanda 'çalıştırılan' 'ifadelerdir'; modül düzeyinde bir işlev tanımının çalıştırılması, işlev adını modülün genel ad alanına ekler.
