Repository: python/python-docs-tr
Catalog: tutorial/venv.po
Languages: tr

source: Virtual Environments and Packages
tr: Sanal Ortamlar ve Paketler

source: Introduction
tr: Tanıtım

source: Python applications will often use packages and modules that don't come as part of the standard library. Applications will sometimes need a specific version of a library, because the application may require that a particular bug has been fixed or the application may be written using an obsolete version of the library's interface.
tr: Python uygulamaları genellikle standart kütüphanenin bir parçası olmayan paketleri ve modülleri kullanır. Uygulama bazen kütüphanenin spesifik bir sürümüne ihtiyaç duyar, çünkü uygulama belirli bir hatanın düzeltilmiş olmasını veya uygulamanın kütüphanenin arabiriminin eski bir sürümü kullanılarak yazılmasını gerektirebilir.

source: This means it may not be possible for one Python installation to meet the requirements of every application. If application A needs version 1.0 of a particular module but application B needs version 2.0, then the requirements are in conflict and installing either version 1.0 or 2.0 will leave one application unable to run.
tr: Bu, bir Python yüklemesinin, her uygulamanın gereksinimlerini karşılamasının mümkün olmayabileceği anlamına gelir. Bir A uygulaması belirli bir modülün 1.0 sürümüne, bir B uygulaması ise 2.0 sürümüne ihtiyaç duyuyorsa, sürümlerin farklı olmasından dolayı versiyon 1.0 veya 2.0'ı yüklemek A veya B uygulamasından birini çalışmaz hale getirecektir.

source: The solution for this problem is to create a :term:`virtual environment`, a self-contained directory tree that contains a Python installation for a particular version of Python, plus a number of additional packages.
tr: Bu sorunun çözümü, spesifik bir Python sürümü için Python yüklemesi ve bir dizi ek paket içeren bağımsız bir dizin ağacı olan :term:`virtual environment` (sanal ortam) oluşturmaktır.

source: Different applications can then use different virtual environments. To resolve the earlier example of conflicting requirements, application A can have its own virtual environment with version 1.0 installed while application B has another virtual environment with version 2.0. If application B requires a library be upgraded to version 3.0, this will not affect application A's environment.
tr: Bu sayede farklı uygulamalar farklı sanal ortamlar kullanabilir. Çakışan gereksinimlerin önceki örneğini çözmek için, A uygulamasının sanal ortamında sürüm 1.0 yüklüyken, B uygulamasının sanal ortamında sürüm 2.0 yüklü olabilir. B uygulaması bir kitaplığın sürüm 3.0'a yükseltilmesini gerektiriyorsa, bu uygulama A'nın ortamını etkilemez.

source: Creating Virtual Environments
tr: Sanal Ortamlar Oluşturma

source: The module used to create and manage virtual environments is called :mod:`venv`. :mod:`venv` will usually install the most recent version of Python that you have available. If you have multiple versions of Python on your system, you can select a specific Python version by running ``python3`` or whichever version you want.
tr: Sanal ortamlar oluşturmak ve yönetmek için kullanılan modüle :mod:`venv` denir. :mod:`venv` genellikle mevcut olan en son Python sürümünü yükler. Sisteminizde birden fazla Python sürümü varsa, ``python3`` veya istediğiniz sürümü çalıştırarak belirli bir Python sürümünü seçebilirsiniz.

source: To create a virtual environment, decide upon a directory where you want to place it, and run the :mod:`venv` module as a script with the directory path::
tr: Sanal ortam oluşturmak için, yerleştirmek istediğiniz dizine karar verin ve :mod:`venv` modülünü dizin yolu ile bir komut dosyası olarak çalıştırın::

source: This will create the ``tutorial-env`` directory if it doesn't exist, and also create directories inside it containing a copy of the Python interpreter and various supporting files.
tr: Bu, eğer yoksa ``tutorial-env`` dizinini oluşturur ve ayrıca Python derleyicisinin bir kopyasını ve çeşitli destekleyici dosyaları içeren dizinler oluşturur.

source: A common directory location for a virtual environment is ``.venv``. This name keeps the directory typically hidden in your shell and thus out of the way while giving it a name that explains why the directory exists. It also prevents clashing with ``.env`` environment variable definition files that some tooling supports.
tr: Sanal ortam için ortak bir dizin konumu ``.venv`` 'dir. Bu ad, dizini genellikle kabuğunuzda gizli tutar ve böylece dizinin neden var olduğunu açıklayan bir ad verirken aradan uzak tutar. Ayrıca, bazı araç çalıştırmanın desteklediği ``.env`` ortam değişkeni tanım dosyalarıyla çakışmayı önler.

source: Once you've created a virtual environment, you may activate it.
tr: Sanal bir ortam oluşturduktan sonra onu etkinleştirebilirsiniz.

source: On Windows, run::
tr: Windows'da çalıştır::

source: On Unix or MacOS, run::
tr: Unix veya MacOS'ta çalıştır::

source: (This script is written for the bash shell. If you use the :program:`csh` or :program:`fish` shells, there are alternate ``activate.csh`` and ``activate.fish`` scripts you should use instead.)
tr: (Bu komut dosyası bash kabuğu için yazılmıştır. Eğer :program:`csh` veya :program:`fish` kabuklarını kullanıyorsanız, bunun yerine ``activate.csh`` veya ``activate.fish`` komut dosyalarını kullanmanız gerekmektedir.)

source: Activating the virtual environment will change your shell's prompt to show what virtual environment you're using, and modify the environment so that running ``python`` will get you that particular version and installation of Python. For example:
tr: Sanal ortamı etkinleştirmek, hangi sanal ortamı kullandığınızı göstermek için kabuğunuzun görünüşünü değiştirir ve ortamı değiştirerek ``python`` komutunun belirlediğiniz spesifik Python kurulumunu ve sürümünü çalıştırmasını sağlar. Mesela:

source: To deactivate a virtual environment, type::
tr: Bir sanal ortamı devre dışı bırakmak için şunu yazın::

source: into the terminal.
tr: terminalin içine.

source: Managing Packages with pip
tr: Paketleri pip ile Yönetme

source: You can install, upgrade, and remove packages using a program called :program:`pip`. By default ``pip`` will install packages from the `Python Package Index <https://pypi.org>`_. You can browse the Python Package Index by going to it in your web browser.
tr: :program:`pip` adlı bir program kullanarak paketleri yükleyebilir, yükseltebilir ve kaldırabilirsiniz. Varsayılan olarak ``pip``, `Python Paket Dizini <https://pypi.org>`_ 'nden paketler yükler. Python Paket Dizini'ne web tarayıcınızdan giderek göz atabilirsiniz.

source: ``pip`` has a number of subcommands: "install", "uninstall", "freeze", etc. (Consult the :ref:`installing-index` guide for complete documentation for ``pip``.)
tr: ``pip`` bir dizi alt komut içerir: "install" (yükle), "uninstall" (kaldır), "freeze" (dondur), vb. (``pip`` için eksiksiz dokümantasyon için :ref:`installing-index` rehberine bakın.)

source: You can install the latest version of a package by specifying a package's name:
tr: Paketin adını belirterek paketin en son sürümünü yükleyebilirsiniz:

source: You can also install a specific version of a package by giving the package name followed by ``==`` and the version number:
tr: Paketin belirli bir sürümünü, paket adını ve ardından ``==`` ve sürüm numarasını vererek de yükleyebilirsiniz:

source: If you re-run this command, ``pip`` will notice that the requested version is already installed and do nothing. You can supply a different version number to get that version, or you can run ``python -m pip install --upgrade`` to upgrade the package to the latest version:
tr: Bu komutu tekrar çalıştırırsanız, ``pip`` istenen sürümün kurulu olduğunu fark edecek ve hiçbir şey yapmayacaktır. Bu sürümü almak için farklı bir sürüm numarası sağlayabilir veya paketi en son sürüme yükseltmek için ``python -m pip install --upgrade`` komutunu çalıştırabilirsiniz:

source: ``python -m pip uninstall`` followed by one or more package names will remove the packages from the virtual environment.
tr: ``python -m pip uninstall`` ve ardından gelen bir veya daha fazla paket adı, paketleri sanal ortamdan kaldıracaktır.

source: ``python -m pip show`` will display information about a particular package:
tr: ``python -m pip show`` belirli bir paket hakkındaki bilgileri görüntüleyecektir:

source: ``python -m pip list`` will display all of the packages installed in the virtual environment:
tr: ``python -m pip list`` sanal ortamda yüklü olan tüm paketleri gösterecektir:

source: ``python -m pip freeze`` will produce a similar list of the installed packages, but the output uses the format that ``python -m pip install`` expects. A common convention is to put this list in a ``requirements.txt`` file:
tr: ``python -m pip freeze`` yüklü paketlerin benzer bir listesini üretecektir, ancak çıktı ``python -m pip install``'ın beklediği biçimi kullanır. Genel bir kullanım bu listeyi bir ``requirements.txt`` dosyasına koymaktır:

source: The ``requirements.txt`` can then be committed to version control and shipped as part of an application. Users can then install all the necessary packages with ``install -r``:
tr: ``requirements.txt`` daha sonra sürüm denetimine kaydedilebilir ve bir uygulamanın parçası olarak gönderilebilir. Kullanıcılar daha sonra gerekli tüm paketleri ``install -r`` ile yükleyebilir:

source: ``pip`` has many more options. Consult the :ref:`installing-index` guide for complete documentation for ``pip``. When you've written a package and want to make it available on the Python Package Index, consult the :ref:`distributing-index` guide.
tr: ``pip`` daha birçok seçeneğe sahiptir. ``pip`` için eksiksiz dokümantasyona :ref:`installing-index` adresinden ulaşabilirsiniz. Bir paket yazdığınızda ve paketi Python Paket Dizini'nde kullanılabilir hale getirmek istediğinizde :ref:`distributing-index` rehberine bakın.
