Repository: python/python-docs-tr
Catalog: tutorial/whatnow.po
Languages: tr

source: What Now?
tr: Sırada Ne Var?

source: Reading this tutorial has probably reinforced your interest in using Python --- you should be eager to apply Python to solving your real-world problems. Where should you go to learn more?
tr: Bu öğreticiyi okumak muhtemelen Python'u kullanmaya olan ilginizi pekiştirdi --- Python'u gerçek dünyadaki sorunlarınızı çözmek için kullanmaya istekli olmalısınız. Daha fazla bilgi edinmek için nereye gitmelisiniz?

source: This tutorial is part of Python's documentation set. Some other documents in the set are:
tr: Bu öğretici Python'un dokümantasyon kümesinin bir parçasıdır. Kümedeki diğer bazı belgeler şunlardır:

source: You should browse through this manual, which gives complete (though terse) reference material about types, functions, and the modules in the standard library. The standard Python distribution includes a *lot* of additional code. There are modules to read Unix mailboxes, retrieve documents via HTTP, generate random numbers, parse command-line options, compress data, and many other tasks. Skimming through the Library Reference will give you an idea of what's available.
tr: Standart kütüphanedeki türler, fonksiyonlar ve modüller hakkında eksiksiz (özlü de olsa) referans materyali sağlayan bu kılavuza göz atmalısınız. Standart Python dağıtımı *birçok* ek kod içerir. Unix posta kutularını okumak, belgeleri HTTP yoluyla almak, rastgele sayılar oluşturmak, komut satırı seçeneklerini ayrıştırmak, verileri sıkıştırmak ve diğer birçok görev için modüller vardır. Kütüphane Referansını gözden geçirmek size nelerin mevcut olduğu hakkında bir fikir verecektir.

source: :ref:`installing-index` explains how to install additional modules written by other Python users.
tr: :ref:`installing-index` , diğer Python kullanıcıları tarafından yazılan ek modüllerin nasıl yükleneceğini açıklar.

source: :ref:`reference-index`: A detailed explanation of Python's syntax and semantics. It's heavy reading, but is useful as a complete guide to the language itself.
tr: :ref:`reference-index`: Python sözdiziminin ve anlambiliminin ayrıntılı bir açıklaması. Ağır bir metin, ancak dilin kendisi için eksiksiz bir rehber olarak yararlıdır.

source: More Python resources:
tr: Diğer Python kaynakları:

source: https://www.python.org: The major Python web site. It contains code, documentation, and pointers to Python-related pages around the web.
tr: https://www.python.org: Başlıca Python web sitesi. Web'deki Python ile ilgili sayfalara yönelik kod, belgeler ve işaretçiler içerir.

source: https://docs.python.org: Fast access to Python's documentation.
tr: https://docs.python.org: Python belgelerine hızlı erişim.

source: https://pypi.org: The Python Package Index, previously also nicknamed the Cheese Shop [#]_, is an index of user-created Python modules that are available for download. Once you begin releasing code, you can register it here so that others can find it.
tr: https://pypi.org: Daha önce Cheese Shop [#]_, olarak da adlandırılan Python Paket Dizini, kullanıcılar tarafından oluşturulan indirilebilir Python modülleri dizinidir. Kodlarınızı yayınlamaya başladıktan sonra, başkalarının bulabilmesi için buraya kaydedebilirsiniz.

source: https://code.activestate.com/recipes/langs/python/: The Python Cookbook is a sizable collection of code examples, larger modules, and useful scripts. Particularly notable contributions are collected in a book also titled Python Cookbook (O'Reilly & Associates, ISBN 0-596-00797-3.)
tr: https://code.activestate.com/recipes/langs/python/: Python Yemek Tarifleri; kod örnekleri, daha geniş çaplı modüller ve kullanışlı kodların büyük bir koleksiyonudur. Özellikle dikkat çekici katkılar Python Cookbook (O'Reilly & Associates, ISBN 0-596-00797-3) adlı bir kitapta toplanır.

source: https://pyvideo.org collects links to Python-related videos from conferences and user-group meetings.
tr: https://pyvideo.org, konferanslardan ve kullanıcı grubu toplantılarından Python ile ilgili videolara bağlantılar toplar.

source: https://scipy.org: The Scientific Python project includes modules for fast array computations and manipulations plus a host of packages for such things as linear algebra, Fourier transforms, non-linear solvers, random number distributions, statistical analysis and the like.
tr: https://scipy.org: Scientific Python projesi, hızlı dizi hesaplamaları ve manipülasyonları için modüllerin yanı sıra doğrusal cebir, Fourier dönüşümleri, doğrusal olmayan çözücüler, rastgele sayı dağılımları, istatistiksel analiz ve benzeri şeyler için bir dizi paket içerir.

source: For Python-related questions and problem reports, you can post to the newsgroup :newsgroup:`comp.lang.python`, or send them to the mailing list at python-list@python.org. The newsgroup and mailing list are gatewayed, so messages posted to one will automatically be forwarded to the other. There are hundreds of postings a day, asking (and answering) questions, suggesting new features, and announcing new modules. Mailing list archives are available at https://mail.python.org/pipermail/.
tr: Python ile ilgili sorular ve sorun raporları için haber grubu :newsgroup:`comp.lang.python` adresine gönderebilir veya bunları python-list@python.org posta listesine gönderebilirsiniz. Haber grubu ve posta listesi aynı ağ içinde olduğundan, birine gönderilen iletiler otomatik olarak diğerine iletilir. Günde yüzlerce gönderi geliyor, sorular soruluyor (ve yanıtlanıyor), yeni özellikler öneriliyor ve yeni modüller duyuruluyor. Posta listesi arşivleri için https://mail.python.org/pipermail/.

source: Before posting, be sure to check the list of :ref:`Frequently Asked Questions <faq-index>` (also called the FAQ). The FAQ answers many of the questions that come up again and again, and may already contain the solution for your problem.
tr: Göndermeden önce, :ref:`Sık Sorulan Sorular <faq-index>` (SSS olarak da adlandırılır) listesini kontrol etmeyi unutmayın. SSS, tekrar tekrar gelen soruların çoğunu yanıtlar ve halihazırda sorununuzun çözümünü içeriyor olabilir.

source: Footnotes
tr: Dipnotlar

source: "Cheese Shop" is a Monty Python's sketch: a customer enters a cheese shop, but whatever cheese he asks for, the clerk says it's missing.
tr: "Cheese Shop" Monty Python'un bir çizimidir: bir müşteri peynir dükkanına girer, ancak istediği peynir ne olursa olsun, tezgahtar elinde olmadığını söyler.
