Repository: python/python-docs-tr
Catalog: about.po
Languages: tr

source: About these documents
tr: Dokümanlar hakkında

source: These documents are generated from `reStructuredText`_ sources by `Sphinx`_, a document processor specifically written for the Python documentation.
tr: Bu dokümanlar, Python dokümanları için özel olarak yazılmış bir doküman işlemcisi olan `Sphinx`_ tarafından `reStructuredText`_ kaynaklarından oluşturulur.

source: Development of the documentation and its toolchain is an entirely volunteer effort, just like Python itself. If you want to contribute, please take a look at the :ref:`reporting-bugs` page for information on how to do so. New volunteers are always welcome!
tr: Dokümantasyonun ve araç zincirinin geliştirilmesi, tıpkı Python'un kendisi gibi tamamen gönüllü bir çabadır. Katkıda bulunmak istiyorsanız, nasıl yapacağınıza ilişkin bilgi için lütfen :ref:`reporting-bugs` sayfasına göz atın. Yeni gönüllülere her zaman açığız!

source: Many thanks go to:
tr: Destekleri için teşekkürler:

source: Fred L. Drake, Jr., the creator of the original Python documentation toolset and writer of much of the content;
tr: Fred L. Drake, Jr., orijinal Python dokümantasyon araç setinin yaratıcısı ve içeriğin çoğunun yazarı;

source: the `Docutils <http://docutils.sourceforge.net/>`_ project for creating reStructuredText and the Docutils suite;
tr: reStructuredText ve Docutils program paketini oluşturan `Docutils <http://docutils.sourceforge.net/>`_ projesi;

source: Fredrik Lundh for his `Alternative Python Reference <http://effbot.org/zone/pyref.htm>`_ project from which Sphinx got many good ideas.
tr: Fredrik Lundh, Sphinx'in birçok fikir edindiği `Alternatif Python Referansı <http://effbot.org/zone/pyref.htm>`_ projesi için.

source: Contributors to the Python Documentation
tr: Python Dokümantasyonuna Katkıda Bulunanlar

source: Many people have contributed to the Python language, the Python standard library, and the Python documentation. See :source:`Misc/ACKS` in the Python source distribution for a partial list of contributors.
tr: Birçok kişi Python diline, Python standart kütüphanesine ve Python belgelerine katkıda bulunmuştur. Katkıda bulunanların kısmi listesi için Python kaynak dağıtımında :source:`Misc/ACKS` adresine bakın.

source: It is only with the input and contributions of the Python community that Python has such wonderful documentation -- Thank You!
tr: Python topluluğunun girdileri ve katkılarıyla Python böyle harika bir dokümantasyona sahip -- Teşekkürler!
