Repository: python/python-docs-tr
Catalog: bugs.po
Languages: tr

source: Dealing with Bugs
tr: Hatalarla Başa Çıkmak

source: Python is a mature programming language which has established a reputation for stability. In order to maintain this reputation, the developers would like to know of any deficiencies you find in Python.
tr: Python, istikrar konusunda kendini kanıtlamış olgun bir programlama dilidir. Bu itibarı korumak için, geliştiriciler Python'da bulduğunuz eksiklikleri bilmek isterler.

source: It can be sometimes faster to fix bugs yourself and contribute patches to Python as it streamlines the process and involves less people. Learn how to :ref:`contribute <contributing-to-python>`.
tr: Bazen hataları kendiniz düzeltmek ve değişikliklerinizi Python'a yama yaparak katkı sağlamak süreci daha az insan dahil olduğu için hızlandrabilir. Nasıl katkı sağlayacağınızı :ref:`öğrenin <contributing-to-python>`.

source: Documentation bugs
tr: Dokümantasyon hataları

source: If you find a bug in this documentation or would like to propose an improvement, please submit a bug report on the :ref:`tracker <using-the-tracker>`. If you have a suggestion on how to fix it, include that as well.
tr: Bu dokümantasyonda bir hata bulursanız veya bir geliştirme önermek istiyorsanız, lütfen :ref:`bir hata raporu gönderin <using-the-tracker>`. Nasıl düzeltebileceğiniz hakkında bir öneriniz varsa, bunu da ekleyin.

source: You can also open a discussion item on our `Documentation Discourse forum <https://discuss.python.org/c/documentation/26>`_.
tr: Ayrıca `Dokümantasyon Discourse forumumuzda <https://discuss.python.org/c/documentation/26>`_ bir tartışma öğesi açabilirsiniz.

source: If you're short on time, you can also email documentation bug reports to docs@python.org (behavioral bugs can be sent to python-list@python.org). 'docs@' is a mailing list run by volunteers; your request will be noticed, though it may take a while to be processed.
tr: Zamanınız kısıtlıysa, dokümantasyon hata raporlarını docs@python.org adresine de gönderebilirsiniz (davranış hataları python-list@python.org adresine gönderebilirsiniz). 'docs@', gönüllüler tarafından yürütülen bir posta listesidir; talebiniz fark edilecektir, ancak işlenmesi biraz zaman alabilir.

source: `Documentation bugs`_
tr: `Dokümantasyon hataları`_

source: A list of documentation bugs that have been submitted to the Python issue tracker.
tr: Python sorun takipçisine gönderilen dokümantasyon hatalarının listesi.

source: `Issue Tracking <https://devguide.python.org/tracker/>`_
tr: `Hata Takibi <https://devguide.python.org/tracker/>`_

source: Overview of the process involved in reporting an improvement on the tracker.
tr: Takipçide bir iyileştirmenin bildirilmesiyle ilgili sürece genel bakış.

source: `Helping with Documentation <https://devguide.python.org/docquality/#helping-with-documentation>`_
tr: `Dokümantasyona Yardım Etmek <https://devguide.python.org/docquality/#helping-with-documentation>`_

source: Comprehensive guide for individuals that are interested in contributing to Python documentation.
tr: Python dokümantasyonuna katkıda bulunmak isteyen bireyler için kapsamlı kılavuz.

source: `Documentation Translations <https://devguide.python.org/documenting/#translating>`_
tr: `Dokümantasyon Çevirileri <https://devguide.python.org/documenting/#translating>`_

source: A list of GitHub pages for documentation translation and their primary contacts.
tr: Dokümantasyon çevirilerinin GitHub sayfaları ve bunların iletişim bilgilerini içeren bir liste.

source: Using the Python issue tracker
tr: Python hata takipçisini kullanmak

source: Issue reports for Python itself should be submitted via the GitHub issues tracker (https://github.com/python/cpython/issues). The GitHub issues tracker offers a web form which allows pertinent information to be entered and submitted to the developers.
tr: Python'un kendisi için olan hata raporları GitHub issues (https://github.com/python/cpython/issues) aracılığıyla gönderilmelidir. Hata takipçisi, ilgili bilgilerin girilmesini ve geliştiricilere gönderilmesini sağlayan bir web formu sunar.

source: The first step in filing a report is to determine whether the problem has already been reported. The advantage in doing so, aside from saving the developers' time, is that you learn what has been done to fix it; it may be that the problem has already been fixed for the next release, or additional information is needed (in which case you are welcome to provide it if you can!). To do this, search the tracker using the search box at the top of the page.
tr: Rapor göndermenin ilk adımı, sorunun zaten bildirilmiş olup olmadığını belirlemektir. Bunu yapmanın avantajı, geliştiricilere zaman kazandırarak, düzeltmek için neler yapıldığını öğrenmenizdir; sorun bir sonraki sürüm için zaten düzeltilmiş olabilir veya ek bilgilere ihtiyaç duyulabilir (eğer mümkünse bilgileri sağlayabilirsiniz!). Bunu yapmak için, sayfanın üst kısmındaki arama kutusunu kullanarak hata veritabanında arama yapın.

source: If the problem you're reporting is not already in the list, log in to GitHub. If you don't already have a GitHub account, create a new account using the "Sign up" link. It is not possible to submit a bug report anonymously.
tr: Bildirdiğiniz sorun listede değilse, GitHub'da oturum açın. Bir GitHub hesabınız, "Kayıt Ol" bağlantısına tıklayın. Hata raporunu anonim olarak göndermek mümkün değildir.

source: Being now logged in, you can submit an issue. Click on the "New issue" button in the top bar to report a new issue.
tr: Oturum açtıktan sonra bir hata raporu gönderebilirsiniz. Yeni bir rapor oluşturmak için sayfanın üst kısmındaki "New issue" butonuna tıklayın.

source: The submission form has two fields, "Title" and "Comment".
tr: Form iki kısımdan oluşur. "Başlık" ve "Yorum".

source: For the "Title" field, enter a *very* short description of the problem; fewer than ten words is good.
tr: "Başlık" için hatanın *çok* kısa açıklamasını girin; başlığın on kelimeden az olması iyidir.

source: In the "Comment" field, describe the problem in detail, including what you expected to happen and what did happen. Be sure to include whether any extension modules were involved, and what hardware and software platform you were using (including version information as appropriate).
tr: "Yorum" alanında, ne olmasını beklediğiniz ve ne olduğu da dahil olmak üzere sorunu ayrıntılı olarak açıklayın. Herhangi bir uzantı modülünün dahil olup olmadığını, hangi donanım ve yazılım platformunu kullandığınızı (uygun sürüm bilgileri dahil) eklediğinizden emin olun.

source: Each issue report will be reviewed by a developer who will determine what needs to be done to correct the problem. You will receive an update each time an action is taken on the issue.
tr: Her hata raporu, sorunu düzeltmek için ne yapılması gerektiğini belirleyecek bir geliştiriciye atanır. Hata üzerinde her işlem başlatıldığında bir güncelleme alırsınız.

source: `How to Report Bugs Effectively <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_
tr: 'Hataları Etkili Bir Şekilde Bildirmek <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>'_

source: Article which goes into some detail about how to create a useful bug report. This describes what kind of information is useful and why it is useful.
tr: Yararlı bir hata raporunun nasıl oluşturulacağı hakkında bazı ayrıntılara giren makale. Bu makale, ne tür bilgilerin yararlı olduğunu ve neden yararlı olduğunu açıklar.

source: `Bug Writing Guidelines <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_
tr: 'Hata Raporu Yazma Yönergeleri <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>'_

source: Information about writing a good bug report. Some of this is specific to the Mozilla project, but describes general good practices.
tr: İyi bir hata raporu yazma hakkında bilgi. Bunların bir kısmı Mozilla projesine özgüdür, ancak genel iyi uygulamaları açıklar.

source: Getting started contributing to Python yourself
tr: Python'a kendiniz katkıda bulunmaya başlayın

source: Beyond just reporting bugs that you find, you are also welcome to submit patches to fix them. You can find more information on how to get started patching Python in the `Python Developer's Guide`_. If you have questions, the `core-mentorship mailing list`_ is a friendly place to get answers to any and all questions pertaining to the process of fixing issues in Python.
tr: Bulduğunuz hataları bildirmenin ötesinde, bunları düzeltmek için yamalar gönderebilirsiniz. Python'a yama yapma hakkında daha fazla bilgiyi `Python Geliştirici Kılavuzu'nda`_ bulabilirsiniz. Sorularınız varsa, `core-mentorship posta listesi`_ Python'daki sorunları çözmeyle ilgili tüm soruların yanıtlarını almak için arkadaş canlısı bir yerdir.
