Repository: python/python-docs-tr
Catalog: glossary.po
Languages: tr

source: named tuple
tr: adlandırılmış demet

source: The term "named tuple" applies to any type or class that inherits from tuple and whose indexable elements are also accessible using named attributes. The type or class may have other features as well.
tr: "named tuple" terimi, demetten miras alan ve dizinlenebilir öğelerine de adlandırılmış nitelikler kullanılarak erişilebilen herhangi bir tür veya sınıf için geçerlidir. Tür veya sınıfın başka özellikleri de olabilir.

source: Several built-in types are named tuples, including the values returned by :func:`time.localtime` and :func:`os.stat`. Another example is :data:`sys.float_info`::
tr: Çeşitli yerleşik türler, :func:`time.localtime` ve :func:`os.stat` tarafından döndürülen değerler de dahil olmak üzere, tanımlama grupları olarak adlandırılır. Başka bir örnek :data:`sys.float_info`::

source: Some named tuples are built-in types (such as the above examples). Alternatively, a named tuple can be created from a regular class definition that inherits from :class:`tuple` and that defines named fields. Such a class can be written by hand or it can be created with the factory function :func:`collections.namedtuple`. The latter technique also adds some extra methods that may not be found in hand-written or built-in named tuples.
tr: Bazı adlandırılmış demetler yerleşik türlerdir (yukarıdaki örnekler gibi). Alternatif olarak, :class:`tuple` öğesinden miras alan ve adlandırılmış alanları tanımlayan normal bir sınıf tanımından adlandırılmış bir tanımlama grubu oluşturulabilir. Böyle bir sınıf elle yazılabilir veya fabrika işlevi :func:`collections.namedtuple` ile oluşturulabilir. İkinci teknik ayrıca elle yazılmış veya yerleşik adlandırılmış demetlerde bulunmayan bazı ekstra yöntemler ekler.

source: namespace
tr: ad alanı

source: The place where a variable is stored. Namespaces are implemented as dictionaries. There are the local, global and built-in namespaces as well as nested namespaces in objects (in methods). Namespaces support modularity by preventing naming conflicts. For instance, the functions :func:`builtins.open <.open>` and :func:`os.open` are distinguished by their namespaces. Namespaces also aid readability and maintainability by making it clear which module implements a function. For instance, writing :func:`random.seed` or :func:`itertools.islice` makes it clear that those functions are implemented by the :mod:`random` and :mod:`itertools` modules, respectively.
tr: Değişkenin saklandığı yer. Ad alanları sözlükler olarak uygulanır. Nesnelerde (yöntemlerde) yerel, genel ve yerleşik ad alanlarının yanı sıra iç içe ad alanları vardır. Ad alanları, adlandırma çakışmalarını önleyerek modülerliği destekler. Örneğin, :func:`builtins.open <.open>` ve :func:`os.open` işlevleri ad alanlarıyla ayırt edilir. Ad alanları, hangi modülün bir işlevi uyguladığını açıkça belirterek okunabilirliğe ve sürdürülebilirliğe de yardımcı olur. Örneğin, :func:`random.seed` veya :func:`itertools.islice` yazmak, bu işlevlerin sırasıyla :mod:`random` ve :mod:`itertools` modülleri tarafından uygulandığını açıkça gösterir.

source: namespace package
tr: ad alanı paketi

source: A :pep:`420` :term:`package` which serves only as a container for subpackages. Namespace packages may have no physical representation, and specifically are not like a :term:`regular package` because they have no ``__init__.py`` file.
tr: A :pep:`420` :term:`package`, yalnızca alt paketler için bir kap olarak hizmet eder. Ad alanı paketlerinin hiçbir fiziksel temsili olmayabilir ve ``__init__.py`` dosyası olmadığından özellikle :term:`regular package` gibi değildirler.

source: See also :term:`module`.
tr: Ayrıca bkz. :term:`module`.

source: nested scope
tr: iç içe kapsam

source: The ability to refer to a variable in an enclosing definition. For instance, a function defined inside another function can refer to variables in the outer function. Note that nested scopes by default work only for reference and not for assignment. Local variables both read and write in the innermost scope. Likewise, global variables read and write to the global namespace. The :keyword:`nonlocal` allows writing to outer scopes.
tr: Kapsamlı bir tanımdaki bir değişkene atıfta bulunma yeteneği. Örneğin, başka bir fonksiyonun içinde tanımlanan bir fonksiyon, dış fonksiyondaki değişkenlere atıfta bulunabilir. İç içe kapsamların varsayılan olarak yalnızca başvuru için çalıştığını ve atama için çalışmadığını unutmayın. Yerel değişkenler en içteki kapsamda hem okur hem de yazar. Benzer şekilde, global değişkenler global ad alanını okur ve yazar. :keyword:`nonlocal`, dış kapsamlara yazmaya izin verir.

source: new-style class
tr: yeni stil sınıf

source: Old name for the flavor of classes now used for all class objects. In earlier Python versions, only new-style classes could use Python's newer, versatile features like :attr:`~object.__slots__`, descriptors, properties, :meth:`__getattribute__`, class methods, and static methods.
tr: Artık tüm sınıf nesneleri için kullanılan sınıfların lezzetinin eski adı. Önceki Python sürümlerinde, yalnızca yeni stil sınıfları Python'un :attr:`~object.__slots__`, tanımlayıcılar, özellikler, :meth:`__getattribute__`, sınıf yöntemleri ve statik yöntemler gibi daha yeni, çok yönlü özelliklerini kullanabilirdi.

source: object
tr: obje

source: Any data with state (attributes or value) and defined behavior (methods). Also the ultimate base class of any :term:`new-style class`.
tr: Durum (öznitelikler veya değer) ve tanımlanmış davranış (yöntemler) içeren herhangi bir veri. Ayrıca herhangi bir :term:`yeni tarz sınıfın <new-style class>` nihai temel sınıfı.

source: package
tr: paket

source: A Python :term:`module` which can contain submodules or recursively, subpackages. Technically, a package is a Python module with a ``__path__`` attribute.
tr: Alt modüller veya yinelemeli olarak alt paketler içerebilen bir Python :term:`module`. Teknik olarak bir paket, ``__path__`` özniteliğine sahip bir Python modülüdür.

source: See also :term:`regular package` and :term:`namespace package`.
tr: Ayrıca bkz. :term:`regular package` ve :term:`namespace package`.

source: parameter
tr: parametre

source: A named entity in a :term:`function` (or method) definition that specifies an :term:`argument` (or in some cases, arguments) that the function can accept. There are five kinds of parameter:
tr: Bir :term:`function` (veya yöntem) tanımında, işlevin kabul edebileceği bir :term:`argument` (veya bazı durumlarda, argümanlar) belirten adlandırılmış bir varlık. Beş çeşit parametre vardır:

source: :dfn:`positional-or-keyword`: specifies an argument that can be passed either :term:`positionally <argument>` or as a :term:`keyword argument <argument>`. This is the default kind of parameter, for example *foo* and *bar* in the following::
tr: :dfn:`positional-or-keyword`: :term:`pozisyonel <argument>` veya bir :term:`keyword argümanı <argument>` olarak iletilebilen bir argüman belirtir. Bu, varsayılan parametre türüdür, örneğin aşağıdakilerde *foo* ve *bar*::

source: :dfn:`positional-only`: specifies an argument that can be supplied only by position. Positional-only parameters can be defined by including a ``/`` character in the parameter list of the function definition after them, for example *posonly1* and *posonly2* in the following::
tr: :dfn:`positional-only`: yalnızca konuma göre sağlanabilen bir argüman belirtir. Yalnızca konumsal parametreler, onlardan sonra fonksiyon tanımının parametre listesine bir ``/`` karakteri eklenerek tanımlanabilir, örneğin aşağıdakilerde *posonly1* ve *posonly2*::

source: :dfn:`keyword-only`: specifies an argument that can be supplied only by keyword. Keyword-only parameters can be defined by including a single var-positional parameter or bare ``*`` in the parameter list of the function definition before them, for example *kw_only1* and *kw_only2* in the following::
tr: :dfn:`keyword-only`: sadece anahtar kelime ile sağlanabilen bir argüman belirtir. Yalnızca anahtar kelime (keyword-only) parametreleri, onlardan önceki fonksiyon tanımının parametre listesine tek bir değişken konumlu parametre veya çıplak ``*`` dahil edilerek tanımlanabilir, örneğin aşağıdakilerde *kw_only1* ve *kw_only2*::

source: :dfn:`var-positional`: specifies that an arbitrary sequence of positional arguments can be provided (in addition to any positional arguments already accepted by other parameters). Such a parameter can be defined by prepending the parameter name with ``*``, for example *args* in the following::
tr: :dfn:`var-positional`: keyfi bir pozisyonel argüman dizisinin sağlanabileceğini belirtir (diğer parametreler tarafından zaten kabul edilmiş herhangi bir konumsal argümana ek olarak). Böyle bir parametre, parametre adının başına ``*`` eklenerek tanımlanabilir, örneğin aşağıdakilerde *args*::

source: :dfn:`var-keyword`: specifies that arbitrarily many keyword arguments can be provided (in addition to any keyword arguments already accepted by other parameters). Such a parameter can be defined by prepending the parameter name with ``**``, for example *kwargs* in the example above.
tr: :dfn:`var-keyword`: keyfi olarak birçok anahtar kelime argümanının sağlanabileceğini belirtir (diğer parametreler tarafından zaten kabul edilen herhangi bir anahtar kelime argümanına ek olarak). Böyle bir parametre, parametre adının başına ``**``, örneğin yukarıdaki örnekte *kwargs* eklenerek tanımlanabilir.

source: Parameters can specify both optional and required arguments, as well as default values for some optional arguments.
tr: Parametreler, hem isteğe bağlı hem de gerekli argümanleri ve ayrıca bazı isteğe bağlı bağımsız değişkenler için varsayılan değerleri belirtebilir.

source: See also the :term:`argument` glossary entry, the FAQ question on :ref:`the difference between arguments and parameters <faq-argument-vs-parameter>`, the :class:`inspect.Parameter` class, the :ref:`function` section, and :pep:`362`.
tr: Ayrıca bkz. :term:`argüman <argument>`, :ref:`argümanlar ve parametreler arasındaki fark <faq-argument-vs-parameter>`, :class:`inspect.Parameter`, :ref:`function` ve :pep:`362`.

source: path entry
tr: yol girişi

source: A single location on the :term:`import path` which the :term:`path based finder` consults to find modules for importing.
tr: :term:`path based finder` içe aktarma modüllerini bulmak için başvurduğu :term:`import path` üzerindeki tek bir konum.

source: path entry finder
tr: yol girişi bulucu

source: A :term:`finder` returned by a callable on :data:`sys.path_hooks` (i.e. a :term:`path entry hook`) which knows how to locate modules given a :term:`path entry`.
tr: Bir :term:`finder` :data:`sys.path_hooks` (yani bir :term:`yol giriş kancası`) üzerinde bir çağrılabilir tarafından döndürülür ve :term:`path entry` verilen modüllerin nasıl bulunacağını bilir.

source: See :class:`importlib.abc.PathEntryFinder` for the methods that path entry finders implement.
tr: Yol girişi bulucularının uyguladığı yöntemler için :class:`importlib.abc.PathEntryFinder` bölümüne bakın.

source: path entry hook
tr: yol giriş kancası

source: A callable on the :data:`sys.path_hook` list which returns a :term:`path entry finder` if it knows how to find modules on a specific :term:`path entry`.
tr: :data:`sys.path_hook` listesinde, belirli bir :term:`yol girişindeki <path entry>` modülleri nasıl bulacağını biliyorsa, bir :term:`yol girişi bulucu <path entry finder>` döndüren bir çağrılabilir.

source: path based finder
tr: yol tabanlı bulucu

source: One of the default :term:`meta path finders <meta path finder>` which searches an :term:`import path` for modules.
tr: Modüller için bir :term:`import path` arayan varsayılan :term:`meta yol buluculardan <meta path finder>` biri.

source: path-like object
tr: yol benzeri nesne

source: An object representing a file system path. A path-like object is either a :class:`str` or :class:`bytes` object representing a path, or an object implementing the :class:`os.PathLike` protocol. An object that supports the :class:`os.PathLike` protocol can be converted to a :class:`str` or :class:`bytes` file system path by calling the :func:`os.fspath` function; :func:`os.fsdecode` and :func:`os.fsencode` can be used to guarantee a :class:`str` or :class:`bytes` result instead, respectively. Introduced by :pep:`519`.
tr: Bir dosya sistemi yolunu temsil eden bir nesne. Yol benzeri bir nesne, bir yolu temsil eden bir :class:`str` veya :class:`bytes` nesnesi veya :class:`os.PathLike` protokolünü uygulayan bir nesnedir. :class:`os.PathLike` protokolünü destekleyen bir nesne, :func:`os.fspath` işlevi çağrılarak bir :class:`str` veya :class:`bytes` dosya sistemi yoluna dönüştürülebilir; :func:`os.fsdecode` ve :func:`os.fsencode`, bunun yerine sırasıyla :class:`str` veya :class:`bytes` sonucunu garanti etmek için kullanılabilir. :pep:`519` tarafından tanıtıldı.

source: Python Enhancement Proposal. A PEP is a design document providing information to the Python community, or describing a new feature for Python or its processes or environment. PEPs should provide a concise technical specification and a rationale for proposed features.
tr: Python Geliştirme Önerisi. PEP, Python topluluğuna bilgi sağlayan veya Python veya süreçleri ya da ortamı için yeni bir özelliği açıklayan bir tasarım belgesidir. PEP'ler, önerilen özellikler için özlü bir teknik şartname ve bir gerekçe sağlamalıdır.

source: PEPs are intended to be the primary mechanisms for proposing major new features, for collecting community input on an issue, and for documenting the design decisions that have gone into Python. The PEP author is responsible for building consensus within the community and documenting dissenting opinions.
tr: PEP'lerin, önemli yeni özellikler önermek, bir sorun hakkında topluluk girdisi toplamak ve Python'a giren tasarım kararlarını belgelemek için birincil mekanizmalar olması amaçlanmıştır. PEP yazarı, topluluk içinde fikir birliği oluşturmaktan ve muhalif görüşleri belgelemekten sorumludur.

source: See :pep:`1`.
tr: Bakınız :pep:`1`.

source: portion
tr: kısım

source: A set of files in a single directory (possibly stored in a zip file) that contribute to a namespace package, as defined in :pep:`420`.
tr: :pep:`420` içinde tanımlandığı gibi, bir ad alanı paketine katkıda bulunan tek bir dizindeki (muhtemelen bir zip dosyasında depolanan) bir dizi dosya.

source: positional argument
tr: konumsal argüman

source: provisional API
tr: geçici API

source: A provisional API is one which has been deliberately excluded from the standard library's backwards compatibility guarantees. While major changes to such interfaces are not expected, as long as they are marked provisional, backwards incompatible changes (up to and including removal of the interface) may occur if deemed necessary by core developers. Such changes will not be made gratuitously -- they will occur only if serious fundamental flaws are uncovered that were missed prior to the inclusion of the API.
tr: Geçici bir API, standart kitaplığın geriye dönük uyumluluk garantilerinden kasıtlı olarak hariç tutulan bir API'dir. Bu tür arayüzlerde büyük değişiklikler beklenmese de, geçici olarak işaretlendikleri sürece, çekirdek geliştiriciler tarafından gerekli görüldüğü takdirde geriye dönük uyumsuz değişiklikler (arayüzün kaldırılmasına kadar ve buna kadar) meydana gelebilir. Bu tür değişiklikler karşılıksız yapılmayacaktır - bunlar yalnızca API'nin eklenmesinden önce gözden kaçan ciddi temel kusurlar ortaya çıkarsa gerçekleşecektir.

source: Even for provisional APIs, backwards incompatible changes are seen as a "solution of last resort" - every attempt will still be made to find a backwards compatible resolution to any identified problems.
tr: Geçici API'ler için bile, geriye dönük uyumsuz değişiklikler "son çare çözümü" olarak görülür - tanımlanan herhangi bir soruna geriye dönük uyumlu bir çözüm bulmak için her türlü girişimde bulunulacaktır.

source: This process allows the standard library to continue to evolve over time, without locking in problematic design errors for extended periods of time. See :pep:`411` for more details.
tr: Bu süreç, standart kitaplığın, uzun süreler boyunca sorunlu tasarım hatalarına kilitlenmeden zaman içinde gelişmeye devam etmesini sağlar. Daha fazla ayrıntı için bkz. :pep:`411`.

source: provisional package
tr: geçici paket

source: See :term:`provisional API`.
tr: Bakınız :term:`provisional API`.

source: Nickname for the Python 3.x release line (coined long ago when the release of version 3 was something in the distant future.) This is also abbreviated "Py3k".
tr: Python 3.x sürüm satırının takma adı (uzun zaman önce sürüm 3'ün piyasaya sürülmesi uzak bir gelecekte olduğu zaman ortaya çıktı.) Bu aynı zamanda "Py3k" olarak da kısaltılır.

source: An idea or piece of code which closely follows the most common idioms of the Python language, rather than implementing code using concepts common to other languages. For example, a common idiom in Python is to loop over all elements of an iterable using a :keyword:`for` statement. Many other languages don't have this type of construct, so people unfamiliar with Python sometimes use a numerical counter instead::
tr: Diğer dillerde ortak kavramları kullanarak kod uygulamak yerine Python dilinin en yaygın deyimlerini yakından takip eden bir fikir veya kod parçası. Örneğin, Python'da yaygın bir deyim, bir :keyword:`for` ifadesi kullanarak yinelenebilir bir öğenin tüm öğeleri üzerinde döngü oluşturmaktır. Diğer birçok dilde bu tür bir yapı yoktur, bu nedenle Python'a aşina olmayan kişiler bazen bunun yerine sayısal bir sayaç kullanır:

source: As opposed to the cleaner, Pythonic method::
tr: Temizleyicinin aksine, Pythonic yöntemi::

source: qualified name
tr: nitelikli isim

source: A dotted name showing the "path" from a module's global scope to a class, function or method defined in that module, as defined in :pep:`3155`. For top-level functions and classes, the qualified name is the same as the object's name::
tr: :pep:`3155` içinde tanımlandığı gibi, bir modülün genel kapsamından o modülde tanımlanan bir sınıfa, işleve veya yönteme giden "yolu" gösteren noktalı ad. Üst düzey işlevler ve sınıflar için nitelikli ad, nesnenin adıyla aynıdır::

source: When used to refer to modules, the *fully qualified name* means the entire dotted path to the module, including any parent packages, e.g. ``email.mime.text``::
tr: Modüllere atıfta bulunmak için kullanıldığında, *tam nitelenmiş ad*, herhangi bir üst paket de dahil olmak üzere, modüle giden tüm noktalı yol anlamına gelir, örn. ``email.mime.text``::

source: reference count
tr: referans sayısı

source: The number of references to an object. When the reference count of an object drops to zero, it is deallocated. Reference counting is generally not visible to Python code, but it is a key element of the :term:`CPython` implementation. Programmers can call the :func:`sys.getrefcount` function to return the reference count for a particular object.
tr: Bir nesneye yapılan başvuruların sayısı. Bir nesnenin referans sayısı sıfıra düştüğünde, yeniden konumlandırılır. Referans sayımı genellikle Python kodu tarafından görülmez, ancak :term:`CPython` uygulamasının önemli bir öğesidir. Programcılar, belirli bir nesne için başvuru sayısını döndürmek için :func:`sys.getrefcount` işlevini çağırabilir.

source: regular package
tr: sürekli paketleme

source: A traditional :term:`package`, such as a directory containing an ``__init__.py`` file.
tr: ``__init__.py`` dosyası içeren bir dizin gibi geleneksel bir :term:`package`.

source: See also :term:`namespace package`.
tr: Ayrıca bkz. :term:`ad alanı paketi`.

source: A declaration inside a class that saves memory by pre-declaring space for instance attributes and eliminating instance dictionaries. Though popular, the technique is somewhat tricky to get right and is best reserved for rare cases where there are large numbers of instances in a memory-critical application.
tr: Örnek öznitelikleri için önceden yer bildirerek ve örnek sözlüklerini ortadan kaldırarak bellekten tasarruf sağlayan bir sınıf içindeki bildirim. Popüler olmasına rağmen, tekniğin doğru olması biraz zor ve en iyi, bellek açısından kritik bir uygulamada çok sayıda örneğin bulunduğu nadir durumlar için ayrılmıştır.

source: sequence
tr: dizi

source: An :term:`iterable` which supports efficient element access using integer indices via the :meth:`__getitem__` special method and defines a :meth:`__len__` method that returns the length of the sequence. Some built-in sequence types are :class:`list`, :class:`str`, :class:`tuple`, and :class:`bytes`. Note that :class:`dict` also supports :meth:`__getitem__` and :meth:`__len__`, but is considered a mapping rather than a sequence because the lookups use arbitrary :term:`immutable` keys rather than integers.
tr: :meth:`__getitem__` özel yöntemi aracılığıyla tamsayı dizinlerini kullanarak verimli öğe erişimini destekleyen ve dizinin uzunluğunu döndüren bir :meth:`__len__` yöntemini tanımlayan bir :term:`iterable`. Bazı yerleşik dizi türleri şunlardır: :class:`list`, :class:`str`, :class:`tuple` ve :class:`bytes`. :class:`dict` ayrıca :meth:`__getitem__` ve :meth:`__len__` 'i de desteklediğine dikkat edin, ancak aramalar tamsayılar yerine rastgele :term:`immutable` anahtarları kullandığından bir diziden ziyade bir eşleme olarak kabul edilir.

source: The :class:`collections.abc.Sequence` abstract base class defines a much richer interface that goes beyond just :meth:`__getitem__` and :meth:`__len__`, adding :meth:`count`, :meth:`index`, :meth:`__contains__`, and :meth:`__reversed__`. Types that implement this expanded interface can be registered explicitly using :func:`~abc.ABCMeta.register`.
tr: :class:`collections.abc.Sequence` soyut temel sınıfı;, :meth:`count`, :meth:`index`, :meth:`__contains__`, ve :meth:`__reversed__` ekleyerek sadece :meth:`__getitem__` ve :meth:`__len__` 'in ötesine geçen çok daha zengin bir arayüzü tanımlar. Bu genişletilmiş arabirimi uygulayan türler, :func:`~abc.ABCMeta.register` kullanılarak açıkça kaydedilebilir.

source: set comprehension
tr: anlamak

source: A compact way to process all or part of the elements in an iterable and return a set with the results. ``results = {c for c in 'abracadabra' if c not in 'abc'}`` generates the set of strings ``{'r', 'd'}``. See :ref:`comprehensions`.
tr: Öğelerin tümünü veya bir kısmını yinelenebilir bir şekilde işlemenin ve sonuçlarla birlikte bir küme döndürmenin kompakt bir yolu. ``results = {c for c in 'abracadabra' if c not in 'abc'}``, ``{'r', 'd'}`` dizelerini oluşturur. Bakınız :ref:`comprehensions`.

source: single dispatch
tr: tek sevk

source: A form of :term:`generic function` dispatch where the implementation is chosen based on the type of a single argument.
tr: Uygulamanın tek bir argüman türüne göre seçildiği bir :term:`generic function` gönderimi biçimi.

source: slice
tr: parçalamak

source: An object usually containing a portion of a :term:`sequence`. A slice is created using the subscript notation, ``[]`` with colons between numbers when several are given, such as in ``variable_name[1:3:5]``. The bracket (subscript) notation uses :class:`slice` objects internally.
tr: Genellikle bir :term:`sequence` 'nin bir bölümünü içeren bir nesne. Bir dilim, örneğin ``variable_name[1:3:5]`` 'de olduğu gibi, birkaç tane verildiğinde, sayılar arasında iki nokta üst üste koyarak, ``[]`` alt simge gösterimi kullanılarak oluşturulur. Köşeli ayraç (alt simge) gösterimi, dahili olarak :class:`slice` nesnelerini kullanır.

source: special method
tr: özel metod
