Repository: python/python-docs-tr
Catalog: glossary.po
Languages: tr

source: A function which returns a :term:`coroutine` object. A coroutine function may be defined with the :keyword:`async def` statement, and may contain :keyword:`await`, :keyword:`async for`, and :keyword:`async with` keywords. These were introduced by :pep:`492`.
tr: Bir :term:`coroutine` nesnesi döndüren bir işlev. Bir eşyordam işlevi :keyword:`async def` ifadesiyle tanımlanabilir ve :keyword:`await`, :keyword:`async for` ve :keyword:`async with` anahtar kelimelerini içerebilir. Bunlar :pep:`492` tarafından tanıtıldı.

source: The canonical implementation of the Python programming language, as distributed on `python.org <https://www.python.org>`_. The term "CPython" is used when necessary to distinguish this implementation from others such as Jython or IronPython.
tr: Python programlama dilinin `python.org <https://www.python.org>`_ üzerinde dağıtıldığı şekliyle kurallı uygulaması. "CPython" terimi, gerektiğinde bu uygulamayı Jython veya IronPython gibi diğerlerinden ayırmak için kullanılır.

source: decorator
tr: dekoratör

source: A function returning another function, usually applied as a function transformation using the ``@wrapper`` syntax. Common examples for decorators are :func:`classmethod` and :func:`staticmethod`.
tr: Genellikle ``@wrapper`` sözdizimi kullanılarak bir işlev dönüşümü olarak uygulanan, başka bir işlevi döndüren bir işlev. Dekoratörler için yaygın örnekler şunlardır: :func:`classmethod` ve :func:`staticmethod`.

source: The decorator syntax is merely syntactic sugar, the following two function definitions are semantically equivalent::
tr: Dekoratör sözdizimi yalnızca sözdizimsel şekerdir, aşağıdaki iki işlev tanımı anlamsal olarak eş değerdir:

source: The same concept exists for classes, but is less commonly used there. See the documentation for :ref:`function definitions <function>` and :ref:`class definitions <class>` for more about decorators.
tr: Aynı kavram sınıflar için de mevcuttur, ancak orada daha az kullanılır. Dekoratörler hakkında daha fazla bilgi için :ref:`function definitions <function>` ve :ref:`class definitions <class>` belgelerine bakın.

source: descriptor
tr: tanımlayıcı

source: Any object which defines the methods :meth:`__get__`, :meth:`__set__`, or :meth:`__delete__`. When a class attribute is a descriptor, its special binding behavior is triggered upon attribute lookup. Normally, using *a.b* to get, set or delete an attribute looks up the object named *b* in the class dictionary for *a*, but if *b* is a descriptor, the respective descriptor method gets called. Understanding descriptors is a key to a deep understanding of Python because they are the basis for many features including functions, methods, properties, class methods, static methods, and reference to super classes.
tr: :meth:`__get__`, :meth:`__set__` veya :meth:`__delete__` yöntemlerini tanımlayan herhangi bir nesne. Bir sınıf özniteliği bir tanımlayıcı olduğunda, öznitelik araması üzerine özel bağlama davranışı tetiklenir. Normalde, bir özniteliği almak, ayarlamak veya silmek için *a.b* kullanmak, *a* için sınıf sözlüğünde *b* adlı nesneyi arar, ancak *b* bir tanımlayıcı ise, ilgili tanımlayıcı yöntemi çağrılır. Tanımlayıcıları anlamak, Python'u derinlemesine anlamanın anahtarıdır çünkü bunlar, işlevler, yöntemler, özellikler, sınıf yöntemleri, statik yöntemler ve süper sınıflara başvuru gibi birçok özelliğin temelidir.

source: For more information about descriptors' methods, see :ref:`descriptors` or the :ref:`Descriptor How To Guide <descriptorhowto>`.
tr: Tanımlayıcıların yöntemleri hakkında daha fazla bilgi için, bkz. :ref:`descriptors` veya :ref:`Descriptor How To Guide <descriptorhowto>`.

source: dictionary
tr: sözlük

source: An associative array, where arbitrary keys are mapped to values. The keys can be any object with :meth:`__hash__` and :meth:`__eq__` methods. Called a hash in Perl.
tr: Rasgele anahtarların değerlerle eşlendiği ilişkisel bir dizi. Anahtarlar, :meth:`__hash__` ve :meth:`__eq__` yöntemleriyle herhangi bir nesne olabilir. Perl'de karma denir.

source: dictionary comprehension
tr: sözlük anlama

source: A compact way to process all or part of the elements in an iterable and return a dictionary with the results. ``results = {n: n ** 2 for n in range(10)}`` generates a dictionary containing key ``n`` mapped to value ``n ** 2``. See :ref:`comprehensions`.
tr: Öğelerin tümünü veya bir kısmını yinelenebilir bir şekilde işlemenin ve sonuçları içeren bir sözlük döndürmenin kompakt bir yolu. ``results = {n: n ** 2 for range(10)}``, ``n ** 2`` değerine eşlenmiş ``n`` anahtarını içeren bir sözlük oluşturur. Bkz. :ref:`comprehensions`.

source: dictionary view
tr: sözlük görünümü

source: The objects returned from :meth:`dict.keys`, :meth:`dict.values`, and :meth:`dict.items` are called dictionary views. They provide a dynamic view on the dictionary’s entries, which means that when the dictionary changes, the view reflects these changes. To force the dictionary view to become a full list use ``list(dictview)``. See :ref:`dict-views`.
tr: :meth:`dict.keys`, :meth:`dict.values` ve :meth:`dict.items` 'den döndürülen nesnelere sözlük görünümleri denir. Sözlüğün girişleri üzerinde dinamik bir görünüm sağlarlar; bu, sözlük değiştiğinde görünümün bu değişiklikleri yansıttığı anlamına gelir. Sözlük görünümünü tam liste olmaya zorlamak için ``list(dictview)`` kullanın. Bakınız :ref:`dict-views`.

source: docstring
tr: belge dizisi

source: A string literal which appears as the first expression in a class, function or module. While ignored when the suite is executed, it is recognized by the compiler and put into the :attr:`__doc__` attribute of the enclosing class, function or module. Since it is available via introspection, it is the canonical place for documentation of the object.
tr: Bir sınıf, işlev veya modülde ilk ifade olarak görünen bir dize değişmezi. Paket yürütüldüğünde yoksayılırken, derleyici tarafından tanınır ve çevreleyen sınıfın, işlevin veya modülün :attr:`__doc__` özniteliğine yerleştirilir. İç gözlem yoluyla erişilebilir olduğundan, nesnenin belgelenmesi için kurallı yerdir.

source: duck-typing
tr: ördek yazma

source: A programming style which does not look at an object's type to determine if it has the right interface; instead, the method or attribute is simply called or used ("If it looks like a duck and quacks like a duck, it must be a duck.") By emphasizing interfaces rather than specific types, well-designed code improves its flexibility by allowing polymorphic substitution. Duck-typing avoids tests using :func:`type` or :func:`isinstance`. (Note, however, that duck-typing can be complemented with :term:`abstract base classes <abstract base class>`.) Instead, it typically employs :func:`hasattr` tests or :term:`EAFP` programming.
tr: Doğru arayüze sahip olup olmadığını belirlemek için bir nesnenin türüne bakmayan bir programlama stili; bunun yerine, yöntem veya nitelik basitçe çağrılır veya kullanılır ("Ördek gibi görünüyorsa ve ördek gibi vaklıyorsa, ördek olmalıdır.") İyi tasarlanmış kod, belirli türlerden ziyade arayüzleri vurgulayarak, polimorfik ikameye izin vererek esnekliğini artırır. Ördek yazma, :func:`type` veya :func:`isinstance` kullanan testleri önler. (Ancak, ördek yazmanın :term:`abstract base class` ile tamamlanabileceğini unutmayın.) Bunun yerine, genellikle :func:`hasattr` testleri veya :term:`EAFP` programlamasını kullanır.

source: Easier to ask for forgiveness than permission. This common Python coding style assumes the existence of valid keys or attributes and catches exceptions if the assumption proves false. This clean and fast style is characterized by the presence of many :keyword:`try` and :keyword:`except` statements. The technique contrasts with the :term:`LBYL` style common to many other languages such as C.
tr: Af dilemek izin almaktan daha kolaydır. Bu yaygın Python kodlama stili, geçerli anahtarların veya niteliklerin varlığını varsayar ve varsayımın yanlış çıkması durumunda istisnaları yakalar. Bu temiz ve hızlı stil, birçok :keyword:`try` ve :keyword:`except` ifadesinin varlığı ile karakterize edilir. Teknik, C gibi diğer birçok dilde ortak olan :term:`LBYL` stiliyle çelişir.

source: expression
tr: ifade (değer döndürür)

source: A piece of syntax which can be evaluated to some value. In other words, an expression is an accumulation of expression elements like literals, names, attribute access, operators or function calls which all return a value. In contrast to many other languages, not all language constructs are expressions. There are also :term:`statement`\s which cannot be used as expressions, such as :keyword:`while`. Assignments are also statements, not expressions.
tr: Bir değere göre değerlendirilebilecek bir sözdizimi parçası. Başka bir deyişle, bir ifade, tümü bir değer döndüren sabit değerler, adlar, öznitelik erişimi, işleçler veya işlev çağrıları gibi ifade öğelerinin bir toplamıdır. Diğer birçok dilin aksine, tüm dil yapıları ifade değildir. Ayrıca :keyword:`while` gibi kullanılamayan :term:`ifadeler <statement>` de vardır. Atamalar da değer döndürmeyen ifadelerdir (statement).

source: extension module
tr: uzatma modülü

source: A module written in C or C++, using Python's C API to interact with the core and with user code.
tr: Çekirdekle ve kullanıcı koduyla etkileşim kurmak için Python'un C API'sini kullanan, C veya C++ ile yazılmış bir modül.

source: String literals prefixed with ``'f'`` or ``'F'`` are commonly called "f-strings" which is short for :ref:`formatted string literals <f-strings>`. See also :pep:`498`.
tr: Ön eki ``'f'`` veya ``'F'`` olan dize değişmezleri genellikle "f-strings" olarak adlandırılır; bu, :ref:`formatted string literals <f-strings>` 'ın kısaltmasıdır. Ayrıca bkz. :pep:`498`.

source: file object
tr: dosya nesnesi

source: An object exposing a file-oriented API (with methods such as :meth:`read()` or :meth:`write()`) to an underlying resource. Depending on the way it was created, a file object can mediate access to a real on-disk file or to another type of storage or communication device (for example standard input/output, in-memory buffers, sockets, pipes, etc.). File objects are also called :dfn:`file-like objects` or :dfn:`streams`.
tr: Dosya yönelimli bir API'yi (:meth:`read()` veya :meth:`write()` gibi yöntemlerle) temel alınan bir kaynağa gösteren bir nesne. Oluşturulma şekline bağlı olarak, bir dosya nesnesi gerçek bir disk üzerindeki dosyaya veya başka bir tür depolama veya iletişim aygıtına (örneğin standart giriş/çıkış, bellek içi arabellekler, yuvalar, borular vb.) erişime aracılık edebilir. . Dosya nesneleri ayrıca :dfn:`file-like objects` veya :dfn:`streams` olarak da adlandırılır.

source: There are actually three categories of file objects: raw :term:`binary files <binary file>`, buffered :term:`binary files <binary file>` and :term:`text files <text file>`. Their interfaces are defined in the :mod:`io` module. The canonical way to create a file object is by using the :func:`open` function.
tr: Aslında üç dosya nesnesi kategorisi vardır: ham :term:`binary files <binary file>`, arabelleğe alınmış :term:`binary files <binary file>` ve :term:`text files <text file>`. Arayüzleri :mod:`io` modülünde tanımlanmıştır. Bir dosya nesnesi yaratmanın kurallı yolu :func:`open` işlevini kullanmaktır.

source: file-like object
tr: dosya benzeri nesne

source: A synonym for :term:`file object`.
tr: :term:`dosya nesnesi` ile eşanlamlıdır.

source: filesystem encoding and error handler
tr: dosya sistemi kodlaması ve hata işleyicisi

source: Encoding and error handler used by Python to decode bytes from the operating system and encode Unicode to the operating system.
tr: Python tarafından işletim sistemindeki baytların kodunu çözmek ve Unicode'u işletim sistemine kodlamak için kullanılan kodlama ve hata işleyici.

source: The filesystem encoding must guarantee to successfully decode all bytes below 128. If the file system encoding fails to provide this guarantee, API functions can raise :exc:`UnicodeError`.
tr: Dosya sistemi kodlaması, 128'in altındaki tüm baytların kodunu başarıyla çözmeyi garanti etmelidir. Dosya sistemi kodlaması bu garantiyi sağlayamazsa, API işlevleri :exc:`UnicodeError` değerini yükseltebilir.

source: The :func:`sys.getfilesystemencoding` and :func:`sys.getfilesystemencodeerrors` functions can be used to get the filesystem encoding and error handler.
tr: :func:`sys.getfilesystemencoding` ve :func:`sys.getfilesystemencodeerrors` işlevleri, dosya sistemi kodlamasını ve hata işleyicisini almak için kullanılabilir.

source: The :term:`filesystem encoding and error handler` are configured at Python startup by the :c:func:`PyConfig_Read` function: see :c:member:`~PyConfig.filesystem_encoding` and :c:member:`~PyConfig.filesystem_errors` members of :c:type:`PyConfig`.
tr: :term:`filesystem encoding and error handler` Python başlangıcında :c:func:`PyConfig_Read` işleviyle yapılandırılır: bkz. :c:member:`~PyConfig.filesystem_encoding` ve :c:member:`~PyConfig. filesystem_errors` üyeleri :c:type:`PyConfig`.

source: See also the :term:`locale encoding`.
tr: Ayrıca bkz. :term:`locale encoding`.

source: finder
tr: bulucu

source: An object that tries to find the :term:`loader` for a module that is being imported.
tr: İçe aktarılmakta olan bir modül için :term:`loader` 'ı bulmaya çalışan bir nesne.

source: Since Python 3.3, there are two types of finder: :term:`meta path finders <meta path finder>` for use with :data:`sys.meta_path`, and :term:`path entry finders <path entry finder>` for use with :data:`sys.path_hooks`.
tr: Python 3.3'ten beri, iki çeşit bulucu vardır: :data:`sys.meta_path` ile kullanılmak üzere :term:`meta yol bulucular <meta path finder>`, ve :data:`sys.path_hooks` ile kullanılmak üzere :term:`yol girişi bulucular <path entry finder>`.

source: See :pep:`302`, :pep:`420` and :pep:`451` for much more detail.
tr: Daha fazla ayrıntı için :pep:`302`, :pep:`420` ve :pep:`451` bakın.

source: floor division
tr: kat bölümü

source: Mathematical division that rounds down to nearest integer. The floor division operator is ``//``. For example, the expression ``11 // 4`` evaluates to ``2`` in contrast to the ``2.75`` returned by float true division. Note that ``(-11) // 4`` is ``-3`` because that is ``-2.75`` rounded *downward*. See :pep:`238`.
tr: En yakın tam sayıya yuvarlayan matematiksel bölme. Kat bölme operatörü ``//`` şeklindedir. Örneğin, ``11 // 4`` ifadesi, gerçek yüzer bölme tarafından döndürülen ``2.75`` değerinin aksine ``2`` olarak değerlendirilir. ``(-11) // 4`` 'ün ``-3`` olduğuna dikkat edin, çünkü bu ``-2.75`` yuvarlatılmış *aşağı*. Bakınız :pep:`238`.

source: function
tr: fonksiyon

source: A series of statements which returns some value to a caller. It can also be passed zero or more :term:`arguments <argument>` which may be used in the execution of the body. See also :term:`parameter`, :term:`method`, and the :ref:`function` section.
tr: Bir arayana bir değer döndüren bir dizi ifade. Ayrıca, gövdenin yürütülmesinde kullanılabilen sıfır veya daha fazla :term:`argüman <argument>` iletilebilir. Ayrıca :term:`parameter`, :term:`method` ve :ref:`function` bölümüne bakın.

source: function annotation
tr: fonksiyon açıklaması

source: An :term:`annotation` of a function parameter or return value.
tr: Bir işlev parametresinin veya dönüş değerinin :term:`ek açıklaması <annotation>`.

source: Function annotations are usually used for :term:`type hints <type hint>`: for example, this function is expected to take two :class:`int` arguments and is also expected to have an :class:`int` return value::
tr: İşlev ek açıklamaları genellikle :term:`type hints <type hint>` için kullanılır: örneğin, bu fonksiyonun iki :class:`int` argüman alması ve ayrıca bir :class:`int` dönüş değerine sahip olması beklenir ::

source: Function annotation syntax is explained in section :ref:`function`.
tr: İşlev açıklama sözdizimi :ref:`function` bölümünde açıklanmaktadır.

source: See :term:`variable annotation` and :pep:`484`, which describe this functionality. Also see :ref:`annotations-howto` for best practices on working with annotations.
tr: Bu işlevi açıklayan :term:`variable annotation` ve :pep:`484` 'e bakın. Ek açıklamalarla çalışmaya ilişkin en iyi uygulamalar için ayrıca :ref:`annotations-howto` konusuna bakın.

source: A :ref:`future statement <future>`, ``from __future__ import <feature>``, directs the compiler to compile the current module using syntax or semantics that will become standard in a future release of Python. The :mod:`__future__` module documents the possible values of *feature*. By importing this module and evaluating its variables, you can see when a new feature was first added to the language and when it will (or did) become the default::
tr: Bir :ref:`future ifadesi <future>`, ``from __future__ import <feature>``, derleyiciyi, Python'un gelecekteki bir sürümünde standart hale gelecek olan sözdizimini veya semantiği kullanarak mevcut modülü derlemeye yönlendirir. :mod:`__future__` modülü, *feature*'ın olası değerlerini belgeler. Bu modülü içe aktararak ve değişkenlerini değerlendirerek, dile ilk kez yeni bir özelliğin ne zaman eklendiğini ve ne zaman varsayılan olacağını (ya da yaptığını) görebilirsiniz:

source: garbage collection
tr: çöp toplama

source: The process of freeing memory when it is not used anymore. Python performs garbage collection via reference counting and a cyclic garbage collector that is able to detect and break reference cycles. The garbage collector can be controlled using the :mod:`gc` module.
tr: Artık kullanılmadığında belleği boşaltma işlemi. Python, referans sayımı ve referans döngülerini algılayıp kırabilen bir döngüsel çöp toplayıcı aracılığıyla çöp toplama gerçekleştirir. Çöp toplayıcı :mod:`gc` modülü kullanılarak kontrol edilebilir.

source: generator
tr: jeneratör

source: A function which returns a :term:`generator iterator`. It looks like a normal function except that it contains :keyword:`yield` expressions for producing a series of values usable in a for-loop or that can be retrieved one at a time with the :func:`next` function.
tr: Bir :term:`generator iterator` döndüren bir işlev. Bir for döngüsünde kullanılabilen bir dizi değer üretmek için :keyword:`yield` ifadeleri içermesi veya :func:`next` işleviyle birer birer alınabilmesi dışında normal bir işleve benziyor.

source: Usually refers to a generator function, but may refer to a *generator iterator* in some contexts. In cases where the intended meaning isn't clear, using the full terms avoids ambiguity.
tr: Genellikle bir üretici işlevine atıfta bulunur, ancak bazı bağlamlarda bir *jeneratör yineleyicisine* atıfta bulunabilir. Amaçlanan anlamın net olmadığı durumlarda, tam terimlerin kullanılması belirsizliği önler.

source: generator iterator
tr: jeneratör yineleyici

source: An object created by a :term:`generator` function.
tr: Bir :term:`generator` işlevi tarafından oluşturulan bir nesne.

source: Each :keyword:`yield` temporarily suspends processing, remembering the location execution state (including local variables and pending try-statements). When the *generator iterator* resumes, it picks up where it left off (in contrast to functions which start fresh on every invocation).
tr: Her :keyword:`yield`, konum yürütme durumunu hatırlayarak (yerel değişkenler ve bekleyen try ifadeleri dahil) işlemeyi geçici olarak askıya alır. *jeneratör yineleyici* devam ettiğinde, kaldığı yerden devam eder (her çağrıda yeniden başlayan işlevlerin aksine).

source: generator expression
tr: jeneratör ifadesi

source: An expression that returns an iterator. It looks like a normal expression followed by a :keyword:`!for` clause defining a loop variable, range, and an optional :keyword:`!if` clause. The combined expression generates values for an enclosing function::
tr: Yineleyici döndüren bir ifade. Bir döngü değişkenini, aralığı ve isteğe bağlı bir :keyword:`!if` yan tümcesini tanımlayan bir :keyword:`!for` yan tümcesinin takip ettiği normal bir ifadeye benziyor. Birleştirilmiş ifade, bir çevreleyen için değerler üretir::

source: generic function
tr: genel işlev

source: A function composed of multiple functions implementing the same operation for different types. Which implementation should be used during a call is determined by the dispatch algorithm.
tr: Farklı türler için aynı işlemi uygulayan birden çok işlevden oluşan bir işlev. Bir çağrı sırasında hangi uygulamanın kullanılması gerektiği, gönderme algoritması tarafından belirlenir.

source: See also the :term:`single dispatch` glossary entry, the :func:`functools.singledispatch` decorator, and :pep:`443`.
tr: Ayrıca :term:`single dispatch` sözlük girdisine, :func:`functools.singledispatch` dekoratörüne ve :pep:`443` 'e bakın.

source: generic type
tr: genel tip

source: A :term:`type` that can be parameterized; typically a :ref:`container class<sequence-types>` such as :class:`list` or :class:`dict`. Used for :term:`type hints <type hint>` and :term:`annotations <annotation>`.
tr: Parametrelendirilebilen bir :term:`type`; tipik olarak bir :ref:`konteyner sınıfı <sequence-types>`, örneğin :class:`list` veya :class:`dict`. :term:`type hint` ve :term:`annotation` için kullanılır.

source: For more details, see :ref:`generic alias types<types-genericalias>`, :pep:`483`, :pep:`484`, :pep:`585`, and the :mod:`typing` module.
tr: Daha fazla ayrıntı için :ref:`generic allias types<types-genericalias>`, :pep:`483`, :pep:`484`, :pep:`585` ve :mod:`typing` modülüne bakın.

source: See :term:`global interpreter lock`.
tr: Bakınız :term:`global interpreter lock`.

source: global interpreter lock
tr: genel tercüman kilidi

source: The mechanism used by the :term:`CPython` interpreter to assure that only one thread executes Python :term:`bytecode` at a time. This simplifies the CPython implementation by making the object model (including critical built-in types such as :class:`dict`) implicitly safe against concurrent access. Locking the entire interpreter makes it easier for the interpreter to be multi-threaded, at the expense of much of the parallelism afforded by multi-processor machines.
tr: :term:`CPython` yorumlayıcısı tarafından aynı anda yalnızca bir iş parçacığının Python :term:`bytecode` 'u yürütmesini sağlamak için kullanılan mekanizma. Bu, nesne modelini (:class:`dict` gibi kritik yerleşik türler dahil) eşzamanlı erişime karşı örtük olarak güvenli hale getirerek CPython uygulamasını basitleştirir. Tüm yorumlayıcıyı kilitlemek, çok işlemcili makinelerin sağladığı paralelliğin çoğu pahasına, yorumlayıcının çok iş parçacıklı olmasını kolaylaştırır.

source: However, some extension modules, either standard or third-party, are designed so as to release the GIL when doing computationally intensive tasks such as compression or hashing. Also, the GIL is always released when doing I/O.
tr: Bununla birlikte, standart veya üçüncü taraf bazı genişletme modülleri, sıkıştırma veya karma gibi hesaplama açısından yoğun görevler yaparken GIL'yi serbest bırakacak şekilde tasarlanmıştır. Ayrıca, GIL, G/Ç yaparken her zaman serbest bırakılır.

source: Past efforts to create a "free-threaded" interpreter (one which locks shared data at a much finer granularity) have not been successful because performance suffered in the common single-processor case. It is believed that overcoming this performance issue would make the implementation much more complicated and therefore costlier to maintain.
tr: "Serbest iş parçacıklı" bir yorumlayıcı (paylaşılan verileri çok daha ince bir ayrıntı düzeyinde kilitleyen) oluşturma çabaları, ortak tek işlemcili durumda performans düştüğü için başarılı olmamıştır. Bu performans sorununun üstesinden gelinmesinin uygulamayı çok daha karmaşık hale getireceğine ve dolayısıyla bakımını daha maliyetli hale getireceğine inanılmaktadır.
