Repository: python/python-docs-tr
Catalog: glossary.po
Languages: tr

source: A method that is called implicitly by Python to execute a certain operation on a type, such as addition. Such methods have names starting and ending with double underscores. Special methods are documented in :ref:`specialnames`.
tr: Toplama gibi bir tür üzerinde belirli bir işlemi yürütmek için Python tarafından örtük olarak çağrılan bir yöntem. Bu tür yöntemlerin çift alt çizgi ile başlayan ve biten adları vardır. Özel yöntemler :ref:`specialnames` içinde belgelenmiştir.

source: statement
tr: ifade (değer döndürmez)

source: A statement is part of a suite (a "block" of code). A statement is either an :term:`expression` or one of several constructs with a keyword, such as :keyword:`if`, :keyword:`while` or :keyword:`for`.
tr: Bir ifade, bir paketin parçasıdır (kod "bloğu"). Bir ifade, bir :term:`expression` veya :keyword:`if`, :keyword:`while` veya :keyword:`for` gibi bir anahtar kelimeye sahip birkaç yapıdan biridir.

source: strong reference
tr: güçlü referans

source: In Python's C API, a strong reference is a reference to an object which increments the object's reference count when it is created and decrements the object's reference count when it is deleted.
tr: Python'un C API'sinde, güçlü bir referans, oluşturulduğunda nesnenin referans sayısını artıran ve silindiğinde nesnenin referans sayısını azaltan bir nesneye yapılan referanstır.

source: The :c:func:`Py_NewRef` function can be used to create a strong reference to an object. Usually, the :c:func:`Py_DECREF` function must be called on the strong reference before exiting the scope of the strong reference, to avoid leaking one reference.
tr: :c:func:`Py_NewRef` fonksiyonu, bir nesneye güçlü bir başvuru oluşturmak için kullanılabilir. Genellikle :c:func:`Py_DECREF` fonksiyonu, bir referansın sızmasını önlemek için güçlü referans kapsamından çıkmadan önce güçlü referansta çağrılmalıdır.

source: See also :term:`borrowed reference`.
tr: Ayrıca bkz. :term:`ödünç alınan referans <borrowed reference>`.

source: text encoding
tr: yazı çözümleme

source: A string in Python is a sequence of Unicode code points (in range ``U+0000``--``U+10FFFF``). To store or transfer a string, it needs to be serialized as a sequence of bytes.
tr: Python'da bir dize, bir Unicode kod noktaları dizisidir (``U+0000``--``U+10FFFF`` aralığında). Bir dizeyi depolamak veya aktarmak için, bir bayt dizisi olarak seri hale getirilmesi gerekir.

source: Serializing a string into a sequence of bytes is known as "encoding", and recreating the string from the sequence of bytes is known as "decoding".
tr: Bir dizeyi bir bayt dizisi halinde seri hale getirmek "kodlama (encoding)" olarak bilinir ve dizeyi bayt dizisinden yeniden oluşturmak "kod çözme (decoding)" olarak bilinir.

source: There are a variety of different text serialization :ref:`codecs <standard-encodings>`, which are collectively referred to as "text encodings".
tr: Toplu olarak "metin kodlamaları" olarak adlandırılan çeşitli farklı metin serileştirme :ref:`kodekleri <standard-encodings>` vardır.

source: text file
tr: yazı dosyası

source: A :term:`file object` able to read and write :class:`str` objects. Often, a text file actually accesses a byte-oriented datastream and handles the :term:`text encoding` automatically. Examples of text files are files opened in text mode (``'r'`` or ``'w'``), :data:`sys.stdin`, :data:`sys.stdout`, and instances of :class:`io.StringIO`.
tr: A :term:`file object` :class:`str` nesnelerini okuyabilir ve yazabilir. Çoğu zaman, bir metin dosyası aslında bir bayt yönelimli veri akışına erişir ve otomatik olarak :term:`text encoding` işler. Metin dosyalarına örnek olarak metin modunda açılan dosyalar (``'r'`` veya ``'w'``), :data:`sys.stdin`, :data:`sys.stdout` ve :class:`io.StringIO` örnekleri verilebilir.

source: See also :term:`binary file` for a file object able to read and write :term:`bytes-like objects <bytes-like object>`.
tr: Ayrıca :term:`ikili dosyaları <binary file>` okuyabilen ve yazabilen bir dosya nesnesi için :term:`bayt benzeri nesnelere <bytes-like object>` bakın.

source: triple-quoted string
tr: üç tırnaklı dize

source: A string which is bound by three instances of either a quotation mark (") or an apostrophe ('). While they don't provide any functionality not available with single-quoted strings, they are useful for a number of reasons. They allow you to include unescaped single and double quotes within a string and they can span multiple lines without the use of the continuation character, making them especially useful when writing docstrings.
tr: Üç tırnak işareti (") veya kesme işareti (') ile sınırlanan bir dize. Tek tırnaklı dizelerde bulunmayan herhangi bir işlevsellik sağlamasalar da, birkaç nedenden dolayı faydalıdırlar. bir dizeye çıkışsız tek ve çift tırnak eklemeniz gerekir ve bunlar, devam karakterini kullanmadan birden çok satıra yayılabilir, bu da onları özellikle belge dizileri yazarken kullanışlı hale getirir.

source: type
tr: tip

source: The type of a Python object determines what kind of object it is; every object has a type. An object's type is accessible as its :attr:`~instance.__class__` attribute or can be retrieved with ``type(obj)``.
tr: Bir Python nesnesinin türü, onun ne tür bir nesne olduğunu belirler; her nesnenin bir türü vardır. Bir nesnenin tipine :attr:`~instance.__class__` niteliği ile erişilebilir veya ``type(obj)`` ile alınabilir.

source: type alias
tr: tip takma adı

source: A synonym for a type, created by assigning the type to an identifier.
tr: Bir tanımlayıcıya tür atanarak oluşturulan, bir tür için eş anlamlı.

source: Type aliases are useful for simplifying :term:`type hints <type hint>`. For example::
tr: Tür takma adları, :term:`tür ipuçlarını <type hint>` basitleştirmek için kullanışlıdır. Örneğin::

source: could be made more readable like this::
tr: bu şekilde daha okunaklı hale getirilebilir::

source: See :mod:`typing` and :pep:`484`, which describe this functionality.
tr: Bu işlevi açıklayan :mod:`typing` ve :pep:`484` bölümlerine bakın.

source: type hint
tr: tür ipucu

source: An :term:`annotation` that specifies the expected type for a variable, a class attribute, or a function parameter or return value.
tr: Bir değişken, bir sınıf niteliği veya bir işlev parametresi veya dönüş değeri için beklenen türü belirten bir :term:`ek açıklama <annotation>`.

source: Type hints are optional and are not enforced by Python but they are useful to static type analysis tools, and aid IDEs with code completion and refactoring.
tr: Tür ipuçları isteğe bağlıdır ve Python tarafından uygulanmaz, ancak bunlar statik tip analiz araçları için faydalıdır ve kod tamamlama ve yeniden düzenleme ile IDE'lere yardımcı olur.

source: Type hints of global variables, class attributes, and functions, but not local variables, can be accessed using :func:`typing.get_type_hints`.
tr: Genel değişkenlerin, sınıf özniteliklerinin ve işlevlerin tür ipuçlarına, yerel değişkenlere değil, :func:`typing.get_type_hints` kullanılarak erişilebilir.

source: universal newlines
tr: evrensel yeni satırlar

source: A manner of interpreting text streams in which all of the following are recognized as ending a line: the Unix end-of-line convention ``'\n'``, the Windows convention ``'\r\n'``, and the old Macintosh convention ``'\r'``. See :pep:`278` and :pep:`3116`, as well as :func:`bytes.splitlines` for an additional use.
tr: Aşağıdakilerin tümünün bir satırın bitişi olarak kabul edildiği metin akışlarını yorumlamanın bir yolu: Unix satır sonu kuralı ``\n'``, Windows kuralı ``'\r\n'``, ve eski Macintosh kuralı ``'\r'``. Ek bir kullanım için :pep:`278` ve :pep:`3116` ve ayrıca :func:`bytes.splitlines` bakın.

source: variable annotation
tr: değişken açıklama

source: An :term:`annotation` of a variable or a class attribute.
tr: Bir değişkenin veya bir sınıf özniteliğinin :term:`ek açıklaması <annotation>`.

source: When annotating a variable or a class attribute, assignment is optional::
tr: Bir değişkene veya sınıf niteliğine açıklama eklerken atama isteğe bağlıdır::

source: Variable annotations are usually used for :term:`type hints <type hint>`: for example this variable is expected to take :class:`int` values::
tr: Değişken açıklamaları genellikle :term:`tür ipuçları <type hint>` için kullanılır: örneğin, bu değişkenin :class:`int` değerlerini alması beklenir::

source: Variable annotation syntax is explained in section :ref:`annassign`.
tr: Değişken açıklama sözdizimi :ref:`annassign` bölümünde açıklanmıştır.

source: See :term:`function annotation`, :pep:`484` and :pep:`526`, which describe this functionality. Also see :ref:`annotations-howto` for best practices on working with annotations.
tr: Bu işlevi açıklayan; :term:`function annotation`, :pep:`484` ve :pep:`526` bölümlerine bakın. Ek açıklamalarla çalışmaya ilişkin en iyi uygulamalar için ayrıca bkz. :ref:`annotations-howto`.

source: virtual environment
tr: sanal ortam

source: A cooperatively isolated runtime environment that allows Python users and applications to install and upgrade Python distribution packages without interfering with the behaviour of other Python applications running on the same system.
tr: Python kullanıcılarının ve uygulamalarının, aynı sistem üzerinde çalışan diğer Python uygulamalarının davranışına müdahale etmeden Python dağıtım paketlerini kurmasına ve yükseltmesine olanak tanıyan, işbirliği içinde yalıtılmış bir çalışma zamanı ortamı.

source: See also :mod:`venv`.
tr: Ayrıca bakınız :mod:`venv`.

source: virtual machine
tr: sanal makine

source: A computer defined entirely in software. Python's virtual machine executes the :term:`bytecode` emitted by the bytecode compiler.
tr: Tamamen yazılımla tanımlanmış bir bilgisayar. Python'un sanal makinesi, bayt kodu derleyicisi tarafından yayınlanan :term:`bytecode` 'u çalıştırır.

source: Zen of Python
tr: Python'un Zen'i

source: Listing of Python design principles and philosophies that are helpful in understanding and using the language. The listing can be found by typing "``import this``" at the interactive prompt.
tr: Dili anlamaya ve kullanmaya yardımcı olan Python tasarım ilkeleri ve felsefelerinin listesi. Liste, etkileşimli komut isteminde "``import this``" yazarak bulunabilir.
