Repository: python/python-docs-tr
Catalog: glossary.po
Languages: tr

source: hash-based pyc
tr: karma tabanlı pyc

source: A bytecode cache file that uses the hash rather than the last-modified time of the corresponding source file to determine its validity. See :ref:`pyc-invalidation`.
tr: Geçerliliğini belirlemek için ilgili kaynak dosyanın son değiştirilme zamanı yerine karma değerini kullanan bir bayt kodu önbellek dosyası. Bakınız :ref:`pyc-invalidation`.

source: hashable
tr: yıkanabilir

source: An object is *hashable* if it has a hash value which never changes during its lifetime (it needs a :meth:`__hash__` method), and can be compared to other objects (it needs an :meth:`__eq__` method). Hashable objects which compare equal must have the same hash value.
tr: Bir nesne, ömrü boyunca asla değişmeyen bir karma değere sahipse (bir :meth:`__hash__` yöntemine ihtiyaç duyar) ve diğer nesnelerle karşılaştırılabilirse (bir :meth:`__eq__` yöntemine ihtiyaç duyar) *hashable* olur. . Eşit karşılaştıran Hashable nesneleri aynı karma değerine sahip olmalıdır.

source: Hashability makes an object usable as a dictionary key and a set member, because these data structures use the hash value internally.
tr: Hashability, bir nesneyi bir sözlük anahtarı ve bir set üyesi olarak kullanılabilir hale getirir, çünkü bu veri yapıları hash değerini dahili olarak kullanır.

source: Most of Python's immutable built-in objects are hashable; mutable containers (such as lists or dictionaries) are not; immutable containers (such as tuples and frozensets) are only hashable if their elements are hashable. Objects which are instances of user-defined classes are hashable by default. They all compare unequal (except with themselves), and their hash value is derived from their :func:`id`.
tr: Python'un değişmez yerleşik nesnelerinin çoğu, yıkanabilir; değiştirilebilir kaplar (listeler veya sözlükler gibi) değildir; değişmez kaplar (tüpler ve donmuş kümeler gibi) yalnızca öğelerinin yıkanabilir olması durumunda yıkanabilirdir. Kullanıcı tanımlı sınıfların örnekleri olan nesneler varsayılan olarak hash edilebilirdir. Hepsi eşit olmayanı karşılaştırır (kendileriyle hariç) ve hash değerleri :func:`id` 'lerinden türetilir.

source: IDLE
tr: BOŞTA

source: An Integrated Development and Learning Environment for Python. :ref:`idle` is a basic editor and interpreter environment which ships with the standard distribution of Python.
tr: Python için Entegre Geliştirme Ortamı. :ref:`idle`, Python'un standart dağıtımıyla birlikte gelen temel bir düzenleyici ve yorumlayıcı ortamıdır.

source: immutable
tr: değişmez

source: An object with a fixed value. Immutable objects include numbers, strings and tuples. Such an object cannot be altered. A new object has to be created if a different value has to be stored. They play an important role in places where a constant hash value is needed, for example as a key in a dictionary.
tr: Sabit değeri olan bir nesne. Değişmez nesneler arasında sayılar, dizeler ve demetler bulunur. Böyle bir nesne değiştirilemez. Farklı bir değerin saklanması gerekiyorsa yeni bir nesne oluşturulmalıdır. Örneğin bir sözlükte anahtar olarak, sabit bir karma değerinin gerekli olduğu yerlerde önemli bir rol oynarlar.

source: import path
tr: içe aktarım yolu

source: A list of locations (or :term:`path entries <path entry>`) that are searched by the :term:`path based finder` for modules to import. During import, this list of locations usually comes from :data:`sys.path`, but for subpackages it may also come from the parent package's ``__path__`` attribute.
tr: İçe aktarılacak modüller için :term:`path based finder` tarafından aranan konumların (veya :term:`path entries <path entry>`) listesi. İçe aktarma sırasında, bu konum listesi genellikle :data:`sys.path` adresinden gelir, ancak alt paketler için üst paketin ``__path__`` özelliğinden de gelebilir.

source: importing
tr: içe aktarma

source: The process by which Python code in one module is made available to Python code in another module.
tr: Bir modüldeki Python kodunun başka bir modüldeki Python koduna sunulması süreci.

source: importer
tr: içe aktarıcı

source: An object that both finds and loads a module; both a :term:`finder` and :term:`loader` object.
tr: Bir modülü hem bulan hem de yükleyen bir nesne; hem bir :term:`finder` hem de :term:`loader` nesnesi.

source: interactive
tr: etkileşimli

source: Python has an interactive interpreter which means you can enter statements and expressions at the interpreter prompt, immediately execute them and see their results. Just launch ``python`` with no arguments (possibly by selecting it from your computer's main menu). It is a very powerful way to test out new ideas or inspect modules and packages (remember ``help(x)``).
tr: Python'un etkileşimli bir yorumlayıcısı vardır; bu, yorumlayıcı isteminde ifadeler ve ifadeler girebileceğiniz, bunları hemen çalıştırabileceğiniz ve sonuçlarını görebileceğiniz anlamına gelir. Herhangi bir argüman olmadan ``python`` 'u başlatmanız yeterlidir (muhtemelen bilgisayarınızın ana menüsünden seçerek). Yeni fikirleri test etmenin veya modülleri ve paketleri incelemenin çok güçlü bir yoludur (``help(x)`` 'i unutmayın).

source: interpreted
tr: yorumlanmış

source: Python is an interpreted language, as opposed to a compiled one, though the distinction can be blurry because of the presence of the bytecode compiler. This means that source files can be run directly without explicitly creating an executable which is then run. Interpreted languages typically have a shorter development/debug cycle than compiled ones, though their programs generally also run more slowly. See also :term:`interactive`.
tr: Python, derlenmiş bir dilin aksine yorumlanmış bir dildir, ancak bayt kodu derleyicisinin varlığı nedeniyle ayrım bulanık olabilir. Bu, kaynak dosyaların daha sonra çalıştırılacak bir yürütülebilir dosya oluşturmadan doğrudan çalıştırılabileceği anlamına gelir. Yorumlanan diller genellikle derlenmiş dillerden daha kısa bir geliştirme/hata ayıklama döngüsüne sahiptir, ancak programları genellikle daha yavaş çalışır. Ayrıca bkz. :term:`interactive`.

source: interpreter shutdown
tr: tercüman kapatma

source: When asked to shut down, the Python interpreter enters a special phase where it gradually releases all allocated resources, such as modules and various critical internal structures. It also makes several calls to the :term:`garbage collector <garbage collection>`. This can trigger the execution of code in user-defined destructors or weakref callbacks. Code executed during the shutdown phase can encounter various exceptions as the resources it relies on may not function anymore (common examples are library modules or the warnings machinery).
tr: Kapatılması istendiğinde, Python yorumlayıcısı, modüller ve çeşitli kritik iç yapılar gibi tahsis edilen tüm kaynakları kademeli olarak serbest bıraktığı özel bir aşamaya girer. Ayrıca :term:`garbage collector <garbage collection>` için birkaç çağrı yapar. Bu, kullanıcı tanımlı yıkıcılarda veya zayıf referans geri aramalarında kodun yürütülmesini tetikleyebilir. Kapatma aşamasında yürütülen kod, dayandığı kaynaklar artık çalışmayabileceğinden çeşitli istisnalarla karşılaşabilir (yaygın örnekler kütüphane modülleri veya uyarı makineleridir).

source: The main reason for interpreter shutdown is that the ``__main__`` module or the script being run has finished executing.
tr: Yorumlayıcının kapatılmasının ana nedeni, ``__main__`` modülünün veya çalıştırılan betiğin yürütmeyi bitirmiş olmasıdır.

source: iterable
tr: yinelenebilir

source: An object capable of returning its members one at a time. Examples of iterables include all sequence types (such as :class:`list`, :class:`str`, and :class:`tuple`) and some non-sequence types like :class:`dict`, :term:`file objects <file object>`, and objects of any classes you define with an :meth:`__iter__` method or with a :meth:`__getitem__` method that implements :term:`sequence` semantics.
tr: Üyelerini teker teker döndürebilen bir nesne. Yineleme örnekleri, tüm dizi türlerini (:class:`list`, :class:`str`, ve :class:`tuple` gibi) ve :class:`dict`, :term:`dosya objeleri <file object>` gibi bazı dizi olmayan türleri ve bir :meth:`__iter__` yöntemiyle veya :term:`dizi <sequence>` semantiğini uygulayan bir :meth:`__getitem__` yöntemiyle tanımladığınız tüm sınıfların nesnelerini içerir.

source: Iterables can be used in a :keyword:`for` loop and in many other places where a sequence is needed (:func:`zip`, :func:`map`, ...). When an iterable object is passed as an argument to the built-in function :func:`iter`, it returns an iterator for the object. This iterator is good for one pass over the set of values. When using iterables, it is usually not necessary to call :func:`iter` or deal with iterator objects yourself. The ``for`` statement does that automatically for you, creating a temporary unnamed variable to hold the iterator for the duration of the loop. See also :term:`iterator`, :term:`sequence`, and :term:`generator`.
tr: Yinelenebilirler bir :keyword:`for` döngüsünde ve bir dizinin gerekli olduğu diğer birçok yerde kullanılabilir (:func:`zip`, :func:`map`, ...). Yerleşik :func:`iter` işlevine argüman olarak yinelenebilir bir nesne iletildiğinde, nesne için bir yineleyici döndürür. Bu yineleyici, değerler kümesi üzerinden bir geçiş için iyidir. Yinelenebilirleri kullanırken, genellikle :func:`iter` çağırmanız veya yineleyici nesnelerle kendiniz ilgilenmeniz gerekmez. ``for`` ifadesi bunu sizin için otomatik olarak yapar ve yineleyiciyi döngü süresince tutmak için geçici bir adsız değişken oluşturur. Ayrıca bkz. :term:`iterator`, :term:`sequence` ve :term:`generator`.

source: iterator
tr: yineleyici

source: An object representing a stream of data. Repeated calls to the iterator's :meth:`~iterator.__next__` method (or passing it to the built-in function :func:`next`) return successive items in the stream. When no more data are available a :exc:`StopIteration` exception is raised instead. At this point, the iterator object is exhausted and any further calls to its :meth:`__next__` method just raise :exc:`StopIteration` again. Iterators are required to have an :meth:`__iter__` method that returns the iterator object itself so every iterator is also iterable and may be used in most places where other iterables are accepted. One notable exception is code which attempts multiple iteration passes. A container object (such as a :class:`list`) produces a fresh new iterator each time you pass it to the :func:`iter` function or use it in a :keyword:`for` loop. Attempting this with an iterator will just return the same exhausted iterator object used in the previous iteration pass, making it appear like an empty container.
tr: Bir veri akışını temsil eden bir nesne. Yineleyicinin :meth:`~iterator.__next__` yöntemine (veya yerleşik :func:`next` işlevine iletilmesi) yinelenen çağrılar, akıştaki ardışık öğeleri döndürür. Daha fazla veri bulunmadığında, bunun yerine bir :exc:`StopIteration` istisnası oluşturulur. Bu noktada, yineleyici nesnesi tükenir ve :meth:`__next__` yöntemine yapılan diğer çağrılar yalnızca :exc:`StopIteration` öğesini yeniden yükseltir. Yineleyicilerin, yineleyici nesnesinin kendisini döndüren bir :meth:`__iter__` yöntemine sahip olmaları gerekir, böylece her yineleyici de yinelenebilir ve diğer yinelenebilirlerin kabul edildiği çoğu yerde kullanılabilir. Dikkate değer bir istisna, birden çok yineleme geçişini deneyen koddur. Bir kapsayıcı nesnesi (örneğin bir :class:`list`), onu :func:`iter` işlevine her ilettiğinizde veya onu bir :keyword:`for` döngüsünde kullandığınızda yeni bir yineleyici üretir. Bunu bir yineleyiciyle denemek, önceki yineleme geçişinde kullanılan aynı tükenmiş yineleyici nesnesini döndürerek boş bir kap gibi görünmesini sağlar.

source: More information can be found in :ref:`typeiter`.
tr: Daha fazla bilgi :ref:`typeiter` içinde bulunabilir.

source: CPython does not consistently apply the requirement that an iterator define :meth:`__iter__`.
tr: CPython, bir yineleyicinin :meth:`__iter__` tanımlaması gereksinimini tutarlı bir şekilde uygulamaz.

source: key function
tr: anahtar işlev

source: A key function or collation function is a callable that returns a value used for sorting or ordering. For example, :func:`locale.strxfrm` is used to produce a sort key that is aware of locale specific sort conventions.
tr: Anahtar işlevi veya harmanlama işlevi, sıralama veya sıralama için kullanılan bir değeri döndüren bir çağrılabilir. Örneğin, :func:`locale.strxfrm`, yerel ayara özgü sıralama kurallarının farkında olan bir sıralama anahtarı üretmek için kullanılır.

source: A number of tools in Python accept key functions to control how elements are ordered or grouped. They include :func:`min`, :func:`max`, :func:`sorted`, :meth:`list.sort`, :func:`heapq.merge`, :func:`heapq.nsmallest`, :func:`heapq.nlargest`, and :func:`itertools.groupby`.
tr: Python'daki bir dizi araç, öğelerin nasıl sıralandığını veya gruplandırıldığını kontrol etmek için temel işlevleri kabul eder. Bunlar :func:`min`, :func:`max`, :func:`sorted`, :meth:`list.sort`, :func:`heapq.merge`, :func:`heapq.nsmallest`, :func:`heapq.nlargest` ve :func:`itertools.groupby`.

source: There are several ways to create a key function. For example. the :meth:`str.lower` method can serve as a key function for case insensitive sorts. Alternatively, a key function can be built from a :keyword:`lambda` expression such as ``lambda r: (r[0], r[2])``. Also, :func:`operator.attrgetter`, :func:`operator.itemgetter`, and :func:`operator.methodcaller` are three key function constructors. See the :ref:`Sorting HOW TO <sortinghowto>` for examples of how to create and use key functions.
tr: Bir tuş fonksiyonu oluşturmanın birkaç yolu vardır. Örneğin. :meth:`str.lower` yöntemi, büyük/küçük harfe duyarlı olmayan sıralamalar için bir anahtar fonksiyonu işlevi görebilir. Alternatif olarak, ``lambda r: (r[0], r[2])`` gibi bir :keyword:`lambda` ifadesinden bir anahtar işlevi oluşturulabilir. Ayrıca, :func:`~operator.attrgetter`, :func:`~operator.itemgetter` ve :func:`~operator.methodcaller` fonksiyonları üç anahtar fonksiyon kurucularıdır. Anahtar işlevlerin nasıl oluşturulacağı ve kullanılacağına ilişkin örnekler için :ref:`Sorting HOW TO <sortinghowto>` bölümüne bakın.

source: keyword argument
tr: anahtar kelime argümanı

source: See :term:`argument`.
tr: Bakınız :term:`argument`.

source: An anonymous inline function consisting of a single :term:`expression` which is evaluated when the function is called. The syntax to create a lambda function is ``lambda [parameters]: expression``
tr: İşlev çağrıldığında değerlendirilen tek bir :term:`expression` 'dan oluşan anonim bir satır içi işlev. Bir lambda işlevi oluşturmak için sözdizimi ``lambda [parametreler]: ifade`` şeklindedir

source: Look before you leap. This coding style explicitly tests for pre-conditions before making calls or lookups. This style contrasts with the :term:`EAFP` approach and is characterized by the presence of many :keyword:`if` statements.
tr: Zıplamadan önce Bak. Bu kodlama stili, arama veya arama yapmadan önce ön koşulları açıkça test eder. Bu stil, :term:`EAFP` yaklaşımıyla çelişir ve birçok :keyword:`if` ifadesinin varlığı ile karakterize edilir.

source: In a multi-threaded environment, the LBYL approach can risk introducing a race condition between "the looking" and "the leaping". For example, the code, ``if key in mapping: return mapping[key]`` can fail if another thread removes *key* from *mapping* after the test, but before the lookup. This issue can be solved with locks or by using the EAFP approach.
tr: Çok iş parçacıklı bir ortamda, LBYL yaklaşımı "bakan" ve "sıçrayan" arasında bir yarış koşulu getirme riskini taşıyabilir. Örneğin, ``if key in mapping: return mapping[key]`` kodu, testten sonra, ancak aramadan önce başka bir iş parçacığı *eşlemeden* *key* kaldırırsa başarısız olabilir. Bu sorun, kilitlerle veya EAFP yaklaşımı kullanılarak çözülebilir.

source: locale encoding
tr: yerel kodlama

source: On Unix, it is the encoding of the LC_CTYPE locale. It can be set with :func:`locale.setlocale(locale.LC_CTYPE, new_locale) <locale.setlocale>`.
tr: Unix'te, LC_CTYPE yerel ayarının kodlamasıdır. :func:`locale.setlocale(locale.LC_CTYPE, new_locale) <locale.setlocale>` ile ayarlanabilir.

source: On Windows, it is the ANSI code page (ex: ``"cp1252"``).
tr: Windows'ta bu, ANSI kod sayfasıdır (ör. ``"cp1252"``).

source: On Android and VxWorks, Python uses ``"utf-8"`` as the locale encoding.
tr: Android ve VxWorks'te Python, yerel kodlama olarak ``"utf-8"`` kullanır.

source: ``locale.getencoding()`` can be used to get the locale encoding.
tr: Yerel kodlamayı almak için ``locale.getencoding()`` kullanılabilir.

source: See also the :term:`filesystem encoding and error handler`.
tr: Ayrıca :term:`filesystem encoding and error handler` 'ne bakın.

source: list
tr: liste

source: A built-in Python :term:`sequence`. Despite its name it is more akin to an array in other languages than to a linked list since access to elements is O(1).
tr: Yerleşik bir Python :term:`dizi`. Adına rağmen, öğelere erişim O(1) olduğundan, diğer dillerdeki bir diziye, bağlantılı bir listeden daha yakındır.

source: list comprehension
tr: liste anlama

source: A compact way to process all or part of the elements in a sequence and return a list with the results. ``result = ['{:#04x}'.format(x) for x in range(256) if x % 2 == 0]`` generates a list of strings containing even hex numbers (0x..) in the range from 0 to 255. The :keyword:`if` clause is optional. If omitted, all elements in ``range(256)`` are processed.
tr: Bir dizideki öğelerin tümünü veya bir kısmını işlemenin ve sonuçları içeren bir liste döndürmenin kompakt bir yolu. ``sonuç = ['{:#04x}'.format(x) for range(256) if x % 2 == 0]``, dizinde çift onaltılık sayılar (0x..) içeren bir diziler listesi oluşturur. 0 ile 255 arasındadır. :keyword:`if` yan tümcesi isteğe bağlıdır. Atlanırsa, "aralık(256)" içindeki tüm öğeler işlenir.

source: loader
tr: yükleyici

source: An object that loads a module. It must define a method named :meth:`load_module`. A loader is typically returned by a :term:`finder`. See :pep:`302` for details and :class:`importlib.abc.Loader` for an :term:`abstract base class`.
tr: Modül yükleyen bir nesne. :meth:`load_module` adında bir yöntem tanımlamalıdır. Bir yükleyici genellikle bir :term:`finder` ile döndürülür. Ayrıntılar için :pep:`302` ve bir :term:`soyut temel sınıf` için :class:`importlib.abc.Loader` bölümüne bakın.

source: magic method
tr: sihirli yöntem

source: An informal synonym for :term:`special method`.
tr: :term:`special method` için gayri resmi bir eşanlamlı.

source: mapping
tr: haritalama

source: A container object that supports arbitrary key lookups and implements the methods specified in the :class:`collections.abc.Mapping` or :class:`collections.abc.MutableMapping` :ref:`abstract base classes <collections-abstract-base-classes>`. Examples include :class:`dict`, :class:`collections.defaultdict`, :class:`collections.OrderedDict` and :class:`collections.Counter`.
tr: Keyfi anahtar aramalarını destekleyen ve :class:`~collections.abc.Mapping` veya :class:`~collections.abc.MutableMapping` :ref:`collections-abstract-base-classes` içinde belirtilen yöntemleri uygulayan bir kapsayıcı nesnesi. Örnekler arasında :class:`dict`, :class:`collections.defaultdict`, :class:`collections.OrderedDict` ve :class:`collections.Counter` sayılabilir.

source: meta path finder
tr: meta yol bulucu

source: A :term:`finder` returned by a search of :data:`sys.meta_path`. Meta path finders are related to, but different from :term:`path entry finders <path entry finder>`.
tr: Bir :term:`finder`, :data:`sys.meta_path` aramasıyla döndürülür. Meta yol bulucular, :term:`yol girişi bulucuları <path entry finder>` ile ilişkilidir, ancak onlardan farklıdır.

source: See :class:`importlib.abc.MetaPathFinder` for the methods that meta path finders implement.
tr: Meta yol bulucuların uyguladığı yöntemler için :class:`importlib.abc.MetaPathFinder` bölümüne bakın.

source: metaclass
tr: metasınıf

source: The class of a class. Class definitions create a class name, a class dictionary, and a list of base classes. The metaclass is responsible for taking those three arguments and creating the class. Most object oriented programming languages provide a default implementation. What makes Python special is that it is possible to create custom metaclasses. Most users never need this tool, but when the need arises, metaclasses can provide powerful, elegant solutions. They have been used for logging attribute access, adding thread-safety, tracking object creation, implementing singletons, and many other tasks.
tr: Bir sınıfın sınıfı. Sınıf tanımları, bir sınıf adı, bir sınıf sözlüğü ve temel sınıfların bir listesini oluşturur. Metasınıf, bu üç argümanı almaktan ve sınıfı oluşturmaktan sorumludur. Çoğu nesne yönelimli programlama dili, varsayılan bir uygulama sağlar. Python'u özel yapan şey, özel metasınıflar oluşturmanın mümkün olmasıdır. Çoğu kullanıcı bu araca hiçbir zaman ihtiyaç duymaz, ancak ihtiyaç duyulduğunda, metasınıflar güçlü ve zarif çözümler sağlayabilir. Nitelik erişimini günlüğe kaydetmek, iş parçacığı güvenliği eklemek, nesne oluşturmayı izlemek, tekilleri uygulamak ve diğer birçok görev için kullanılmışlardır.

source: More information can be found in :ref:`metaclasses`.
tr: Daha fazla bilgi :ref:`metaclasses` içinde bulunabilir.

source: method
tr: metot

source: A function which is defined inside a class body. If called as an attribute of an instance of that class, the method will get the instance object as its first :term:`argument` (which is usually called ``self``). See :term:`function` and :term:`nested scope`.
tr: Bir sınıf gövdesi içinde tanımlanan bir işlev. Bu sınıfın bir örneğinin özniteliği olarak çağrılırsa, yöntem örnek nesnesini ilk :term:`argument` (genellikle ``self`` olarak adlandırılır) olarak alır. Bkz. :term:`function` ve :term:`nested scope`.

source: method resolution order
tr: metot kalite sıralaması

source: Method Resolution Order is the order in which base classes are searched for a member during lookup. See `The Python 2.3 Method Resolution Order <https://www.python.org/download/releases/2.3/mro/>`_ for details of the algorithm used by the Python interpreter since the 2.3 release.
tr: Metot Çözüm Sırası, arama sırasında bir üye için temel sınıfların arandığı sıradır. 2.3 sürümünden bu yana Python yorumlayıcısı tarafından kullanılan algoritmanın ayrıntıları için bkz. `The Python 2.3 Method Resolution Order <https://www.python.org/download/releases/2.3/mro/>`_.

source: module
tr: modül

source: An object that serves as an organizational unit of Python code. Modules have a namespace containing arbitrary Python objects. Modules are loaded into Python by the process of :term:`importing`.
tr: Python kodunun kuruluş birimi olarak hizmet eden bir nesne. Modüller, rastgele Python nesneleri içeren bir ad alanına sahiptir. Modüller, :term:`importing` işlemiyle Python'a yüklenir.

source: See also :term:`package`.
tr: Ayrıca bakınız :term:`package`.

source: module spec
tr: modül özelliği

source: A namespace containing the import-related information used to load a module. An instance of :class:`importlib.machinery.ModuleSpec`.
tr: Bir modülü yüklemek için kullanılan içe aktarmayla ilgili bilgileri içeren bir ad alanı. Bir :class:`importlib.machinery.ModuleSpec` örneği.

source: See :term:`method resolution order`.
tr: Bakınız :term:`metot çözüm sırası <method resolution order>`.

source: mutable
tr: değiştirilebilir

source: Mutable objects can change their value but keep their :func:`id`. See also :term:`immutable`.
tr: Değiştirilebilir (mutable) nesneler değerlerini değiştirebilir ancak :func:`idlerini <id>` koruyabilirler. Ayrıca bkz. :term:`immutable`.
