Repository: python/python-docs-tr
Catalog: glossary.po
Languages: tr

source: Glossary
tr: Sözlük

source: The default Python prompt of the interactive shell. Often seen for code examples which can be executed interactively in the interpreter.
tr: Etkileşimli kabuğun varsayılan Python istemi. Genellikle yorumlayıcıda etkileşimli olarak yürütülebilen kod örnekleri için görülür.

source: Can refer to:
tr: Şunlara başvurabilir:

source: The default Python prompt of the interactive shell when entering the code for an indented code block, when within a pair of matching left and right delimiters (parentheses, square brackets, curly braces or triple quotes), or after specifying a decorator.
tr: Girintili bir kod bloğu için kod girerken, eşleşen bir çift sol ve sağ sınırlayıcı (parantez, köşeli parantez, kaşlı ayraç veya üçlü tırnak) içindeyken veya bir dekoratör belirttikten sonra etkileşimli kabuğun varsayılan Python istemi.

source: The :const:`Ellipsis` built-in constant.
tr: :const:`Elipsis` yerleşik sabiti.

source: A tool that tries to convert Python 2.x code to Python 3.x code by handling most of the incompatibilities which can be detected by parsing the source and traversing the parse tree.
tr: Kaynağı ayrıştırarak ve ayrıştırma ağacında gezinerek tespit edilebilecek uyumsuzlukların çoğunu işleyerek Python 2.x kodunu Python 3.x koduna dönüştürmeye çalışan bir araç.

source: 2to3 is available in the standard library as :mod:`lib2to3`; a standalone entry point is provided as :file:`Tools/scripts/2to3`. See :ref:`2to3-reference`.
tr: 2to3, standart kütüphanede :mod:`lib2to3'; bağımsız bir giriş noktası şu şekilde sağlanır:file:`Tools/scripts/2to3`. Bakınız :ref:`2to3-reference`.

source: abstract base class
tr: soyut temel sınıf

source: Abstract base classes complement :term:`duck-typing` by providing a way to define interfaces when other techniques like :func:`hasattr` would be clumsy or subtly wrong (for example with :ref:`magic methods <special-lookup>`). ABCs introduce virtual subclasses, which are classes that don't inherit from a class but are still recognized by :func:`isinstance` and :func:`issubclass`; see the :mod:`abc` module documentation. Python comes with many built-in ABCs for data structures (in the :mod:`collections.abc` module), numbers (in the :mod:`numbers` module), streams (in the :mod:`io` module), import finders and loaders (in the :mod:`importlib.abc` module). You can create your own ABCs with the :mod:`abc` module.
tr: Soyut temel sınıflar :term:`duck-typing` 'i, :func:`hasattr` gibi diğer teknikler beceriksiz veya tamamen yanlış olduğunda arayüzleri tanımlamanın bir yolunu sağlayarak tamamlar (örneğin :ref:`sihirli yöntemlerle <special-lookup>`). ABC'ler, bir sınıftan miras almayan ancak yine de :func:`isinstance` ve :func:`issubclass` tarafından tanınan sınıflar olan sanal alt sınıfları tanıtır; :mod:`abc` modül belgelerine bakın. Python comes with many built-in ABCs for data structures (in the :mod:`collections.abc` module), numbers (in the :mod:`numbers` module), streams (in the :mod:`io` module), import finders and loaders (in the :mod:`importlib.abc` module). :mod:`abc` modülü ile kendi ABC'lerinizi oluşturabilirsiniz.

source: annotation
tr: dipnot

source: A label associated with a variable, a class attribute or a function parameter or return value, used by convention as a :term:`type hint`.
tr: Bir değişkenle, bir sınıf niteliğiyle veya bir fonksiyon parametresiyle veya bir dönüş değeriyle ilişkilendirilen, gelenek olarak :term:`type hint <type hint>` biçiminde kullanılan bir etiket.

source: Annotations of local variables cannot be accessed at runtime, but annotations of global variables, class attributes, and functions are stored in the :attr:`__annotations__` special attribute of modules, classes, and functions, respectively.
tr: Yerel değişkenlerin açıklamalarına çalışma zamanında erişilemez, ancak global değişkenlerin, sınıf niteliklerinin ve işlevlerin açıklamaları, sırasıyla modüllerin, sınıfların ve işlevlerin :attr:`__annotations__` özel özelliğinde saklanır.

source: See :term:`variable annotation`, :term:`function annotation`, :pep:`484` and :pep:`526`, which describe this functionality. Also see :ref:`annotations-howto` for best practices on working with annotations.
tr: Bu işlevi açıklayan :term:`variable annotation`, :term:`function annotation`, :pep:`484` ve :pep:`526`'e bakın. Ek açıklamalarla çalışmaya ilişkin en iyi uygulamalar için ayrıca bkz. :ref:`annotations-howto`.

source: argument
tr: argüman

source: A value passed to a :term:`function` (or :term:`method`) when calling the function. There are two kinds of argument:
tr: Fonksiyon çağrılırken bir :term:`function` 'a (veya :term:`method`) geçirilen bir değer. İki tür argüman vardır:

source: :dfn:`keyword argument`: an argument preceded by an identifier (e.g. ``name=``) in a function call or passed as a value in a dictionary preceded by ``**``. For example, ``3`` and ``5`` are both keyword arguments in the following calls to :func:`complex`::
tr: :dfn:`keyword argument`: bir işlev çağrısında bir tanımlayıcının (ör. ``ad=``) önüne geçen veya bir sözlükte ``**`` ile başlayan bir değer olarak geçirilen bir argüman. Örneğin, ``3`` ve ``5``, aşağıdaki :func:`complex`: çağrılarında anahtar kelimenin argümanleridir:

source: :dfn:`positional argument`: an argument that is not a keyword argument. Positional arguments can appear at the beginning of an argument list and/or be passed as elements of an :term:`iterable` preceded by ``*``. For example, ``3`` and ``5`` are both positional arguments in the following calls::
tr: :dfn:`positional argument`: anahtar kelime argümanı olmayan bir argüman. Konumsal argümanler, bir argüman listesinin başında görünebilir ve/veya ``*`` ile başlayan bir :term:`iterable` öğesinin öğeleri olarak iletilebilir. Örneğin, ``3`` ve ``5``, aşağıdaki çağrılarda konumsal argümanlerdir:

source: Arguments are assigned to the named local variables in a function body. See the :ref:`calls` section for the rules governing this assignment. Syntactically, any expression can be used to represent an argument; the evaluated value is assigned to the local variable.
tr: Argümanler, bir fonksiyon gövdesindeki adlandırılmış yerel değişkenlere atanır. Bu atamayı yöneten kurallar için :ref:`calls` bölümüne bakın. Sözdizimsel olarak, bir argümanı temsil etmek için herhangi bir ifade kullanılabilir; değerlendirilen değer yerel değişkene atanır.

source: See also the :term:`parameter` glossary entry, the FAQ question on :ref:`the difference between arguments and parameters <faq-argument-vs-parameter>`, and :pep:`362`.
tr: Ayrıca :term:`parameter` sözlüğü girişine, :ref:`the difference between arguments and parameters <faq-argument-vs-parameter>` hakkındaki SSS sorusuna ve :pep:`362` 'ye bakın.

source: asynchronous context manager
tr: asenkron bağlam yöneticisi

source: An object which controls the environment seen in an :keyword:`async with` statement by defining :meth:`__aenter__` and :meth:`__aexit__` methods. Introduced by :pep:`492`.
tr: :keyword:`async with` ifadesinde görülen ortamı :meth:`__aenter__` ve :meth:`__aexit__` yöntemlerini tanımlayarak kontrol eden bir nesne. :pep:`492` de anlatıldı.

source: asynchronous generator
tr: asenkron jeneratör

source: A function which returns an :term:`asynchronous generator iterator`. It looks like a coroutine function defined with :keyword:`async def` except that it contains :keyword:`yield` expressions for producing a series of values usable in an :keyword:`async for` loop.
tr: :term:`asynchronous generator iterator` döndüren bir işlev. Bir :keyword:`async for` döngüsünde kullanılabilen bir dizi değer üretmek için :keyword:`yield` ifadeleri içermesi dışında :keyword:`async def` ile tanımlanmış bir eşyordam işlevine benziyor.

source: Usually refers to an asynchronous generator function, but may refer to an *asynchronous generator iterator* in some contexts. In cases where the intended meaning isn't clear, using the full terms avoids ambiguity.
tr: Genellikle bir asenkron üreteç işlevine atıfta bulunur, ancak bazı bağlamlarda bir *asynchronous generator iterator* 'e karşılık gelebilir. Amaçlanan anlamın net olmadığı durumlarda, tam terimlerin kullanılması belirsizliği önler.

source: An asynchronous generator function may contain :keyword:`await` expressions as well as :keyword:`async for`, and :keyword:`async with` statements.
tr: Bir asenkron üretici fonksiyonu, :keyword:`await` ifadelerinin yanı sıra :keyword:`async for` ve :keyword:`async with` ifadeleri içerebilir.

source: asynchronous generator iterator
tr: asenkron jeneratör yineleyici

source: An object created by a :term:`asynchronous generator` function.
tr: Bir :term:`asynchronous generator` işlevi tarafından oluşturulan bir nesne.

source: This is an :term:`asynchronous iterator` which when called using the :meth:`__anext__` method returns an awaitable object which will execute the body of the asynchronous generator function until the next :keyword:`yield` expression.
tr: Bu, :meth:`__anext__` yöntemi kullanılarak çağrıldığında, bir sonraki :keyword:`yield` ifadesine kadar asynchronous generator işlevinin gövdesini yürütecek, beklenebilir bir nesne döndüren bir :term:`asynchronous iterator`.

source: Each :keyword:`yield` temporarily suspends processing, remembering the location execution state (including local variables and pending try-statements). When the *asynchronous generator iterator* effectively resumes with another awaitable returned by :meth:`__anext__`, it picks up where it left off. See :pep:`492` and :pep:`525`.
tr: Her :keyword:`yield`, konum yürütme durumunu hatırlayarak (yerel değişkenler ve bekleyen try ifadeleri dahil) işlemeyi geçici olarak askıya alır. *asynchronous generator iterator*, :meth:`__anext__` tarafından döndürülen başka birbeklenebilir ile etkili bir şekilde devam ettiğinde, kaldığı yerden devam eder. Bkz. :pep:`492` ve :pep:`525`.

source: asynchronous iterable
tr: eşzamansız yinelenebilir

source: An object, that can be used in an :keyword:`async for` statement. Must return an :term:`asynchronous iterator` from its :meth:`__aiter__` method. Introduced by :pep:`492`.
tr: Bir :keyword:`async for` ifadesinde kullanılabilen bir nesne. :meth:`__aiter__` yönteminden bir :term:`asynchronous iterator` döndürmelidir. :pep:`492` 'de tanıtıldı.

source: asynchronous iterator
tr: asenkron yineleyici

source: An object that implements the :meth:`__aiter__` and :meth:`__anext__` methods. ``__anext__`` must return an :term:`awaitable` object. :keyword:`async for` resolves the awaitables returned by an asynchronous iterator's :meth:`__anext__` method until it raises a :exc:`StopAsyncIteration` exception. Introduced by :pep:`492`.
tr: :meth:`__aiter__` ve :meth:`__anext__` yöntemlerini uygulayan bir nesne. ``__anext__`` bir :term:`awaitable` nesnesi döndürmelidir. :keyword:`async for`, bir asenkron yineleyicinin :meth:`__anext__` yöntemi tarafından döndürülen beklenebilirleri bir :exc:`StopAsyncIteration` istisnası oluşturana kadar çözer. :pep:`492` 'de açıklandı.

source: attribute
tr: nitelik

source: A value associated with an object which is usually referenced by name using dotted expressions. For example, if an object *o* has an attribute *a* it would be referenced as *o.a*.
tr: Noktalı ifadeler kullanılarak adıyla başvurulan bir nesneyle ilişkili değer. Örneğin, *o* nesnesinin *a* özniteliği varsa, bu nesneye *o.a* olarak başvurulur.

source: It is possible to give an object an attribute whose name is not an identifier as defined by :ref:`identifiers`, for example using :func:`setattr`, if the object allows it. Such an attribute will not be accessible using a dotted expression, and would instead need to be retrieved with :func:`getattr`.
tr: Bir nesneye, eğer nesne izin veriyorsa, örneğin :func:`setattr` kullanarak, adı :ref:`identifiers` tarafından tanımlandığı gibi tanımlayıcı olmayan bir öznitelik vermek mümkündür. Böyle bir özniteliğe noktalı bir ifade kullanılarak erişilemez ve bunun yerine :func:`getattr` ile alınması gerekir.

source: awaitable
tr: beklenebilir

source: An object that can be used in an :keyword:`await` expression. Can be a :term:`coroutine` or an object with an :meth:`__await__` method. See also :pep:`492`.
tr: :keyword:`await` ifadesinde kullanılabilen bir nesne. Bir :term:`coroutine` veya :meth:`__await__` yöntemine sahip bir nesne olabilir. Ayrıca bakınız :pep:`492`.

source: Benevolent Dictator For Life, a.k.a. `Guido van Rossum <https://gvanrossum.github.io/>`_, Python's creator.
tr: Benevolent Dictator For Life, namı diğer `Guido van Rossum <https://gvanrossum.github.io/>`_, Python'un yaratıcısı.

source: binary file
tr: ikili dosya

source: A :term:`file object` able to read and write :term:`bytes-like objects <bytes-like object>`. Examples of binary files are files opened in binary mode (``'rb'``, ``'wb'`` or ``'rb+'``), :data:`sys.stdin.buffer`, :data:`sys.stdout.buffer`, and instances of :class:`io.BytesIO` and :class:`gzip.GzipFile`.
tr: Bir :term:`dosya nesnesi <file object>` :term:`bayt benzeri nesneler <bytes-like object>` okuyabilir ve yazabilir. İkili dosya örnekleri, ikili modda açılan dosyalardır (``'rb'``, ``'wb'`` veya ``'rb+'``), :data:`sys.stdin.buffer`, :data:`sys.stdout.buffer` ve :class:`io.BytesIO` ve :class:`gzip.GzipFile` örnekleri.

source: See also :term:`text file` for a file object able to read and write :class:`str` objects.
tr: Ayrıca :class:`str` nesnelerini okuyabilen ve yazabilen bir dosya nesnesi için :term:`text file` 'a bakın.

source: borrowed reference
tr: ödünç alınan referans

source: In Python's C API, a borrowed reference is a reference to an object. It does not modify the object reference count. It becomes a dangling pointer if the object is destroyed. For example, a garbage collection can remove the last :term:`strong reference` to the object and so destroy it.
tr: Python'un C API 'sinde ödünç alınan referans, bir nesneye yapılan bir referanstır. Nesne referans sayısını değiştirmez. Nesne yok edilirse sarkan bir işaretçi olur. Örneğin, bir çöp toplama, nesneye yapılan son :term:`strong reference` kaldırabilir ve böylece onu yok edebilir.

source: Calling :c:func:`Py_INCREF` on the :term:`borrowed reference` is recommended to convert it to a :term:`strong reference` in-place, except when the object cannot be destroyed before the last usage of the borrowed reference. The :c:func:`Py_NewRef` function can be used to create a new :term:`strong reference`.
tr: :term:`borrowed reference` üzerinde :c:func:`Py_INCREF` çağırmak, nesnenin ödünç alınanın son kullanımından önce yok edilemediği durumlar dışında, onu yerinde bir :term:`strong reference` 'a dönüştürmek için tavsiye edilir. referans. :c:func:`Py_NewRef` işlevi, yeni bir :term:`strong reference` oluşturmak için kullanılabilir.

source: bytes-like object
tr: bayt benzeri nesne

source: An object that supports the :ref:`bufferobjects` and can export a C-:term:`contiguous` buffer. This includes all :class:`bytes`, :class:`bytearray`, and :class:`array.array` objects, as well as many common :class:`memoryview` objects. Bytes-like objects can be used for various operations that work with binary data; these include compression, saving to a binary file, and sending over a socket.
tr: :ref:`bufferobjects` 'i destekleyen ve bir C-:term:`contiguous` arabelleğini dışa aktarabilen bir nesne. Bu, tüm :class:`bytes`, :class:`bytearray` ve :class:`array.array` nesnelerinin yanı sıra birçok yaygın :class:`memoryview` nesnesini içerir. Bayt benzeri nesneler, ikili verilerle çalışan çeşitli işlemler için kullanılabilir; bunlara sıkıştırma, ikili dosyaya kaydetme ve bir soket üzerinden gönderme dahildir.

source: Some operations need the binary data to be mutable. The documentation often refers to these as "read-write bytes-like objects". Example mutable buffer objects include :class:`bytearray` and a :class:`memoryview` of a :class:`bytearray`. Other operations require the binary data to be stored in immutable objects ("read-only bytes-like objects"); examples of these include :class:`bytes` and a :class:`memoryview` of a :class:`bytes` object.
tr: Bazı işlemler, değişken olması için ikili verilere ihtiyaç duyar. Belgeler genellikle bunlara "okuma-yazma bayt benzeri nesneler" olarak atıfta bulunur. Örnek değiştirilebilir arabellek nesneleri :class:`bytearray` ve bir :class:`bytearray` :class:`memoryview` içerir. Diğer işlemler, ikili verilerin değişmez nesnelerde ("salt okunur bayt benzeri nesneler") depolanmasını gerektirir; bunların örnekleri arasında :class:`bytes` ve bir :class:`bytes` nesnesinin :class:`memoryview` bulunur.

source: bytecode
tr: bayt kodu

source: Python source code is compiled into bytecode, the internal representation of a Python program in the CPython interpreter. The bytecode is also cached in ``.pyc`` files so that executing the same file is faster the second time (recompilation from source to bytecode can be avoided). This "intermediate language" is said to run on a :term:`virtual machine` that executes the machine code corresponding to each bytecode. Do note that bytecodes are not expected to work between different Python virtual machines, nor to be stable between Python releases.
tr: Python kaynak kodu, bir Python programının CPython yorumlayıcısındaki dahili temsili olan bayt kodunda derlenir. Bayt kodu ayrıca ``.pyc`` dosyalarında önbelleğe alınır, böylece aynı dosyanın ikinci kez çalıştırılması daha hızlı olur (kaynaktan bayt koduna yeniden derleme önlenebilir). Bu "ara dilin", her bir bayt koduna karşılık gelen makine kodunu yürüten bir :term:`sanal makine <virtual machine>` üzerinde çalıştığı söylenir. Bayt kodlarının farklı Python sanal makineleri arasında çalışması veya Python sürümleri arasında kararlı olması beklenmediğini unutmayın.

source: A list of bytecode instructions can be found in the documentation for :ref:`the dis module <bytecodes>`.
tr: Bayt kodu talimatlarının bir listesi :ref:`bytecodes` dokümanında bulunabilir.

source: callable
tr: çağırılabilir

source: A callable is an object that can be called, possibly with a set of arguments (see :term:`argument`), with the following syntax::
tr: Bir çağrılabilir, muhtemelen bir dizi argümanla (bkz. :term:`argument`) ve aşağıdaki sözdizimiyle çağrılabilen bir nesnedir::

source: A :term:`function`, and by extension a :term:`method`, is a callable. An instance of a class that implements the :meth:`~object.__call__` method is also a callable.
tr: Bir :term:`fonksiyon <function>` ve uzantısı olarak bir :term:`metot <method>` bir çağrılabilirdir. :meth:`~object.__call__` yöntemini uygulayan bir sınıf örneği de bir çağrılabilirdir.

source: callback
tr: geri çağırmak

source: A subroutine function which is passed as an argument to be executed at some point in the future.
tr: Gelecekte bir noktada yürütülecek bir argüman olarak iletilen bir alt program işlevi.

source: class
tr: sınıf

source: A template for creating user-defined objects. Class definitions normally contain method definitions which operate on instances of the class.
tr: Kullanıcı tanımlı nesneler oluşturmak için bir şablon. Sınıf tanımları normalde sınıfın örnekleri üzerinde çalışan yöntem tanımlarını içerir.

source: class variable
tr: sınıf değişkeni

source: A variable defined in a class and intended to be modified only at class level (i.e., not in an instance of the class).
tr: Bir sınıfta tanımlanmış ve yalnızca sınıf düzeyinde (yani sınıfın bir örneğinde değil) değiştirilmesi amaçlanan bir değişken.

source: complex number
tr: karmaşık sayı

source: An extension of the familiar real number system in which all numbers are expressed as a sum of a real part and an imaginary part. Imaginary numbers are real multiples of the imaginary unit (the square root of ``-1``), often written ``i`` in mathematics or ``j`` in engineering. Python has built-in support for complex numbers, which are written with this latter notation; the imaginary part is written with a ``j`` suffix, e.g., ``3+1j``. To get access to complex equivalents of the :mod:`math` module, use :mod:`cmath`. Use of complex numbers is a fairly advanced mathematical feature. If you're not aware of a need for them, it's almost certain you can safely ignore them.
tr: Tüm sayıların bir reel kısım ve bir sanal kısım toplamı olarak ifade edildiği bilinen gerçek sayı sisteminin bir uzantısı. Hayali sayılar, hayali birimin gerçek katlarıdır (``-1`` 'in karekökü), genellikle matematikte ``i`` veya mühendislikte ``j`` ile yazılır. Python, bu son gösterimle yazılan karmaşık sayılar için yerleşik desteğe sahiptir; hayali kısım bir ``j`` son ekiyle yazılır, örneğin ``3+1j``. :mod:`math` modülünün karmaşık eş değerlerine erişmek için :mod:`cmath` kullanın. Karmaşık sayıların kullanımı oldukça gelişmiş bir matematiksel özelliktir. Onlara olan ihtiyacın farkında değilseniz, onları güvenle görmezden gelebileceğiniz neredeyse kesindir.

source: context manager
tr: bağlam yöneticisi

source: An object which controls the environment seen in a :keyword:`with` statement by defining :meth:`__enter__` and :meth:`__exit__` methods. See :pep:`343`.
tr: :keyword:`with` ifadesinde görülen ortamı :meth:`__enter__` ve :meth:`__exit__` yöntemlerini tanımlayarak kontrol eden bir nesne. Bakınız :pep:`343`.

source: context variable
tr: bağlam değişkeni

source: A variable which can have different values depending on its context. This is similar to Thread-Local Storage in which each execution thread may have a different value for a variable. However, with context variables, there may be several contexts in one execution thread and the main usage for context variables is to keep track of variables in concurrent asynchronous tasks. See :mod:`contextvars`.
tr: Bağlamına bağlı olarak farklı değerler alabilen bir değişken. Bu, her yürütme iş parçacığının bir değişken için farklı bir değere sahip olabileceği Thread-Local Storage'a benzer. Bununla birlikte, bağlam değişkenleriyle, bir yürütme iş parçacığında birkaç bağlam olabilir ve bağlam değişkenlerinin ana kullanımı, eşzamanlı zaman uyumsuz görevlerde değişkenleri izlemektir. Bakınız :mod:`contextvars`.

source: contiguous
tr: bitişik

source: A buffer is considered contiguous exactly if it is either *C-contiguous* or *Fortran contiguous*. Zero-dimensional buffers are C and Fortran contiguous. In one-dimensional arrays, the items must be laid out in memory next to each other, in order of increasing indexes starting from zero. In multidimensional C-contiguous arrays, the last index varies the fastest when visiting items in order of memory address. However, in Fortran contiguous arrays, the first index varies the fastest.
tr: Bir arabellek, *C-bitişik* veya *Fortran bitişik* ise tam olarak bitişik olarak kabul edilir. Sıfır boyutlu arabellekler C ve Fortran bitişiktir. Tek boyutlu dizilerde, öğeler sıfırdan başlayarak artan dizinler sırasına göre bellekte yan yana yerleştirilmelidir. Çok boyutlu C-bitişik dizilerde, öğeleri bellek adresi sırasına göre ziyaret ederken son dizin en hızlı şekilde değişir. Ancak, Fortran bitişik dizilerinde, ilk dizin en hızlı şekilde değişir.

source: coroutine
tr: eşyordam

source: Coroutines are a more generalized form of subroutines. Subroutines are entered at one point and exited at another point. Coroutines can be entered, exited, and resumed at many different points. They can be implemented with the :keyword:`async def` statement. See also :pep:`492`.
tr: Eşyordamlar, altyordamların daha genelleştirilmiş bir biçimidir. Alt programlara bir noktada girilir ve başka bir noktada çıkılır. Eşyordamlar birçok farklı noktada girilebilir, çıkılabilir ve devam ettirilebilir. :keyword:`async def` ifadesi ile uygulanabilirler. Ayrıca bakınız :pep:`492`.

source: coroutine function
tr: eşyordam işlevi
