Repository: python/python-docs-tr
Catalog: license.po
Languages: tr

source: History and License
tr: Tarihçe ve Lisans

source: History of the software
tr: Yazılımın tarihçesi

source: Python was created in the early 1990s by Guido van Rossum at Stichting Mathematisch Centrum (CWI, see https://www.cwi.nl/) in the Netherlands as a successor of a language called ABC. Guido remains Python's principal author, although it includes many contributions from others.
tr: Python, 1990'ların başında Guido van Rossum tarafından Hollanda'da Stichting Mathematisch Centrum'da (CWI, bkz. https://www.cwi.nl/) ABC adlı bir dilin devamı olarak oluşturuldu. Guido, diğerlerinin oldukça katkısı olmasına rağmen, Python'un ana yazarı olmaya devam ediyor.

source: In 1995, Guido continued his work on Python at the Corporation for National Research Initiatives (CNRI, see https://www.cnri.reston.va.us/) in Reston, Virginia where he released several versions of the software.
tr: 1995'te Guido, yazılımın çeşitli sürümlerini yayınladığı Virginia, Reston'daki Ulusal Araştırma Girişimleri Kurumu'nda (CNRI, bkz. https://www.cnri.reston.va.us/) Python üzerindeki çalışmalarına devam etti.

source: In May 2000, Guido and the Python core development team moved to BeOpen.com to form the BeOpen PythonLabs team. In October of the same year, the PythonLabs team moved to Digital Creations (now Zope Corporation; see https://www.zope.org/). In 2001, the Python Software Foundation (PSF, see https://www.python.org/psf/) was formed, a non-profit organization created specifically to own Python-related Intellectual Property. Zope Corporation is a sponsoring member of the PSF.
tr: Mayıs 2000'de, Guido ve Python çekirdek geliştirme ekibi, BeOpen PythonLabs ekibini oluşturmak için BeOpen.com'a taşındı. Aynı yılın Ekim ayında PythonLabs ekibi Digital Creations'a (şimdi Zope Corporation; bkz. https://www.zope.org/) taşındı. 2001 yılında, Python Yazılım Vakfı (PSF, bkz. https://www.python.org/psf/) kuruldu, özellikle Python ile ilgili Fikri Mülkiyete sahip olmak için oluşturulmuş kar amacı gütmeyen bir organizasyon. Zope Corporation, PSF'nin sponsor üyesidir.

source: All Python releases are Open Source (see https://opensource.org/ for the Open Source Definition). Historically, most, but not all, Python releases have also been GPL-compatible; the table below summarizes the various releases.
tr: Tüm Python sürümleri Açık Kaynaklıdır (Açık Kaynak Tanımı için bkz. https://opensource.org/). Tarihsel olarak, tümü olmasa da çoğu Python sürümleri de GPL uyumluydu; aşağıdaki tablo çeşitli yayınları özetlemektedir.

source: Release
tr: Yayın

source: Derived from
tr: Şundan türedi:

source: Year
tr: Yıl

source: Owner
tr: Sahibi

source: GPL compatible?
tr: GPL uyumlu mu?

source: 0.9.0 thru 1.2
tr: 0.9.0'dan 1.2'ye

source: yes
tr: evet

source: 1.3 thru 1.5.2
tr: 1.3 'dan 1.5.2'ye

source: no
tr: hayır

source: 2.2 and above
tr: 2.2 ve üzeri

source: 2001-now
tr: 2001-Günümüz

source: GPL-compatible doesn't mean that we're distributing Python under the GPL. All Python licenses, unlike the GPL, let you distribute a modified version without making your changes open source. The GPL-compatible licenses make it possible to combine Python with other software that is released under the GPL; the others don't.
tr: GPL uyumlu olması, Python'u GPL kapsamında dağıttığımız anlamına gelmez. Tüm Python lisansları, GPL'den farklı olarak, değişikliklerinizi açık kaynak yapmadan değiştirilmiş bir sürümü dağıtmanıza izin verir. GPL uyumlu lisanslar, Python'u GPL kapsamında yayınlanan diğer yazılımlarla birleştirmeyi mümkün kılar; diğerleri yapmaz.

source: Thanks to the many outside volunteers who have worked under Guido's direction to make these releases possible.
tr: Bu yayınları mümkün kılmak için Guido'nun yönetimi altında çalışan birçok gönüllüye teşekkürler.

source: Terms and conditions for accessing or otherwise using Python
tr: Python'a erişmek veya başka bir şekilde kullanmak için şartlar ve koşullar

source: Python software and documentation are licensed under the :ref:`PSF License Agreement <PSF-license>`.
tr: Python yazılımı ve belgeleri :ref:`PSF Lisans Anlaşması <PSF-license>` kapsamında lisanslanmıştır.

source: Starting with Python 3.8.6, examples, recipes, and other code in the documentation are dual licensed under the PSF License Agreement and the :ref:`Zero-Clause BSD license <BSD0>`.
tr: Python 3.8.6'dan başlayarak, belgelerdeki örnekler, tarifler ve diğer kodlar, PSF Lisans Sözleşmesi ve :ref:`Zero-Clause BSD license <BSD0>` kapsamında çift lisanslıdır.

source: Some software incorporated into Python is under different licenses. The licenses are listed with code falling under that license. See :ref:`OtherLicenses` for an incomplete list of these licenses.
tr: Python'a dahil edilen bazı yazılımlar farklı lisanslar altındadır. Lisanslar, bu lisansa giren kodla listelenir. Bu lisansların eksik listesi için bkz. :ref:`OtherLicenses`.

source: PSF LICENSE AGREEMENT FOR PYTHON |release|
tr: PYTHON İÇİN PSF LİSANS ANLAŞMASI |release|

source: BEOPEN.COM LICENSE AGREEMENT FOR PYTHON 2.0
tr: PYTHON 2.0 İÇİN BEOPEN.COM LİSANS SÖZLEŞMESİ

source: BEOPEN PYTHON OPEN SOURCE LICENSE AGREEMENT VERSION 1
tr: BEOPEN PYTHON AÇIK KAYNAK LİSANS SÖZLEŞMESİ SÜRÜM 1

source: CNRI LICENSE AGREEMENT FOR PYTHON 1.6.1
tr: PYTHON 1.6.1 İÇİN CNRI LİSANS ANLAŞMASI

source: CWI LICENSE AGREEMENT FOR PYTHON 0.9.0 THROUGH 1.2
tr: 0.9.0 ARASI 1.2 PYTHON İÇİN CWI LİSANS SÖZLEŞMESİ

source: ZERO-CLAUSE BSD LICENSE FOR CODE IN THE PYTHON |release| DOCUMENTATION
tr: PYTHON |release| BELGELERİNDEKİ KOD İÇİN SIFIR MADDE BSD LİSANSI

source: Licenses and Acknowledgements for Incorporated Software
tr: Tüzel Yazılımlar için Lisanslar ve Onaylar

source: This section is an incomplete, but growing list of licenses and acknowledgements for third-party software incorporated in the Python distribution.
tr: Bu bölüm, Python dağıtımına dahil edilmiş üçüncü taraf yazılımlar için tamamlanmamış ancak büyüyen bir lisans ve onay listesidir.

source: Mersenne Twister
tr: Mersenne Twister'ı

source: The :mod:`_random` module includes code based on a download from http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT/MT2002/emt19937ar.html. The following are the verbatim comments from the original code::
tr: :mod:`_random` modülü, http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT/MT2002/emt19937ar.html adresinden indirilen kodu temel alır. Orijinal koddan kelimesi kelimesine yorumlar aşağıdadır::

source: Sockets
tr: Soketler

source: The :mod:`socket` module uses the functions, :func:`getaddrinfo`, and :func:`getnameinfo`, which are coded in separate source files from the WIDE Project, https://www.wide.ad.jp/. ::
tr: :mod:`socket` modülü, https://www.wide.ad.jp adresindeki WIDE Projesi'nden ayrı kaynak dosyalarında kodlanan :func:`getaddrinfo` ve :func:`getnameinfo` fonksiyonlarını kullanır. /. ::

source: Asynchronous socket services
tr: Asenkron soket hizmetleri

source: The :mod:`asynchat` and :mod:`asyncore` modules contain the following notice::
tr: :mod:`asynchat` ve :mod:`asyncore` modülleri aşağıdaki uyarıyı içerir::

source: Cookie management
tr: Çerez yönetimi

source: The :mod:`http.cookies` module contains the following notice::
tr: :mod:`http.cookies` modülü aşağıdaki uyarıyı içerir::

source: Execution tracing
tr: Çalıştırma izleme

source: The :mod:`trace` module contains the following notice::
tr: :mod:`trace` modülü aşağıdaki uyarıyı içerir::

source: UUencode and UUdecode functions
tr: UUencode ve UUdecode fonksiyonları

source: The :mod:`uu` module contains the following notice::
tr: :mod:`uu` modülü aşağıdaki uyarıyı içerir::

source: XML Remote Procedure Calls
tr: XML Uzaktan Yordam Çağrıları

source: The :mod:`xmlrpc.client` module contains the following notice::
tr: :mod:`xmlrpc.client` modülü aşağıdaki uyarıyı içerir::

source: The :mod:`test_epoll` module contains the following notice::
tr: :mod:`test_epoll` modülü aşağıdaki uyarıyı içerir::

source: Select kqueue
tr: kqueue seçin

source: The :mod:`select` module contains the following notice for the kqueue interface::
tr: :mod:`select` modülü, kqueue arayüzü için aşağıdaki uyarıyı içerir::

source: The file :file:`Python/pyhash.c` contains Marek Majkowski' implementation of Dan Bernstein's SipHash24 algorithm. It contains the following note::
tr: :file:`Python/pyhash.c` dosyası, Dan Bernstein'ın SipHash24 algoritmasının Marek Majkowski uygulamasını içerir. Burada aşağıdaki not yer alır::

source: strtod and dtoa
tr: strtod ve dtoa

source: The file :file:`Python/dtoa.c`, which supplies C functions dtoa and strtod for conversion of C doubles to and from strings, is derived from the file of the same name by David M. Gay, currently available from https://web.archive.org/web/20220517033456/http://www.netlib.org/fp/dtoa.c. The original file, as retrieved on March 16, 2009, contains the following copyright and licensing notice::
tr: C double'larının dizelere ve dizelerden dönüştürülmesi için dtoa ve strtod C fonksiyonlarını sağlayan :file:`Python/dtoa.c` dosyası, şu anda https://web.archive.org/web/20220517033456/http://www.netlib.org/fp/dtoa.c 'den erişilebilen David M. Gay tarafından aynı adlı dosyadan türetilmiştir. 16 Mart 2009'da alınan orijinal dosya aşağıdaki telif hakkı ve lisans bildirimini içerir:

source: The modules :mod:`hashlib`, :mod:`posix`, :mod:`ssl`, :mod:`crypt` use the OpenSSL library for added performance if made available by the operating system. Additionally, the Windows and macOS installers for Python may include a copy of the OpenSSL libraries, so we include a copy of the OpenSSL license here::
tr: :mod:`hashlib`, :mod:`posix`, :mod:`ssl`, :mod:`crypt` modülleri, işletim sistemi tarafından sağlanmışsa ek performans için OpenSSL kütüphanesini kullanır. Ek olarak, Python için Windows ve macOS yükleyicileri, OpenSSL kütüphanelerinin bir kopyasını içerebilir, bu nedenle buraya OpenSSL lisansının bir kopyasını ekliyoruz::

source: The :mod:`pyexpat` extension is built using an included copy of the expat sources unless the build is configured ``--with-system-expat``::
tr: :mod:`pyexpat` uzantısı, derleme ``--with-system-expat`` şeklinde yapılandırılmadığı sürece, expat kaynaklarının dahil edildiği bir kopya kullanılarak oluşturulur::

source: The :mod:`_ctypes` extension is built using an included copy of the libffi sources unless the build is configured ``--with-system-libffi``::
tr: :mod:`_ctypes` uzantısı, yapı ``--with-system-libffi`` olarak yapılandırılmadığı sürece libffi kaynaklarının dahil edildiği bir kopya kullanılarak oluşturulur::

source: The :mod:`zlib` extension is built using an included copy of the zlib sources if the zlib version found on the system is too old to be used for the build::
tr: :mod:`zlib` uzantısı, sistemde bulunan zlib sürümü derleme için kullanılamayacak kadar eskiyse, zlib kaynaklarının dahil edildiği bir kopya kullanılarak oluşturulur::

source: The implementation of the hash table used by the :mod:`tracemalloc` is based on the cfuhash project::
tr: :mod:`tracemalloc` tarafından kullanılan hash tablosunun uygulanması cfuhash projesine dayanmaktadır::

source: The :mod:`_decimal` module is built using an included copy of the libmpdec library unless the build is configured ``--with-system-libmpdec``::
tr: :mod:`_decimal` modülü, yapı ``--with-system-libmpdec`` şeklinde yapılandırılmadığı sürece libmpdec kitaplığının dahil edildiği bir kopya kullanılarak oluşturulur::

source: W3C C14N test suite
tr: W3C C14N test paketi

source: The C14N 2.0 test suite in the :mod:`test` package (``Lib/test/xmltestdata/c14n-20/``) was retrieved from the W3C website at https://www.w3.org/TR/xml-c14n2-testcases/ and is distributed under the 3-clause BSD license::
tr: :mod:`test` paketindeki C14N 2.0 test paketi (``Lib/test/xmltestdata/c14n-20/``), https://www.w3.org/TR/xml-c14n2-testcases/ adresindeki W3C web sitesinden alınmıştır ve 3 maddeli BSD lisansı altında dağıtılmaktadır::

source: The audioop module uses the code base in g771.c file of the SoX project::
tr: Audioop modülü, SoX projesinin g771.c dosyasındaki kod tabanını kullanır::
