Repository: python/python-docs-tr
Catalog: sphinx.po
Languages: tr

source: This Page
tr: Bu Sayfa

source: Report a Bug
tr: Hata Bildir

source: Show Source
tr: Kaynağı Göster

source: CPython implementation detail:
tr: CPython uygulama ayrıntısı:

source: Deprecated since version {deprecated}, will be removed in version {removed}
tr: Sürüm {deprecated} 'den beri kullanım dışı, sürüm {removed} 'da kaldırılacak

source: Deprecated since version {deprecated}, removed in version {removed}
tr: Sürüm {deprecated} 'den beri kullanım dışı, sürüm {removed} 'da kaldırıldı

source: in development
tr: geliştirme aşamasında

source: pre-release
tr: önsürüm

source: stable
tr: kararlı

source: security-fixes
tr: güvenlik düzeltmeleri

source: Welcome! This is the official documentation for Python %(release)s.
tr: Hoş geldin! Bu sayfada, Python %(release)s için resmi dokümantasyonu bulabilirsin.

source: Parts of the documentation:
tr: Belgelerin bölümleri:

source: What's new in Python %(version)s?
tr: Python %(version)s sürümündeki yenilikler nelerdir?

source: or <a href="%(whatsnew_index)s">all "What's new" documents</a> since 2.0
tr: veya 2.0 'dan bu yana <a href="%(whatsnew_index)s">tüm "Yenilikler" belgeleri</a>

source: Tutorial
tr: Öğretici

source: start here
tr: buradan başla

source: Library Reference
tr: Kütüphane Referansı

source: keep this under your pillow
tr: bunu yastığının altında tut

source: Language Reference
tr: Dil Referansı

source: describes syntax and language elements
tr: söz dizimi ve dil öğelerini açıklar

source: Python Setup and Usage
tr: Python Kurulumu ve Kullanımı

source: how to use Python on different platforms
tr: Python farklı platformlarda nasıl kullanılır

source: Python HOWTOs
tr: Python NASIL'ları

source: in-depth documents on specific topics
tr: spesifik konularda ayrıntılı dokümanlar

source: Installing Python Modules
tr: Python Modüllerini Yükleme

source: installing from the Python Package Index &amp; other sources
tr: Python Paket Dizini 'nden yükleme &amp; diğer kaynaklar

source: Distributing Python Modules
tr: Python Modüllerini Dağıtma

source: publishing modules for installation by others
tr: modülleri başkaları tarafından yüklenmek üzere yayımlama

source: Extending and Embedding
tr: Genişletme ve Gömme

source: tutorial for C/C++ programmers
tr: C/C++ programcıları için öğretici

source: Python/C API
tr: Python/C API (Uygulama Programlama Arayüzü)

source: reference for C/C++ programmers
tr: C/C++ programcıları için referans

source: FAQs
tr: SSS (Sıkça Sorulan Sorular)

source: frequently asked questions (with answers!)
tr: sıkça sorulan sorular (cevaplarla!)

source: Indices and tables:
tr: Endeksler ve tablolar:

source: Global Module Index
tr: Genel Modül Endeksi

source: quick access to all modules
tr: tüm modüllere çabuk erişim

source: General Index
tr: Genel Endeks

source: all functions, classes, terms
tr: tüm fonksiyonlar, sınıflar, terimler

source: Glossary
tr: Sözlük

source: the most important terms explained
tr: açıklanan en önemli terimler

source: Search page
tr: Arama sayfası

source: search this documentation
tr: bu dokümantasyonu ara

source: Complete Table of Contents
tr: Bütün İçeriklerin Tablosu

source: lists all sections and subsections
tr: tüm bölümleri ve alt bölümleri listeler

source: Meta information:
tr: Meta bilgiler:

source: Reporting bugs
tr: Hataları bildirme

source: Contributing to Docs
tr: Dokümanlara Katkıda Bulunma

source: About the documentation
tr: Dokümantasyon hakkında

source: History and License of Python
tr: Python'un tarihçesi ve Lisansı

source: Copyright
tr: Telif Hakkı

source: Download
tr: İndir

source: Download these documents
tr: Bu dokümanları indir

source: Docs by version
tr: Sürüme göre dokümanlar

source: Stable
tr: Kararlı

source: In development
tr: Geliştirme aşamasında

source: All versions
tr: Tüm sürümler

source: Other resources
tr: Diğer kaynaklar

source: PEP Index
tr: PEP (Python Geliştirme Önerileri) Endeksi

source: Beginner's Guide
tr: Başlangıç Kılavuzu

source: Book List
tr: Kitap Listesi

source: Audio/Visual Talks
tr: İşitsel/Görsel Konuşmalar

source: Python Developer’s Guide
tr: Python Geliştirici Rehberi

source: This document is for an old version of Python that is no longer supported. You should upgrade, and read the
tr: Bu belge, Python'un artık desteklenmeyen eski bir sürümü içindir. Güncellemeli, ve

source: Python documentation for the current stable release
tr: Mevcut kararlı sürüm için olan Python dokümantasyonunu okumalısın
