Repository: python/python-docs-tr
Catalog: extending/index.po
Languages: tr

source: Extending and Embedding the Python Interpreter
tr: Python Yorumlayıcısını Genişletme ve Gömme

source: This document describes how to write modules in C or C++ to extend the Python interpreter with new modules. Those modules can not only define new functions but also new object types and their methods. The document also describes how to embed the Python interpreter in another application, for use as an extension language. Finally, it shows how to compile and link extension modules so that they can be loaded dynamically (at run time) into the interpreter, if the underlying operating system supports this feature.
tr: Bu belge, Python yorumlayıcısını yeni modüllerle genişletmek için C veya C++'da modüllerin nasıl yazılacağını açıklar. Bu modüller sadece yeni fonksiyonları değil, aynı zamanda yeni nesne tiplerini ve metotlarını da tanımlayabilir. Belge ayrıca Python yorumlayıcısının bir uzantı dili olarak kullanılmak üzere başka bir uygulamaya nasıl yerleştirileceğini de açıklar. Son olarak, temeldeki işletim sistemi bu özelliği destekliyorsa, uzantı modüllerinin yorumlayıcıya dinamik olarak (çalışma zamanında) yüklenebilmesi için nasıl derleneceğini ve bağlanacağını gösterir.

source: This document assumes basic knowledge about Python. For an informal introduction to the language, see :ref:`tutorial-index`. :ref:`reference-index` gives a more formal definition of the language. :ref:`library-index` documents the existing object types, functions and modules (both built-in and written in Python) that give the language its wide application range.
tr: Bu belge, Python hakkında temel bilgiye sahip olduğunuzu varsayar. Dile gayri resmi bir giriş için bkz. :ref:`library-index`. :ref:`library-index`, dilin daha resmi bir tanımını verir. :ref:`library-index`, dile geniş uygulama yelpazesi sağlayan mevcut nesne türlerini, işlevleri ve modülleri (hem yerleşik hem de Python'da yazılmış) belgeler.

source: For a detailed description of the whole Python/C API, see the separate :ref:`c-api-index`.
tr: Tüm Python/C API'sinin ayrıntılı açıklaması için ayrı :ref:`c-api-index`'a bakın.

source: Recommended third party tools
tr: Önerilen üçüncü taraf araçları

source: This guide only covers the basic tools for creating extensions provided as part of this version of CPython. Third party tools like `Cython <https://cython.org/>`_, `cffi <https://cffi.readthedocs.io>`_, `SWIG <https://www.swig.org>`_ and `Numba <https://numba.pydata.org/>`_ offer both simpler and more sophisticated approaches to creating C and C++ extensions for Python.
tr: Bu kılavuz, yalnızca CPython'un bu sürümünün bir parçası olarak sağlanan uzantıları oluşturmak için temel araçları kapsar. `Cython <https://cython.org/>`_, `cffi <https://cffi.readthedocs.io>`_, `SWIG <https://www.swig.org>`_ ve `Numba <https://numba.pydata.org/>`_ gibi üçüncü taraf araçlar, Python için C ve C++ uzantıları oluşturmaya yönelik hem daha basit hem de daha karmaşık yaklaşımlar sunar.

source: `Python Packaging User Guide: Binary Extensions <https://packaging.python.org/guides/packaging-binary-extensions/>`_
tr: `Python Paketleme Kullanıcı Kılavuzu: İkili Uzantılar <https://packaging.python.org/guides/packaging-binary-extensions/>`_

source: The Python Packaging User Guide not only covers several available tools that simplify the creation of binary extensions, but also discusses the various reasons why creating an extension module may be desirable in the first place.
tr: Python Paketleme Kullanıcı Kılavuzu, yalnızca ikili uzantıların oluşturulmasını basitleştiren çeşitli mevcut araçları kapsamakla kalmaz, aynı zamanda bir uzantı modülü oluşturmanın en başta neden istenebileceğinin çeşitli nedenlerini de tartışır.

source: Creating extensions without third party tools
tr: Üçüncü taraf araçları olmadan uzantılar oluşturma

source: This section of the guide covers creating C and C++ extensions without assistance from third party tools. It is intended primarily for creators of those tools, rather than being a recommended way to create your own C extensions.
tr: Kılavuzun bu bölümü, üçüncü taraf araçlardan yardım almadan C ve C++ uzantıları oluşturmayı kapsar. Kendi C uzantılarınızı oluşturmanız için önerilen bir yol olmaktan ziyade, öncelikle bu araçların yaratıcılarına yöneliktir.

source: Embedding the CPython runtime in a larger application
tr: CPython çalışma zamanını daha büyük bir uygulamaya gömme

source: Sometimes, rather than creating an extension that runs inside the Python interpreter as the main application, it is desirable to instead embed the CPython runtime inside a larger application. This section covers some of the details involved in doing that successfully.
tr: Bazen, ana uygulama olarak Python yorumlayıcısının içinde çalışan bir uzantı oluşturmak yerine, bunun yerine CPython çalışma zamanını daha büyük bir uygulamanın içine gömmek tercih edilir. Bu bölüm, bunu başarılı bir şekilde yapmakla ilgili bazı ayrıntıları içerir.
