Repository: python/python-docs-tr
Catalog: library/exceptions.po
Languages: tr

source: For exceptions that involve a file system path (such as :func:`open` or :func:`os.unlink`), :attr:`filename` is the file name passed to the function. For functions that involve two file system paths (such as :func:`os.rename`), :attr:`filename2` corresponds to the second file name passed to the function.
tr: Bir dosya sistemi yolu içeren istisnalar için (örneğin :func:`open` veya :func:`os.unlink`), :attr:`filename` fonksiyona aktarılan dosya adıdır. İki dosya sistemi yolu içeren fonksiyonlar için (:func:`os.rename` gibi), :attr:`filename2` fonksiyona aktarılan ikinci dosya adına karşılık gelir.

source: :exc:`EnvironmentError`, :exc:`IOError`, :exc:`WindowsError`, :exc:`socket.error`, :exc:`select.error` and :exc:`mmap.error` have been merged into :exc:`OSError`, and the constructor may return a subclass.
tr: :exc:`EnvironmentError`, :exc:`IOError`, :exc:`WindowsError`, :exc:`socket.error`, :exc:`select.error` ve :exc:`mmap.error`, :exc:`OSError` ile birleştirilmiştir ve kurucu bir alt sınıf döndürebilir.

source: The :attr:`filename` attribute is now the original file name passed to the function, instead of the name encoded to or decoded from the :term:`filesystem encoding and error handler`. Also, the *filename2* constructor argument and attribute was added.
tr: :attr:`filename` özniteliği artık :term:`filesystem encoding and error handler` ile kodlanan veya kodu çözülen ad yerine işleve aktarılan orijinal dosya adıdır. Ayrıca, *filename2* kurucu argümanı ve niteliği eklenmiştir.

source: Raised when the result of an arithmetic operation is too large to be represented. This cannot occur for integers (which would rather raise :exc:`MemoryError` than give up). However, for historical reasons, OverflowError is sometimes raised for integers that are outside a required range. Because of the lack of standardization of floating point exception handling in C, most floating point operations are not checked.
tr: Bir aritmetik işlemin sonucu gösterilemeyecek kadar büyük olduğunda ortaya çıkar. Bu durum tamsayılar için oluşmaz (tamsayılar vazgeçmektense :exc:`MemoryError` yükseltmeyi tercih ederler). Bununla birlikte, tarihsel nedenlerden dolayı, OverflowError bazen gerekli bir aralığın dışında kalan tamsayılar için yükseltilir. C'de kayan nokta istisna işlemlerinin(floating point exception handling) standartlaştırılmaması nedeniyle, çoğu kayan nokta işlemi kontrol edilmez.

source: This exception is derived from :exc:`RuntimeError`. It is raised when the interpreter detects that the maximum recursion depth (see :func:`sys.getrecursionlimit`) is exceeded.
tr: Bu istisna :exc:`RuntimeError` öğesinden türetilmiştir. Yorumlayıcı maksimum özyineleme derinliğinin(recursion depth) (bkz. :func:`sys.getrecursionlimit`) aşıldığını tespit ettiğinde ortaya çıkar.

source: Previously, a plain :exc:`RuntimeError` was raised.
tr: Önceden, düz bir :exc:`RuntimeError` oluşturulurdu.

source: This exception is raised when a weak reference proxy, created by the :func:`weakref.proxy` function, is used to access an attribute of the referent after it has been garbage collected. For more information on weak references, see the :mod:`weakref` module.
tr: Bu istisna, :func:`weakref.proxy` fonksiyonu tarafından oluşturulan bir zayıf referans proxy'si(weak reference proxy), çöp toplandıktan(garbage collect) sonra referansın bir niteliğine erişmek için kullanıldığında ortaya çıkar. Zayıf referanslar hakkında daha fazla bilgi için :mod:`weakref` modülüne bakın.

source: Raised when an error is detected that doesn't fall in any of the other categories. The associated value is a string indicating what precisely went wrong.
tr: Diğer kategorilerden herhangi birine girmeyen bir hata tespit edildiğinde oluşturulur. İlişkili değer, tam olarak neyin yanlış gittiğini gösteren bir dizedir.

source: Raised by built-in function :func:`next` and an :term:`iterator`\'s :meth:`~iterator.__next__` method to signal that there are no further items produced by the iterator.
tr: Yerleşik işlev :func:`next` ve bir :term:`iterator` ün :meth:`~iterator.__next__` yöntemi tarafından yineleyici tarafından üretilen başka öğe olmadığını bildirmek için yükseltilir.

source: The exception object has a single attribute :attr:`!value`, which is given as an argument when constructing the exception, and defaults to :const:`None`.
tr: İstisna nesnesinin tek bir :attr:`!value` özelliği vardır; bu özellik istisna oluşturulurken argüman olarak verilir ve varsayılan olarak :const:`None` değerini alır.

source: When a :term:`generator` or :term:`coroutine` function returns, a new :exc:`StopIteration` instance is raised, and the value returned by the function is used as the :attr:`value` parameter to the constructor of the exception.
tr: Bir :term:`generator` veya :term:`coroutine` fonksiyonu döndüğünde, yeni bir :exc:`StopIteration` örneği oluşturulur ve fonksiyon tarafından döndürülen değer, istisnanın yapıcısı için :attr:`value` parametresi olarak kullanılır.

source: If a generator code directly or indirectly raises :exc:`StopIteration`, it is converted into a :exc:`RuntimeError` (retaining the :exc:`StopIteration` as the new exception's cause).
tr: Bir generator(işleyici) kodu doğrudan veya dolaylı olarak :exc:`StopIteration` değerini oluşturunca, :exc:`RuntimeError` değerine dönüştürülür (yeni istisnanın nedeni olarak :exc:`StopIteration` değeri korunur).

source: Added ``value`` attribute and the ability for generator functions to use it to return a value.
tr: ``value`` niteliği ve generator işlevlerin bir değer döndürmek için bunu kullanabilmesi özelliği eklendi.

source: Introduced the RuntimeError transformation via ``from __future__ import generator_stop``, see :pep:`479`.
tr: RuntimeError dönüşümü ``from __future__ import generator_stop`` aracılığıyla tanıtıldı, bkz :pep:`479`.

source: Enable :pep:`479` for all code by default: a :exc:`StopIteration` error raised in a generator is transformed into a :exc:`RuntimeError`.
tr: Varsayılan olarak tüm kodlar için :pep:`479` özelliğini etkinleştirin: bir generator'da ortaya çıkan :exc:`StopIteration` hatası bir :exc:`RuntimeError` hatasına dönüştürülür.

source: Must be raised by :meth:`~object.__anext__` method of an :term:`asynchronous iterator` object to stop the iteration.
tr: Yinelemeyi durdurmak için bir :term:`asynchronous iterator` nesnesinin :meth:`~object.__anext__` yöntemi tarafından oluşturulmalıdır.

source: Raised when the parser encounters a syntax error. This may occur in an :keyword:`import` statement, in a call to the built-in functions :func:`compile`, :func:`exec`, or :func:`eval`, or when reading the initial script or standard input (also interactively).
tr: Ayrıştırıcı bir sözdizimi hatasıyla karşılaştığında ortaya çıkar. Bu, bir :keyword:`import` deyiminde, yerleşik :func:`compile`, :func:`exec` veya :func:`eval` işlevlerine yapılan bir çağrıda veya ilk kod veya standart girdi okunurken (etkileşimli olarak da) meydana gelebilir.

source: The :func:`str` of the exception instance returns only the error message. Details is a tuple whose members are also available as separate attributes.
tr: İstisna örneğinin :func:`str` öğesi yalnızca hata mesajını döndürür. Details, üyeleri ayrı nitelikler olarak da kullanılabilen bir tuple'dır.

source: The name of the file the syntax error occurred in.
tr: Sözdizimi hatasının oluştuğu dosyanın adı.

source: Which line number in the file the error occurred in. This is 1-indexed: the first line in the file has a ``lineno`` of 1.
tr: Hatanın dosyadaki hangi satır numarasında meydana geldiği. Bu 1 indekslidir: dosyadaki ilk satırın ``lineno`` değeri 1'dir.

source: The column in the line where the error occurred. This is 1-indexed: the first character in the line has an ``offset`` of 1.
tr: Hatanın meydana geldiği satırdaki sütun. Bu 1 indekslidir: satırdaki ilk karakter 1 ``offset`` değerine sahiptir.

source: The source code text involved in the error.
tr: Hataya dahil olan kaynak kod metni.

source: Which line number in the file the error occurred ends in. This is 1-indexed: the first line in the file has a ``lineno`` of 1.
tr: Hatanın meydana geldiği dosyadaki satır numarası. Bu, 1 indekslidir: Dosyanın ilk satırının lineno değeri 1'dir.

source: The column in the end line where the error occurred finishes. This is 1-indexed: the first character in the line has an ``offset`` of 1.
tr: Hatanın meydana geldiği son satırdaki sütun numarası. Bu, 1 indekslidir: Satırdaki ilk karakterin offset değeri 1'dir.

source: For errors in f-string fields, the message is prefixed by "f-string: " and the offsets are offsets in a text constructed from the replacement expression. For example, compiling f'Bad {a b} field' results in this args attribute: ('f-string: ...', ('', 1, 2, '(a b)\n', 1, 5)).
tr: f-string alanlarındaki hatalar için mesajın önüne "f-string: " ile başlar ve ofsetler, değiştirme ifadesinden oluşturulan bir metindeki ofsetlerdir. Örneğin, f'Bad {a b} field' derlendiğinde şu args özniteliği elde edilir: ('f-string: ...', ('', 1, 2, '(a b)\n', 1, 5)).

source: Added the :attr:`end_lineno` and :attr:`end_offset` attributes.
tr: :attr:`end_lineno` ve :attr:`end_offset` nitelikleri eklendi.

source: Base class for syntax errors related to incorrect indentation. This is a subclass of :exc:`SyntaxError`.
tr: Yanlış girintileme ile ilgili sözdizimi hataları için temel sınıf. Bu, :exc:`SyntaxError` alt sınıfıdır.

source: Raised when indentation contains an inconsistent use of tabs and spaces. This is a subclass of :exc:`IndentationError`.
tr: Girintileme tutarsız sekme ve boşluk kullanımı içerdiğinde ortaya çıkar. Bu, :exc:`IndentationError` öğesinin bir alt sınıfıdır.

source: Raised when the interpreter finds an internal error, but the situation does not look so serious to cause it to abandon all hope. The associated value is a string indicating what went wrong (in low-level terms).
tr: Yorumlayıcı dahili bir hata bulduğunda, ancak durum tüm umutlarını yitirmesine neden olacak kadar ciddi görünmediğinde yükseltilir. İlişkili değer, neyin yanlış gittiğini gösteren bir dizedir (düşük seviye terimlerle).

source: You should report this to the author or maintainer of your Python interpreter. Be sure to report the version of the Python interpreter (``sys.version``; it is also printed at the start of an interactive Python session), the exact error message (the exception's associated value) and if possible the source of the program that triggered the error.
tr: Bunu Python yorumlayıcınızın yazarına veya geliştiricisine bildirmelisiniz. Python yorumlayıcısının sürümünü (``sys.version``; etkileşimli bir Python oturumunun başlangıcında da yazdırılır), tam hata mesajını (istisnanın ilişkili değeri) ve mümkünse hatayı tetikleyen programın kaynağını bildirdiğinizden emin olun.

source: This exception is raised by the :func:`sys.exit` function. It inherits from :exc:`BaseException` instead of :exc:`Exception` so that it is not accidentally caught by code that catches :exc:`Exception`. This allows the exception to properly propagate up and cause the interpreter to exit. When it is not handled, the Python interpreter exits; no stack traceback is printed. The constructor accepts the same optional argument passed to :func:`sys.exit`. If the value is an integer, it specifies the system exit status (passed to C's :c:func:`exit` function); if it is ``None``, the exit status is zero; if it has another type (such as a string), the object's value is printed and the exit status is one.
tr: Bu istisna :func:`sys.exit` işlevi tarafından ortaya çıkartılır. Yanlışlıkla :exc:`Exception` kodunu yakalayan kod tarafından yakalanmaması için :exc:`Exception` yerine :exc:`BaseException` kodundan miras alır. Bu, istisnanın düzgün bir şekilde yayılmasını ve yorumlayıcının çıkmasına neden olmasını sağlar. İşlenmediğinde, Python yorumlayıcısı çıkar; herhangi bir yığın geri dönüşü yazdırılmaz. Kurucu, :func:`sys.exit` öğesine aktarılan isteğe bağlı argümanın aynısını kabul eder. Değer bir tamsayı ise, sistem çıkış durumunu belirtir (C'nin :c:func:`exit` fonksiyonuna aktarılır); ``None`` ise, çıkış durumu sıfırdır; başka bir türe sahipse (string gibi), nesnenin değeri yazdırılır ve çıkış durumu birdir.

source: A call to :func:`sys.exit` is translated into an exception so that clean-up handlers (:keyword:`finally` clauses of :keyword:`try` statements) can be executed, and so that a debugger can execute a script without running the risk of losing control. The :func:`os._exit` function can be used if it is absolutely positively necessary to exit immediately (for example, in the child process after a call to :func:`os.fork`).
tr: Bir :func:`sys.exit` çağrısı bir istisnaya çevrilir, böylece temizleme işleyicileri(clean-up handlers) (:keyword:`try` deyimlerinin :keyword:`finally` cümleleri) çalıştırılabilir ve böylece bir hata ayıklayıcı kontrolü kaybetme riski olmadan bir betiği çalıştırabilir. Hemen çıkmak kesinlikle gerekliyse :func:`os._exit` fonksiyonu kullanılabilir (örneğin, :func:`os.fork` çağrısından sonra alt süreçte).

source: The exit status or error message that is passed to the constructor. (Defaults to ``None``.)
tr: Yapıcıya aktarılan çıkış durumu veya hata mesajı. (Varsayılan değer ``None``.)

source: Raised when an operation or function is applied to an object of inappropriate type. The associated value is a string giving details about the type mismatch.
tr: Bir işlem veya fonksiyon uygun olmayan türdeki bir nesneye uygulandığında oluşur. İlişkili değer, tür uyuşmazlığı hakkında ayrıntılar veren bir dizedir.

source: This exception may be raised by user code to indicate that an attempted operation on an object is not supported, and is not meant to be. If an object is meant to support a given operation but has not yet provided an implementation, :exc:`NotImplementedError` is the proper exception to raise.
tr: Bu istisna, bir nesne üzerinde denenen bir işlemin desteklenmediğini ve desteklenmesinin amaçlanmadığını belirtmek için kullanıcı kodu tarafından oluşur. Bir nesnenin belirli bir işlemi desteklemesi gerekiyorsa ancak henüz bir uygulama sağlamamışsa, :exc:`NotImplementedError` oluşması gereken uygun istisnadır.

source: Passing arguments of the wrong type (e.g. passing a :class:`list` when an :class:`int` is expected) should result in a :exc:`TypeError`, but passing arguments with the wrong value (e.g. a number outside expected boundaries) should result in a :exc:`ValueError`.
tr: Yanlış türde argümanlar geçirmek (örneğin bir :class:`int` beklenirken bir :class:`list` geçirmek) bir :exc:`TypeError` ile sonuçlanmalıdır, ancak yanlış değere sahip argümanlar geçirmek (örneğin beklenen sınırların dışında bir sayı) bir :exc:`ValueError` ile sonuçlanmalıdır.

source: Raised when a reference is made to a local variable in a function or method, but no value has been bound to that variable. This is a subclass of :exc:`NameError`.
tr: Bir işlev veya yöntemde yerel(local) bir değişkene referans yapıldığında, ancak bu değişkene herhangi bir değer bağlanmadığında ortaya çıkar. Bu, :exc:`NameError` alt sınıfıdır.

source: Raised when a Unicode-related encoding or decoding error occurs. It is a subclass of :exc:`ValueError`.
tr: Unicode ile ilgili bir kodlama veya kod çözme hatası oluştuğunda ortaya çıkar. Bu, :exc:`ValueError` alt sınıfıdır.

source: :exc:`UnicodeError` has attributes that describe the encoding or decoding error. For example, ``err.object[err.start:err.end]`` gives the particular invalid input that the codec failed on.
tr: :exc:`UnicodeError` kodlama(encoding) veya kod çözme(decoding) hatasını tanımlayan özniteliklere sahiptir. Örneğin, ``err.object[err.start:err.end]`` codec'in başarısız olduğu belirli geçersiz girdiyi verir.

source: The name of the encoding that raised the error.
tr: Hataya neden olan kodlamanın adı.

source: A string describing the specific codec error.
tr: Belirli kodek hatasını açıklayan bir dize.

source: The object the codec was attempting to encode or decode.
tr: Kodek'in kodlamaya veya kodunu çözmeye çalıştığı nesne.

source: The first index of invalid data in :attr:`object`.
tr: :attr:`object` içindeki geçersiz verilerin ilk indeksi.

source: The index after the last invalid data in :attr:`object`.
tr: :attr:`object` içindeki son geçersiz veriden sonraki dizin.

source: Raised when a Unicode-related error occurs during encoding. It is a subclass of :exc:`UnicodeError`.
tr: Kodlama sırasında Unicode ile ilgili bir hata oluştuğunda ortaya çıkar. Bu :exc:`UnicodeError` alt sınıfıdır.

source: Raised when a Unicode-related error occurs during decoding. It is a subclass of :exc:`UnicodeError`.
tr: Kod çözme sırasında Unicode ile ilgili bir hata oluştuğunda ortaya çıkar. Bu :exc:`UnicodeError` alt sınıfıdır.

source: Raised when a Unicode-related error occurs during translating. It is a subclass of :exc:`UnicodeError`.
tr: Çeviri sırasında Unicode ile ilgili bir hata oluştuğunda ortaya çıkar. Bu :exc:`UnicodeError` alt sınıfıdır.

source: Raised when an operation or function receives an argument that has the right type but an inappropriate value, and the situation is not described by a more precise exception such as :exc:`IndexError`.
tr: Bir işlem veya fonksiyon doğru türde ancak uygun olmayan bir değere sahip bir argüman aldığında ve durum :exc:`IndexError` gibi daha kesin bir istisna ile tanımlanmadığında ortaya çıkar.

source: Raised when the second argument of a division or modulo operation is zero. The associated value is a string indicating the type of the operands and the operation.
tr: Bir bölme veya modulo işleminin ikinci bağımsız değişkeni sıfır olduğunda ortaya çıkar. İlişkili değer, işlenenlerin ve işlemin türünü belirten bir dizedir.

source: The following exceptions are kept for compatibility with previous versions; starting from Python 3.3, they are aliases of :exc:`OSError`.
tr: Aşağıdaki istisnalar önceki sürümlerle uyumluluk için tutulur; Python 3.3'ten başlayarak, :exc:`OSError` takma adlarıdır.

source: Only available on Windows.
tr: Yalnızca Windows'ta kullanılabilir.

source: OS exceptions
tr: İşletim sistemi istisnaları(ES exceptions)

source: The following exceptions are subclasses of :exc:`OSError`, they get raised depending on the system error code.
tr: Aşağıdaki istisnalar :exc:`OSError` alt sınıflarıdır, sistem hata koduna bağlı olarak ortaya çıkarlar.

source: Raised when an operation would block on an object (e.g. socket) set for non-blocking operation. Corresponds to :c:data:`errno` :py:const:`~errno.EAGAIN`, :py:const:`~errno.EALREADY`, :py:const:`~errno.EWOULDBLOCK` and :py:const:`~errno.EINPROGRESS`.
tr: Bir işlem, bloklanmayan işlem(non-blocking operation) için ayarlanmış bir nesne (örn. soket) üzerinde bloklandığında ortaya çıkar. :c:data:`errno` :py:const:`~errno.EAGAIN`, :py:const:`~errno.EALREADY`, :py:const:`~errno.EWOULDBLOCK` ve :py:const:`~errno.EINPROGRESS` değerlerine karşılık gelir.

source: In addition to those of :exc:`OSError`, :exc:`BlockingIOError` can have one more attribute:
tr: :exc:`OSError` özelliğine ek olarak, :exc:`BlockingIOError` bir özelliğe daha sahip olabilir:

source: An integer containing the number of characters written to the stream before it blocked. This attribute is available when using the buffered I/O classes from the :mod:`io` module.
tr: "Bu öznitelik, :mod:`io` modülünden gelen arabellekli I/O sınıflarını kullanırken, akışa yazılmadan önce engellendiğinde yazılan karakterlerin sayısını içeren bir tamsayı içerir."

source: Raised when an operation on a child process failed. Corresponds to :c:data:`errno` :py:const:`~errno.ECHILD`.
tr: Bir alt süreç(child process) üzerindeki bir işlem başarısız olduğunda yükseltilir. Karşılığı :c:data:`errno` :py:const:`~errno.ECHILD`.

source: A base class for connection-related issues.
tr: Bağlantı ile ilgili konular için bir temel sınıf.

source: Subclasses are :exc:`BrokenPipeError`, :exc:`ConnectionAbortedError`, :exc:`ConnectionRefusedError` and :exc:`ConnectionResetError`.
tr: Alt sınıflar :exc:`BrokenPipeError`, :exc:`ConnectionAbortedError`, :exc:`ConnectionRefusedError` ve :exc:`ConnectionResetError`.

source: A subclass of :exc:`ConnectionError`, raised when trying to write on a pipe while the other end has been closed, or trying to write on a socket which has been shutdown for writing. Corresponds to :c:data:`errno` :py:const:`~errno.EPIPE` and :py:const:`~errno.ESHUTDOWN`.
tr: :exc:`ConnectionError` alt sınıfı, diğer ucu kapatılmış bir pipe'ın üzerine yazmaya çalışıldığında veya yazmaya kapatılmış bir soket üzerine yazmaya çalışıldığında ortaya çıkar. :c:data:`errno` :py:const:`~errno.EPIPE` ve :py:const:`~errno.ESHUTDOWN` değerlerine karşılık gelir.

source: A subclass of :exc:`ConnectionError`, raised when a connection attempt is aborted by the peer. Corresponds to :c:data:`errno` :py:const:`~errno.ECONNABORTED`.
tr: Bir bağlantı girişimi eş(peer) tarafından iptal edildiğinde ortaya çıkan :exc:`ConnectionError` alt sınıfı. Karşılığı :c:data:`errno` :py:const:`~errno.ECONNABORTED`.

source: A subclass of :exc:`ConnectionError`, raised when a connection attempt is refused by the peer. Corresponds to :c:data:`errno` :py:const:`~errno.ECONNREFUSED`.
tr: Bir bağlantı girişimi eş(peer) tarafından reddedildiğinde ortaya çıkan :exc:`ConnectionError` alt sınıfı. Karşılığı :c:data:`errno` :py:const:`~errno.ECONNREFUSED`.

source: A subclass of :exc:`ConnectionError`, raised when a connection is reset by the peer. Corresponds to :c:data:`errno` :py:const:`~errno.ECONNRESET`.
tr: Bir bağlantı eş(peer) tarafından sıfırlandığında ortaya çıkan :exc:`ConnectionError` alt sınıfı. Karşılığı :c:data:`errno` :py:const:`~errno.ECONNRESET`.

source: Raised when trying to create a file or directory which already exists. Corresponds to :c:data:`errno` :py:const:`~errno.EEXIST`.
tr: Zaten var olan bir dosya veya dizin oluşturulmaya çalışıldığında ortaya çıkar. Karşılığı :c:data:`errno` :py:const:`~errno.EEXIST`.

source: Raised when a file or directory is requested but doesn't exist. Corresponds to :c:data:`errno` :py:const:`~errno.ENOENT`.
tr: Bir dosya veya dizin isteğinde(request) ancak mevcut olmadığında ortaya çıakr. Karşılığı :c:data:`errno` :py:const:`~errno.ENOENT`.

source: Raised when a system call is interrupted by an incoming signal. Corresponds to :c:data:`errno` :py:const:`~errno.EINTR`.
tr: Bir sistem çağrısı gelen bir sinyal tarafından kesintiye uğradığında ortaya çıkar. Karşılığı :c:data:`errno` :py:const:`~errno.EINTR`.

source: Python now retries system calls when a syscall is interrupted by a signal, except if the signal handler raises an exception (see :pep:`475` for the rationale), instead of raising :exc:`InterruptedError`.
tr: Python, bir sistem çağrısı bir sinyal tarafından kesildiğinde, artık sinyal işleyicisi bir istisna yükseltmediği sürece (:pep:`475` için gerekçeye bakın), :exc:`InterruptedError` istisnası yükseltmek yerine sistem çağrılarını tekrar deniyor.

source: Raised when a file operation (such as :func:`os.remove`) is requested on a directory. Corresponds to :c:data:`errno` :py:const:`~errno.EISDIR`.
tr: Bir dizin üzerinde bir dosya işlemi (örneğin :func:`os.remove`) istendiğinde ortaya çıkar. Karşılığı :c:data:`errno` :py:const:`~errno.EISDIR`.

source: Raised when a directory operation (such as :func:`os.listdir`) is requested on something which is not a directory. On most POSIX platforms, it may also be raised if an operation attempts to open or traverse a non-directory file as if it were a directory. Corresponds to :c:data:`errno` :py:const:`~errno.ENOTDIR`.
tr: Dizin olmayan bir şey üzerinde bir dizin işlemi (örneğin :func:`os.listdir`) istendiğinde ortaya çıakr. Çoğu POSIX platformunda, bir işlem dizin olmayan bir dosyayı bir dizinmiş gibi açmaya veya geçmeye çalışırsa da ortaya çıkabilir. Karşılığı :c:data:`errno` :py:const:`~errno.ENOTDIR`.
