Repository: python/python-docs-tr
Catalog: library/exceptions.po
Languages: tr

source: Built-in Exceptions
tr: Gömülü İstisnalar

source: In Python, all exceptions must be instances of a class that derives from :class:`BaseException`. In a :keyword:`try` statement with an :keyword:`except` clause that mentions a particular class, that clause also handles any exception classes derived from that class (but not exception classes from which *it* is derived). Two exception classes that are not related via subclassing are never equivalent, even if they have the same name.
tr: Python'da tüm istisnalar(exceptions) :class:`BaseException` sınıfından türeyen bir sınıfın örnekleri olmalıdır. Belirli bir sınıftan bahseden :keyword:`except` cümlesine sahip bir :keyword:`try` deyiminde, bu cümle aynı zamanda o sınıftan türetilen istisna sınıflarını da ele alır (ancak *onun* türetildiği istisna sınıflarını değil). Alt sınıflandırma yoluyla ilişkili olmayan iki istisna sınıfı, aynı ada sahip olsalar bile asla eşdeğer değildir.

source: User code can raise built-in exceptions. This can be used to test an exception handler or to report an error condition "just like" the situation in which the interpreter raises the same exception; but beware that there is nothing to prevent user code from raising an inappropriate error.
tr: Kullanıcı kodu gömülü istisnaları oluşturabilir. Bu, bir istisna işleyicileri test etmek veya yorumlayıcının aynı istisnayı ortaya çıkardığı duruma "benzer" bir hata durumunu bildirmek için kullanılabilir; ancak kullanıcı kodunun uygun olmayan bir hata oluşturmasını engelleyecek hiçbir şey olmadığına dikkat edin.

source: The built-in exception classes can be subclassed to define new exceptions; programmers are encouraged to derive new exceptions from the :exc:`Exception` class or one of its subclasses, and not from :exc:`BaseException`. More information on defining exceptions is available in the Python Tutorial under :ref:`tut-userexceptions`.
tr: Gömülü istisna sınıfları yeni istisnalar tanımlamak için alt sınıflara ayrılabilir; programcıların yeni istisnaları :exc:`BaseException` sınıfından değil, :exc:`Exception` sınıfından veya onun alt sınıflarından birinden türetmeleri önerilir. İstisnaların tanımlanmasıyla ilgili daha fazla bilgi Python Öğreticisi'nde :ref:`tut-userexceptions` başlığı altında mevcuttur.

source: Exception context
tr: İstisna bağlamı

source: Three attributes on exception objects provide information about the context in which the exception was raised:
tr: İstisna nesnelerindeki üç öznitelik, istisnanın ortaya çıktığı bağlam hakkında bilgi sağlar:

source: When raising a new exception while another exception is already being handled, the new exception's :attr:`!__context__` attribute is automatically set to the handled exception. An exception may be handled when an :keyword:`except` or :keyword:`finally` clause, or a :keyword:`with` statement, is used.
tr: Başka bir istisna zaten işlenirken yeni bir istisna yükseltirken, yeni istisnanın :attr:`!__context__` niteliği otomatik olarak işlenen istisnaya ayarlanır. Bir :keyword:`except` veya :keyword:`finally` cümlesi veya bir :keyword:`with` deyimi kullanıldığında bir istisna ele alınabilir.

source: This implicit exception context can be supplemented with an explicit cause by using :keyword:`!from` with :keyword:`raise`::
tr: Bu örtük istisna bağlamı(implicit exception context), :keyword:`!from` ile :keyword:`raise`: kullanılarak açık bir neden ile desteklenebilir:

source: The expression following :keyword:`from<raise>` must be an exception or ``None``. It will be set as :attr:`!__cause__` on the raised exception. Setting :attr:`!__cause__` also implicitly sets the :attr:`!__suppress_context__` attribute to ``True``, so that using ``raise new_exc from None`` effectively replaces the old exception with the new one for display purposes (e.g. converting :exc:`KeyError` to :exc:`AttributeError`), while leaving the old exception available in :attr:`!__context__` for introspection when debugging.
tr: Bu :keyword:`from<raise>` ifadesini takip eden ifade bir istisna veya ``None`` olmalıdır. Ortaya çıkan istisna üzerinde :attr:`!__cause__` olarak ayarlanacaktır. :attr:`!__cause__` ayarı aynı zamanda :attr:`!__suppress_context__` niteliğini de örtük(implicit) olarak ``True`` olarak ayarlar, böylece ``raise new_exc from None`` kullanımı görüntüleme amacıyla eski istisnayı yenisiyle değiştirirken (örneğin :exc:`KeyError` ifadesini :exc:`AttributeError` ifadesine dönüştürmek), hata ayıklama sırasında iç gözlem için eski istisnayı :attr:`!__context__` içinde kullanılabilir bırakır.

source: The default traceback display code shows these chained exceptions in addition to the traceback for the exception itself. An explicitly chained exception in :attr:`!__cause__` is always shown when present. An implicitly chained exception in :attr:`!__context__` is shown only if :attr:`!__cause__` is :const:`None` and :attr:`!__suppress_context__` is false.
tr: Varsayılan geri izleme görüntüleme kodu(default traceback display code), istisnanın geri izlemesine ek olarak bu zincirleme istisnaları da gösterir. :attr:`!__cause__` içinde açıkça zincirlenmiş bir istisna mevcut olduğunda her zaman gösterilir. :attr:`!__context__` içindeki dolaylı zincirleme istisna yalnızca :attr:`!__cause__` :const:`None` ve :attr:`!__suppress_context__` false ise gösterilir.

source: In either case, the exception itself is always shown after any chained exceptions so that the final line of the traceback always shows the last exception that was raised.
tr: Her iki durumda da, istisnanın kendisi her zaman zincirleme istisnalardan sonra gösterilir, böylece geri izlemenin(traceback) son satırı her zaman oluşturulan son istisnayı gösterir.

source: Inheriting from built-in exceptions
tr: Gömülü istisnalardan miras alma

source: User code can create subclasses that inherit from an exception type. It's recommended to only subclass one exception type at a time to avoid any possible conflicts between how the bases handle the ``args`` attribute, as well as due to possible memory layout incompatibilities.
tr: Kullanıcı kodu, bir istisna türünden miras alan alt sınıflar oluşturabilir. Tabanların ``args`` niteliğini işleme biçimleri arasındaki olası çakışmaların yanı sıra olası bellek düzeni uyumsuzluklarından kaçınmak için bir seferde yalnızca bir istisna türünün alt sınıfının oluşturulması önerilir.

source: Most built-in exceptions are implemented in C for efficiency, see: :source:`Objects/exceptions.c`. Some have custom memory layouts which makes it impossible to create a subclass that inherits from multiple exception types. The memory layout of a type is an implementation detail and might change between Python versions, leading to new conflicts in the future. Therefore, it's recommended to avoid subclassing multiple exception types altogether.
tr: Çoğu gömülü istisna, verimlilik için C dilinde uygulanmıştır, bkz: :source:`Objects/exceptions.c`. Bazılarının özel bellek düzenleri vardır, bu da birden fazla istisna türünden miras alan bir alt sınıf oluşturmayı imkansız kılar. Bir türün bellek düzeni bir uygulama detayıdır ve Python sürümleri arasında değişebilir, bu da gelecekte yeni çakışmalara yol açabilir. Bu nedenle, birden fazla istisna türünün alt sınıfını oluşturmaktan tamamen kaçınmanız önerilir.

source: Base classes
tr: Temel sınıflar

source: The following exceptions are used mostly as base classes for other exceptions.
tr: Aşağıdaki istisnalar çoğunlukla diğer istisnalar için temel sınıflar olarak kullanılır.

source: The base class for all built-in exceptions. It is not meant to be directly inherited by user-defined classes (for that, use :exc:`Exception`). If :func:`str` is called on an instance of this class, the representation of the argument(s) to the instance are returned, or the empty string when there were no arguments.
tr: Tüm gömülü istisnalar için temel sınıf. Kullanıcı tanımlı sınıflar tarafından doğrudan miras alınması amaçlanmamıştır (bunun için :exc:`Exception` kullanın). Bu sınıfın bir örneği üzerinde :func:`str` çağrılırsa, örneğin argüman(lar)ının gösterimi veya argüman yoksa boş dize döndürülür.

source: The tuple of arguments given to the exception constructor. Some built-in exceptions (like :exc:`OSError`) expect a certain number of arguments and assign a special meaning to the elements of this tuple, while others are usually called only with a single string giving an error message.
tr: İstisna kurucusuna verilen argümanlar demeti. Bazı gömülü istisnalar (:exc:`OSError` gibi) belirli sayıda argüman bekler ve bu ikilinin elemanlarına özel bir anlam atarken, diğerleri genellikle yalnızca bir hata mesajı veren tek bir dizeyle çağrılır.

source: This method sets *tb* as the new traceback for the exception and returns the exception object. It was more commonly used before the exception chaining features of :pep:`3134` became available. The following example shows how we can convert an instance of ``SomeException`` into an instance of ``OtherException`` while preserving the traceback. Once raised, the current frame is pushed onto the traceback of the ``OtherException``, as would have happened to the traceback of the original ``SomeException`` had we allowed it to propagate to the caller. ::
tr: Bu yöntem *tb* öğesini istisna için yeni geri izleme olarak ayarlar ve istisna nesnesini döndürür. Daha çok :pep:`3134` istisna zincirleme özellikleri kullanıma sunulmadan önce kullanılıyordu. Aşağıdaki örnek, bir ``SomeException`` örneğini geri izlemeyi koruyarak nasıl bir ``OtherException`` örneğine dönüştürebileceğimizi göstermektedir. Bir kez oluşturulduğunda, geçerli kare, orijinal ``SomeException`` ın geri izlemesinde olduğu gibi, ``OtherException`` ın geri izlemesine itilir, eğer arayan kişiye yayılmasına izin verseydik:

source: A writable field that holds the :ref:`traceback object <traceback-objects>` associated with this exception. See also: :ref:`raise`.
tr: Bu istisna ile ilişkili :ref:`traceback nesnesini <traceback-objects>` tutan yazılabilir bir alan. Ayrıca bakınız: :ref:`raise`.

source: Add the string ``note`` to the exception's notes which appear in the standard traceback after the exception string. A :exc:`TypeError` is raised if ``note`` is not a string.
tr: İstisna dizesinden sonra standart geri dönüşte görünen istisna notlarına ``note`` dizesini ekleyin. Eğer ``note`` bir string değilse bir :exc:`TypeError` oluşur.

source: A list of the notes of this exception, which were added with :meth:`add_note`. This attribute is created when :meth:`add_note` is called.
tr: Bu istisnanın :meth:`add_note` ile eklenen notlarının bir listesi. Bu nitelik :meth:`add_note` çağrıldığında oluşturulur.

source: All built-in, non-system-exiting exceptions are derived from this class. All user-defined exceptions should also be derived from this class.
tr: Tüm gömülü, sistemden çıkmayan istisnalar(non-system-exiting exceptions) bu sınıftan türetilir. Kullanıcı tanımlı tüm istisnalar da bu sınıftan türetilmelidir.

source: The base class for those built-in exceptions that are raised for various arithmetic errors: :exc:`OverflowError`, :exc:`ZeroDivisionError`, :exc:`FloatingPointError`.
tr: Çeşitli aritmetik hatalar için oluşturulan gömülü istisnalar için temel sınıf: :exc:`OverflowError`, :exc:`ZeroDivisionError`, :exc:`FloatingPointError`.

source: Raised when a :ref:`buffer <bufferobjects>` related operation cannot be performed.
tr: Bu :ref:`buffer <bufferobjects>` ile ilgili bir işlem gerçekleştirilemediğinde oluşturulur.

source: The base class for the exceptions that are raised when a key or index used on a mapping or sequence is invalid: :exc:`IndexError`, :exc:`KeyError`. This can be raised directly by :func:`codecs.lookup`.
tr: Bir eşleme veya dizide kullanılan bir anahtar veya dizin geçersiz olduğunda ortaya çıkan istisnalar için temel sınıf: :exc:`IndexError`, :exc:`KeyError`. Bu doğrudan :func:`codecs.lookup` tarafından oluşturulabilir.

source: Concrete exceptions
tr: Somut istisnalar (Concrete exceptions)

source: The following exceptions are the exceptions that are usually raised.
tr: Aşağıdaki istisnalar genellikle ortaya çıkan istisnalardır.

source: Raised when an :keyword:`assert` statement fails.
tr: Bir :keyword:`assert` ifadesi başarısız(fail) olduğunda ortaya çıkar.

source: Raised when an attribute reference (see :ref:`attribute-references`) or assignment fails. (When an object does not support attribute references or attribute assignments at all, :exc:`TypeError` is raised.)
tr: Bir öznitelik referansı (bkz. :ref:`attribute-references`) veya ataması başarısız olduğunda ortaya çıkar. (Bir nesne öznitelik referanslarını veya öznitelik atamalarını hiç desteklemiyorsa, :exc:`TypeError` yükseltilir)

source: The :attr:`name` and :attr:`obj` attributes can be set using keyword-only arguments to the constructor. When set they represent the name of the attribute that was attempted to be accessed and the object that was accessed for said attribute, respectively.
tr: :attr:`name` ve :attr:`obj` öznitelikleri, kurucuya(constructor) yalnızca anahtar kelime argümanları kullanılarak ayarlanabilir. Ayarlandıklarında, sırasıyla erişilmeye çalışılan özniteliğin adını ve söz konusu öznitelik için erişilen nesneyi temsil ederler.

source: Added the :attr:`name` and :attr:`obj` attributes.
tr: :attr:`name` ve :attr:`obj` nitelikleri eklendi.

source: Raised when the :func:`input` function hits an end-of-file condition (EOF) without reading any data. (N.B.: the :meth:`io.IOBase.read` and :meth:`io.IOBase.readline` methods return an empty string when they hit EOF.)
tr: :func:`input` fonksiyonu herhangi bir veri okumadan dosya sonu koşuluna (end-of-file EOF) ulaştığında ortaya çıkar. (Not: :meth:`io.IOBase.read` ve :meth:`io.IOBase.readline` yöntemleri EOF'ye ulaştıklarında boş bir dize döndürürler)

source: Not currently used.
tr: Şu anda kullanılmıyor.

source: Raised when a :term:`generator` or :term:`coroutine` is closed; see :meth:`generator.close` and :meth:`coroutine.close`. It directly inherits from :exc:`BaseException` instead of :exc:`Exception` since it is technically not an error.
tr: Bir :term:`generator` veya :term:`coroutine` kapatıldığında ortaya çıkar; bkz :meth:`generator.close` ve :meth:`coroutine.close`. Teknik olarak bir hata olmadığı için :exc:`Exception` yerine doğrudan :exc:`BaseException` dan miras alınır.

source: Raised when the :keyword:`import` statement has troubles trying to load a module. Also raised when the "from list" in ``from ... import`` has a name that cannot be found.
tr: Bir :keyword:`import` deyimi bir modülü yüklemeye çalışırken sorun yaşadığında ortaya çıkar. Ayrıca ``from ... import`` içindeki "from list" bulunamayan bir isme sahip olduğunda da oluşur.

source: The optional *name* and *path* keyword-only arguments set the corresponding attributes:
tr: İsteğe bağlı *name* ve *path* anahtar sözcük, bağımsız değişkenleri ilgili öznitelikleri ayarlar:

source: The name of the module that was attempted to be imported.
tr: İçe aktarılmaya çalışılan modülün adı.

source: The path to any file which triggered the exception.
tr: İstisnayı tetikleyen herhangi bir dosyanın yolu.

source: Added the :attr:`name` and :attr:`path` attributes.
tr: :attr:`name` ve :attr:`path` nitelikleri eklendi.

source: A subclass of :exc:`ImportError` which is raised by :keyword:`import` when a module could not be located. It is also raised when ``None`` is found in :data:`sys.modules`.
tr: Bir modül bulunamadığında :keyword:`import` tarafından ortaya çıkarılan :exc:`ImportError` alt sınıfı. Ayrıca :data:`sys.modules` içinde ``None`` bulunduğunda da ortaya çıkar.

source: Raised when a sequence subscript is out of range. (Slice indices are silently truncated to fall in the allowed range; if an index is not an integer, :exc:`TypeError` is raised.)
tr: Bir dizi alt simgesi aralık dışında olduğunda yükseltilir. (Dilim indeksleri(slice indices) sessizce izin verilen aralığa düşecek şekilde kırpılır; bir indeks bir tamsayı değilse, :exc:`TypeError` oluşur.).

source: Raised when a mapping (dictionary) key is not found in the set of existing keys.
tr: Bir eşleme(mapping) sözlük(dictionary) anahtarı mevcut anahtarlar kümesinde bulunamadığında ortaya çıkar.

source: Raised when the user hits the interrupt key (normally :kbd:`Control-C` or :kbd:`Delete`). During execution, a check for interrupts is made regularly. The exception inherits from :exc:`BaseException` so as to not be accidentally caught by code that catches :exc:`Exception` and thus prevent the interpreter from exiting.
tr: Kullanıcı kesme(interrupt) tuşuna bastığında oluşur (normalde :kbd:`Control-C` veya :kbd:`Delete`). Yürütme sırasında düzenli olarak kesme kontrolü yapılır. İstisna, :exc:`Exception` kodunu yakalayan kod tarafından yanlışlıkla yakalanmamak ve böylece yorumlayıcının çıkmasını önlemek için :exc:`BaseException` kodundan miras alır.

source: Catching a :exc:`KeyboardInterrupt` requires special consideration. Because it can be raised at unpredictable points, it may, in some circumstances, leave the running program in an inconsistent state. It is generally best to allow :exc:`KeyboardInterrupt` to end the program as quickly as possible or avoid raising it entirely. (See :ref:`handlers-and-exceptions`.)
tr: Bir :exc:`KeyboardInterrupt` yakalamak özel dikkat gerektirir. Tahmin edilemeyen noktalarda yükseltilebildiğinden, bazı durumlarda çalışan programı tutarsız bir durumda bırakabilir. Genellikle en iyisi :exc:`KeyboardInterrupt` ın programı mümkün olduğunca çabuk sonlandırmasına izin vermek veya tamamen yükseltilmesinden kaçınmaktır. (Bkz. :ref:`handlers-and-exceptions`.)

source: Raised when an operation runs out of memory but the situation may still be rescued (by deleting some objects). The associated value is a string indicating what kind of (internal) operation ran out of memory. Note that because of the underlying memory management architecture (C's :c:func:`malloc` function), the interpreter may not always be able to completely recover from this situation; it nevertheless raises an exception so that a stack traceback can be printed, in case a run-away program was the cause.
tr: Bir işlemin belleği tükendiğinde ancak durum hala kurtarılabildiğinde (bazı nesneleri silerek) yükseltilir. İlişkili değer, ne tür bir (dahili) işlemin belleğinin tükendiğini gösteren bir dizedir. Altta yatan bellek yönetim mimarisi (C'nin :c:func:`malloc` fonksiyonu) nedeniyle, yorumlayıcının bu durumdan her zaman tamamen kurtulamayabileceğini unutmayın; yine de bir istisna yükseltir, böylece kaçan bir programın neden olması durumunda bir yığın geri dönüşü yazdırılabilir.

source: Raised when a local or global name is not found. This applies only to unqualified names. The associated value is an error message that includes the name that could not be found.
tr: Yerel veya genel bir ad bulunamadığında oluşur. Bu yalnızca niteliksiz adlar için geçerlidir. İlişkili değer, bulunamayan adı içeren bir hata mesajıdır.

source: The :attr:`name` attribute can be set using a keyword-only argument to the constructor. When set it represent the name of the variable that was attempted to be accessed.
tr: :attr:`name` özniteliği, yapıcıya yalnızca bir anahtar sözcük argümanı kullanılarak ayarlanabilir. Ayarlandığında, erişilmeye çalışılan değişkenin adını temsil eder.

source: Added the :attr:`name` attribute.
tr: :attr:`name` niteliği eklendi.

source: This exception is derived from :exc:`RuntimeError`. In user defined base classes, abstract methods should raise this exception when they require derived classes to override the method, or while the class is being developed to indicate that the real implementation still needs to be added.
tr: Bu istisna :exc:`RuntimeError`'dan türetilmiştir. Kullanıcı tanımlı temel sınıflarda, soyut yöntemler, türetilmiş sınıfların yöntemi geçersiz kılmasını gerektirdiğinde veya sınıf geliştirilirken gerçek uygulamanın hala eklenmesi gerektiğini belirtmek için bu istisnayı yükseltmelidir.

source: It should not be used to indicate that an operator or method is not meant to be supported at all -- in that case either leave the operator / method undefined or, if a subclass, set it to :data:`None`.
tr: Bu, bir operatörün veya yöntemin hiç desteklenmemesi gerektiğini belirtmek için kullanılmamalıdır - bu durumda, ya operatörü / yöntemi tanımlanmamış bırakın ya da bir alt sınıfsa :data:`None`. olarak ayarlayın.

source: This exception is raised when a system function returns a system-related error, including I/O failures such as "file not found" or "disk full" (not for illegal argument types or other incidental errors).
tr: Bu istisna, bir sistem işlevi "dosya bulunamadı" veya "disk dolu" gibi G/Ç hataları da dahil olmak üzere sistemle ilgili bir hata döndürdüğünde ortaya çıkar (illegal argüman bağımsız değişken türleri veya diğer tesadüfi hatalar için değil).

source: The second form of the constructor sets the corresponding attributes, described below. The attributes default to :const:`None` if not specified. For backwards compatibility, if three arguments are passed, the :attr:`~BaseException.args` attribute contains only a 2-tuple of the first two constructor arguments.
tr: Kurucunun(constructor) ikinci formu, aşağıda açıklanan ilgili nitelikleri ayarlar. Öznitelikler belirtilmezse varsayılan olarak :const:`None` olur. Geriye dönük uyumluluk için, üç argüman geçilirse, :attr:`~BaseException.args` niteliği yalnızca ilk iki kurucu argümanının 2'li bir çiftini(tuple) içerir.

source: The constructor often actually returns a subclass of :exc:`OSError`, as described in `OS exceptions`_ below. The particular subclass depends on the final :attr:`.errno` value. This behaviour only occurs when constructing :exc:`OSError` directly or via an alias, and is not inherited when subclassing.
tr: Kurucu genellikle aşağıda `OS istisnaları`_ bölümünde açıklandığı gibi :exc:`OSError` alt sınıfını döndürür. Belirli alt sınıf son :attr:`.errno` değerine bağlıdır. Bu davranış yalnızca :exc:`OSError` doğrudan veya bir takma ad aracılığıyla oluşturulurken ortaya çıkar ve alt sınıf oluşturulurken miras alınmaz.

source: A numeric error code from the C variable :c:data:`errno`.
tr: C değişkeni :c:data:`errno` dan alınan sayısal bir hata kodu.

source: Under Windows, this gives you the native Windows error code. The :attr:`.errno` attribute is then an approximate translation, in POSIX terms, of that native error code.
tr: Windows altında, bu size yerel Windows hata kodunu verir. O halde :attr:`.errno` niteliği bu yerel hata kodunun POSIX terimleriyle yaklaşık bir çevirisidir.

source: Under Windows, if the *winerror* constructor argument is an integer, the :attr:`.errno` attribute is determined from the Windows error code, and the *errno* argument is ignored. On other platforms, the *winerror* argument is ignored, and the :attr:`winerror` attribute does not exist.
tr: Windows altında, *winerror* kurucu bağımsız değişkeni bir tamsayı ise, :attr:`.errno` özniteliği Windows hata kodundan belirlenir ve *errno* bağımsız değişkeni yok sayılır. Diğer platformlarda, *winerror* argümanı yok sayılır ve :attr:`winerror` niteliği mevcut değildir.

source: The corresponding error message, as provided by the operating system. It is formatted by the C functions :c:func:`perror` under POSIX, and :c:func:`FormatMessage` under Windows.
tr: İşletim sistemi tarafından sağlanan ilgili hata mesajı. POSIX altında :c:func:`perror` ve Windows altında :c:func:`FormatMessage` C işlevleri tarafından biçimlendirilir.
