Repository: python/python-docs-tr
Catalog: library/exceptions.po
Languages: tr

source: Raised when trying to run an operation without the adequate access rights - for example filesystem permissions. Corresponds to :c:data:`errno` :py:const:`~errno.EACCES`, :py:const:`~errno.EPERM`, and :py:const:`~errno.ENOTCAPABLE`.
tr: Yeterli erişim hakları (örneğin dosya sistemi izinleri) olmadan bir işlem çalıştırılmaya çalışıldığında ortaya çıkar. :c:data:`errno` :py:const:`~errno.EACCES`, :py:const:`~errno.EPERM` ve :py:const:`~errno.ENOTCAPABLE` değerlerine karşılık gelir.

source: WASI's :py:const:`~errno.ENOTCAPABLE` is now mapped to :exc:`PermissionError`.
tr: WASI'nin :py:const:`~errno.ENOTCAPABLE` ifadesi artık :exc:`PermissionError` ile eşleştirilmiştir.

source: Raised when a given process doesn't exist. Corresponds to :c:data:`errno` :py:const:`~errno.ESRCH`.
tr: Belirli bir süreç mevcut olmadığında ortaya çıkar. Karşılığı :c:data:`errno` :py:const:`~errno.ESRCH`.

source: Raised when a system function timed out at the system level. Corresponds to :c:data:`errno` :py:const:`~errno.ETIMEDOUT`.
tr: Bir sistem işlevi sistem düzeyinde zaman aşımına uğradığında ortaya çıkar. Karşılığı :c:data:`errno` :py:const:`~errno.ETIMEDOUT`.

source: All the above :exc:`OSError` subclasses were added.
tr: Yukarıdaki tüm :exc:`OSError` alt sınıfları eklendi.

source: :pep:`3151` - Reworking the OS and IO exception hierarchy
tr: :pep:`3151` - İşletim sistemi ve IO istisna hiyerarşisinin yeniden düzenlenmesi

source: Warnings
tr: Uyarılar

source: The following exceptions are used as warning categories; see the :ref:`warning-categories` documentation for more details.
tr: Aşağıdaki istisnalar uyarı kategorileri olarak kullanılır; daha fazla ayrıntı için :ref:`warning-categories` belgesine bakın.

source: Base class for warning categories.
tr: Uyarı kategorileri için temel sınıf.

source: Base class for warnings generated by user code.
tr: Kullanıcı kodu tarafından oluşturulan uyarılar için temel sınıf.

source: Base class for warnings about deprecated features when those warnings are intended for other Python developers.
tr: Kullanımdan kaldırılan özelliklerle ilgili uyarılar diğer Python geliştiricilerine yönelik olduğunda bu uyarılar için temel sınıf.

source: Ignored by the default warning filters, except in the ``__main__`` module (:pep:`565`). Enabling the :ref:`Python Development Mode <devmode>` shows this warning.
tr: ``__main__`` modülü (:pep:`565`) dışında varsayılan uyarı filtreleri tarafından yok sayılır. :ref:`Python Geliştirme Modu <devmode>` etkinleştirildiğinde bu uyarı gösterilir.

source: The deprecation policy is described in :pep:`387`.
tr: Kullanımdan kaldırma politikası :pep:`387` bölümünde açıklanmaktadır.

source: Base class for warnings about features which are obsolete and expected to be deprecated in the future, but are not deprecated at the moment.
tr: Eski olan ve gelecekte kullanımdan kaldırılması beklenen, ancak şu anda kullanımdan kaldırılmayan özelliklerle ilgili uyarılar için temel sınıf.

source: This class is rarely used as emitting a warning about a possible upcoming deprecation is unusual, and :exc:`DeprecationWarning` is preferred for already active deprecations.
tr: Bu sınıf nadiren kullanılır çünkü yaklaşan olası bir kullanımdan kaldırma hakkında bir uyarı yayınlamak alışılmadık bir durumdur ve :exc:`DeprecationWarning` zaten aktif olan kullanımdan kaldırmalar için tercih edilir.

source: Ignored by the default warning filters. Enabling the :ref:`Python Development Mode <devmode>` shows this warning.
tr: Varsayılan uyarı filtreleri tarafından yok sayılır. :ref:`Python Geliştirme Modu <devmode>` etkinleştirildiğinde bu uyarı gösterilir.

source: Base class for warnings about dubious syntax.
tr: Şüpheli sözdizimiyle ilgili uyarılar için temel sınıf.

source: Base class for warnings about dubious runtime behavior.
tr: Şüpheli çalışma zamanı davranışları hakkındaki uyarılar için temel sınıf.

source: Base class for warnings about deprecated features when those warnings are intended for end users of applications that are written in Python.
tr: Kullanımdan kaldırılan özelliklerle ilgili uyarılar Python'da yazılmış uygulamaların son kullanıcılarına yönelik olduğunda bu uyarılar için temel sınıf.

source: Base class for warnings about probable mistakes in module imports.
tr: Modül içe aktarmalarındaki olası hatalar hakkında uyarılar için temel sınıf.

source: Base class for warnings related to Unicode.
tr: Unicode ile ilgili uyarılar için temel sınıf.

source: Base class for warnings related to encodings.
tr: Kodlamalarla ilgili uyarılar için temel sınıf.

source: See :ref:`io-encoding-warning` for details.
tr: Ayrıntılar için :ref:`io-encoding-warning` sayfasına bakın.

source: Base class for warnings related to :class:`bytes` and :class:`bytearray`.
tr: :class:`bytes` ve :class:`bytearray` ile ilgili uyarılar için temel sınıf.

source: Base class for warnings related to resource usage.
tr: Kaynak kullanımıyla ilgili uyarılar için temel sınıf.

source: Exception groups
tr: İstisna grupları

source: The following are used when it is necessary to raise multiple unrelated exceptions. They are part of the exception hierarchy so they can be handled with :keyword:`except` like all other exceptions. In addition, they are recognised by :keyword:`except*<except_star>`, which matches their subgroups based on the types of the contained exceptions.
tr: Aşağıdakiler, birden fazla ilgisiz istisnayı yükseltmek gerektiğinde kullanılır. Bunlar istisna hiyerarşisinin bir parçasıdır, bu nedenle diğer tüm istisnalar gibi :keyword:`except` ile ele alınabilirler. Ayrıca, içerdikleri istisnaların türlerine göre alt gruplarını eşleştiren :keyword:`except*<except_star>` tarafından tanınırlar.

source: Both of these exception types wrap the exceptions in the sequence ``excs``. The ``msg`` parameter must be a string. The difference between the two classes is that :exc:`BaseExceptionGroup` extends :exc:`BaseException` and it can wrap any exception, while :exc:`ExceptionGroup` extends :exc:`Exception` and it can only wrap subclasses of :exc:`Exception`. This design is so that ``except Exception`` catches an :exc:`ExceptionGroup` but not :exc:`BaseExceptionGroup`.
tr: Bu istisna türlerinin her ikisi de istisnaları ``excs`` dizisine sarar. ``msg`` parametresi bir string olmalıdır. İki sınıf arasındaki fark, :exc:`BaseExceptionGroup`, :exc:`BaseException`'ı genişletir ve herhangi bir istisnayı sarabilirken, :exc:`ExceptionGroup`, :exc:`Exception`'ı genişletir ve yalnızca :exc:`Exception`'ın alt sınıflarını sarabilir. Bu tasarım sayesinde ``except Exception`` bir :exc:`ExceptionGroup` u yakalar ancak :exc:`BaseExceptionGroup` u yakalayamaz.

source: The :exc:`BaseExceptionGroup` constructor returns an :exc:`ExceptionGroup` rather than a :exc:`BaseExceptionGroup` if all contained exceptions are :exc:`Exception` instances, so it can be used to make the selection automatic. The :exc:`ExceptionGroup` constructor, on the other hand, raises a :exc:`TypeError` if any contained exception is not an :exc:`Exception` subclass.
tr: İçerdiği tüm istisnalar :exc:`Exception` örneğiyse, :exc:`BaseExceptionGroup` yapıcısı bir :exc:`BaseExceptionGroup` yerine bir :exc:`ExceptionGroup` döndürür, böylece seçimi otomatik hale getirmek için kullanılabilir. Öte yandan, :exc:`ExceptionGroup` kurucusu, içerdiği herhangi bir istisna bir :exc:`Exception` alt sınıfı değilse bir :exc:`TypeError` yükseltir.

source: The ``msg`` argument to the constructor. This is a read-only attribute.
tr: Kurucunun ``msg`` argümanı. Bu salt okunur bir niteliktir.

source: A tuple of the exceptions in the ``excs`` sequence given to the constructor. This is a read-only attribute.
tr: Yapıcıya verilen ``excs`` dizisindeki istisnaların bir demeti(tuple). Bu salt okunur bir özniteliktir.

source: Returns an exception group that contains only the exceptions from the current group that match *condition*, or ``None`` if the result is empty.
tr: Yalnızca geçerli gruptaki *condition* ile eşleşen istisnaları içeren bir istisna grubu veya sonuç boşsa ``None`` döndürür.

source: The condition can be either a function that accepts an exception and returns true for those that should be in the subgroup, or it can be an exception type or a tuple of exception types, which is used to check for a match using the same check that is used in an ``except`` clause.
tr: Koşul, bir istisnayı kabul eden ve alt grupta olması gerekenler için true döndüren bir fonksiyon olabileceği gibi, bir ``except`` cümlesinde kullanılan kontrolün aynısını kullanarak bir eşleşme olup olmadığını kontrol etmek için kullanılan bir istisna türü veya istisna türleri demeti(tuple) de olabilir.

source: The nesting structure of the current exception is preserved in the result, as are the values of its :attr:`message`, :attr:`~BaseException.__traceback__`, :attr:`~BaseException.__cause__`, :attr:`~BaseException.__context__` and :attr:`~BaseException.__notes__` fields. Empty nested groups are omitted from the result.
tr: Mevcut istisna içindeki iç içe geçme yapısı sonuçta korunur, ayrıca :attr:`message`, :attr:`~BaseException.__traceback__`, :attr:`~BaseException.__cause__`, :attr:`~BaseException.__context__` ve :attr:`~BaseException.__notes__` alanlarının değerleri de korunur. Boş iç içe gruplar sonuçtan çıkarılır.

source: The condition is checked for all exceptions in the nested exception group, including the top-level and any nested exception groups. If the condition is true for such an exception group, it is included in the result in full.
tr: Koşul(condition), üst düzey ve iç içe geçmiş istisna grupları dahil olmak üzere, iç içe geçmiş istisna grubundaki tüm istisnalar için kontrol edilir. Koşul böyle bir istisna grubu için doğruysa, sonuca tam olarak dahil edilir.

source: Like :meth:`subgroup`, but returns the pair ``(match, rest)`` where ``match`` is ``subgroup(condition)`` and ``rest`` is the remaining non-matching part.
tr: :meth:`subgroup` gibi, ancak ``(match, rest)`` çiftini döndürür; burada ``match`` ``subgroup(condition)`` ve ``rest`` kalan eşleşmeyen kısımdır.

source: Returns an exception group with the same :attr:`message`, but which wraps the exceptions in ``excs``.
tr: Aynı :attr:`message` ile bir istisna grubu döndürür, ancak istisnaları ``excs`` içine sarar.

source: This method is used by :meth:`subgroup` and :meth:`split`. A subclass needs to override it in order to make :meth:`subgroup` and :meth:`split` return instances of the subclass rather than :exc:`ExceptionGroup`.
tr: Bu yöntem :meth:`subgroup` ve :meth:`split` tarafından kullanılır. Bir alt sınıfın :meth:`subgroup` ve :meth:`split` metotlarının :exc:`ExceptionGroup` yerine alt sınıfın örneklerini döndürmesini sağlamak için bu metodu geçersiz kılması gerekir.

source: :meth:`subgroup` and :meth:`split` copy the :attr:`~BaseException.__traceback__`, :attr:`~BaseException.__cause__`, :attr:`~BaseException.__context__` and :attr:`~BaseException.__notes__` fields from the original exception group to the one returned by :meth:`derive`, so these fields do not need to be updated by :meth:`derive`.
tr: :meth:`subgroup` ve :meth:`split`, :attr:`~BaseException.__traceback__`, :attr:`~BaseException.__cause__`, :attr:`~BaseException.__context__` ve :attr:`~BaseException.__notes__` alanlarını orijinal istisna grubundan :meth:`derive` tarafından döndürülene kopyalar, böylece bu alanların :meth:`derive` tarafından güncellenmesi gerekmez.

source: Note that :exc:`BaseExceptionGroup` defines :meth:`~object.__new__`, so subclasses that need a different constructor signature need to override that rather than :meth:`~object.__init__`. For example, the following defines an exception group subclass which accepts an exit_code and and constructs the group's message from it. ::
tr: :exc:`BaseExceptionGroup` öğesinin :meth:`~object.__new__` öğesini tanımladığına dikkat edin, bu nedenle farklı bir kurucu imzasına ihtiyaç duyan alt sınıfların :meth:`~object.__init__` yerine bunu geçersiz kılmaları gerekir. Örneğin, aşağıda bir exit_code kabul eden ve grubun mesajını bundan oluşturan bir istisna grubu alt sınıfı tanımlanmaktadır:

source: Like :exc:`ExceptionGroup`, any subclass of :exc:`BaseExceptionGroup` which is also a subclass of :exc:`Exception` can only wrap instances of :exc:`Exception`.
tr: Tıpkı :exc:`ExceptionGroup` gibi, :exc:`BaseExceptionGroup` alt sınıfı olan :exc:`Exception` alt sınıfı da yalnızca :exc:`Exception` örneklerini sarabilir.

source: Exception hierarchy
tr: İstisna hiyerarşisi

source: The class hierarchy for built-in exceptions is:
tr: Gömülü istisnalar için sınıf hiyerarşisi şöyledir:
