Repository: python/python-docs-tr
Catalog: library/functions.po
Languages: tr

source: Built-in Functions
tr: Gömülü Fonksiyonlar

source: The Python interpreter has a number of functions and types built into it that are always available. They are listed here in alphabetical order.
tr: Python yorumlayıcısı, içinde gömülü olarak gelen ve her zaman kullanılabilen bir dizi fonksiyon ve tür barındırır. Burada alfabetik sıraya göre listelenmiştir.

source: Return the absolute value of a number. The argument may be an integer, a floating point number, or an object implementing :meth:`__abs__`. If the argument is a complex number, its magnitude is returned.
tr: Bir sayının mutlak değerini döndürür. Argüman bir tam sayı, gerçel sayı veya :meth:`__abs__` 'i uygulayan bir nesne olabilir. Eğer argüman bir karmaşık sayıysa, onun büyüklüğü döndürülür.

source: Return an :term:`asynchronous iterator` for an :term:`asynchronous iterable`. Equivalent to calling ``x.__aiter__()``.
tr: Bir :term:`asynchronous iterable` için bir :term:`asynchronous iterator` döndürür. ``x.__aiter__()`` çağrısına eş değerdir.

source: Note: Unlike :func:`iter`, :func:`aiter` has no 2-argument variant.
tr: Not: :func:`iter` 'in aksine, :func:`aiter` 'in 2 argümanlı biçimi yoktur.

source: Return ``True`` if all elements of the *iterable* are true (or if the iterable is empty). Equivalent to::
tr: Eğer *iterable* 'ın tüm elementleri doğruysa, ``True`` döndürür. Şuna eş değerdir::

source: When awaited, return the next item from the given :term:`asynchronous iterator`, or *default* if given and the iterator is exhausted.
tr: Hazır olunduğunda, verilen :term:`asynchronous iterator` 'dan sıradaki parçayı döndürür. Eğer yineleyici tükendiyse ve *default* değer verildiyse, *default* değeri döndürür.

source: This is the async variant of the :func:`next` builtin, and behaves similarly.
tr: Bu, gömülü fonksiyonlardan olan :func:`next` 'in asenkron bir varyantıdır, benzer şekilde çalışır.

source: This calls the :meth:`~object.__anext__` method of *async_iterator*, returning an :term:`awaitable`. Awaiting this returns the next value of the iterator. If *default* is given, it is returned if the iterator is exhausted, otherwise :exc:`StopAsyncIteration` is raised.
tr: Bu *async_iterator* 'ın :meth:`~object.__anext__` metodunu çağırır. Bir :term:`awaitable` döndürür. Bunu beklemek yineleyicinin bir sonraki değerini döndürür. Eğer *default* değer verildiyse, yineleyici tükendiğinde o döndürülür. Aksi takdirde :exc:`StopAsyncIteration` hatası ortaya çıkar.

source: Return ``True`` if any element of the *iterable* is true. If the iterable is empty, return ``False``. Equivalent to::
tr: Eğer *iterable* 'ın elementlerinden herhangi biri doğru ise ``True`` döndürür. Eğer *iterable* boş ise, ``False`` döndürür. Şuna eşittir::

source: As :func:`repr`, return a string containing a printable representation of an object, but escape the non-ASCII characters in the string returned by :func:`repr` using ``\x``, ``\u``, or ``\U`` escapes. This generates a string similar to that returned by :func:`repr` in Python 2.
tr: :func:`repr` 'in bir nesnenin yazdırılabilir temsilini içeren bir dize döndürdüğü, ancak :func:`repr` tarafından döndürülen dizedeki ASCII olmayan karakterlerden ``\x``, ``\u`` veya ``\U`` gibi kaçış karakterlerini kullanarak kaçtığı gibi, bu da Python 2'deki :func:`repr` tarafından döndürülen değere benzeyen bir string üretir.

source: Convert an integer number to a binary string prefixed with "0b". The result is a valid Python expression. If *x* is not a Python :class:`int` object, it has to define an :meth:`__index__` method that returns an integer. Some examples:
tr: Bir tam sayıyı, ön eki "0b" olan ikili bir dizeye dönüştürür. Sonuç geçerli bir Python ifadesidir. Eğer *x* bir Python :class:`int` nesnesi değilse, tam sayı döndüren bir :meth:`__index__` metodu tanımlaması gerekir. Bazı örnekler:

source: If the prefix "0b" is desired or not, you can use either of the following ways.
tr: Eğer ön ek olarak "0b" isteniyorsa veya istenmiyorsa, aşağıdaki gibi iki şekilde de kullanabilirsiniz.

source: See also :func:`format` for more information.
tr: Ayrıca daha fazla bilgi için :func:`format` 'a bakabilirsiniz.

source: Return a Boolean value, i.e. one of ``True`` or ``False``. *x* is converted using the standard :ref:`truth testing procedure <truth>`. If *x* is false or omitted, this returns ``False``; otherwise, it returns ``True``. The :class:`bool` class is a subclass of :class:`int` (see :ref:`typesnumeric`). It cannot be subclassed further. Its only instances are ``False`` and ``True`` (see :ref:`bltin-boolean-values`).
tr: ``True`` ya da ``False`` değeri döndürür. *x*, standart :ref:`truth testing procedure <truth>` kullanılarak boolean veri tipine dönüştürülür. *x* yanlışsa veya atlanırsa, bu ``False`` döndürür; aksi takdirde, ``True`` değerini döndürür. :class:`bool` sınıfı :class:`int` öğesinin bir alt sınıfıdır (bkz. :ref:`typesnumeric`). Daha fazla alt sınıfa ayrılamaz. Bunun tek örnekleri ``False`` ve ``True`` 'dur (bkz. :ref:`bltin-boolean-values`).

source: *x* is now a positional-only parameter.
tr: *x* artık yalnızca konumsal bir parametredir.

source: This function drops you into the debugger at the call site. Specifically, it calls :func:`sys.breakpointhook`, passing ``args`` and ``kws`` straight through. By default, ``sys.breakpointhook()`` calls :func:`pdb.set_trace()` expecting no arguments. In this case, it is purely a convenience function so you don't have to explicitly import :mod:`pdb` or type as much code to enter the debugger. However, :func:`sys.breakpointhook` can be set to some other function and :func:`breakpoint` will automatically call that, allowing you to drop into the debugger of choice. If :func:`sys.breakpointhook` is not accessible, this function will raise :exc:`RuntimeError`.
tr: Bu fonksiyon sizi çağrılma bölgesindeki hata ayıklayıcıya bırakır. Spesifik olarak, :func:`sys.breakpointhook` 'u çağırır, ``args`` ve ``kws`` 'yi doğrudan geçer. Varsayılan olarak, ``sys.breakpointhook()`` hiçbir parametre beklemeden :func:`pdb.set_trace()` fonksiyonunu çağırır. Bu durumda, bu tamamen size kolaylık sağlamak içindir, bu nedenle hata ayıklayıcıya girmek için :mod:`pdb` 'yi içe aktarmanız veya fazla kod yazmanız gerekmez. Buna rağmen, :func:`sys.breakpointhook` başka bir fonksiyona ayarlanabilir ve :func:`breakpoint` otomatik olarak bunu çağırır ve tercih ettiğiniz hata ayıklayıcıya girmenize izin verir. Eğer :func:`sys.breakpointhook` ulaşılabilir değilse, bu fonksiyon :exc:`RuntimeError` hatasını verecektir.

source: Raises an :ref:`auditing event <auditing>` ``builtins.breakpoint`` with argument ``breakpointhook``.
tr: ``breakpointhook`` parametresi ile :ref:`denetleme olayı <auditing>` ``builtins.breakpoint`` ortaya çıkartır.

source: Return a new array of bytes. The :class:`bytearray` class is a mutable sequence of integers in the range 0 <= x < 256. It has most of the usual methods of mutable sequences, described in :ref:`typesseq-mutable`, as well as most methods that the :class:`bytes` type has, see :ref:`bytes-methods`.
tr: Baytlardan oluşan yeni bir dizi döndürür. :class:`bytearray` sınıfı 0 <= x < 256 aralığındaki tam sayılardan oluşan değişebilir bir dizedir. :ref:`typesseq-mutable` 'da tarif edildiği gibi değişebilir dizeler klasik metotlarının çoğuna sahiptir. :class:`bytes` tipinin sahip olduğu metotlar için, :ref:`bytes-methods` 'a bakınız.

source: The optional *source* parameter can be used to initialize the array in a few different ways:
tr: Opsiyonel *source* parametresi diziyi birkaç farklı şekilde başlatmak için kullanılabilir:

source: If it is a *string*, you must also give the *encoding* (and optionally, *errors*) parameters; :func:`bytearray` then converts the string to bytes using :meth:`str.encode`.
tr: Eğer bir *string* ise, *encoding* (ve istenirse, *errors*) parametrelerini de vermelisiniz; sonrasında :func:`bytearray` :meth:`str.encode` kullanarak dizeyi bayta çevirecektir.

source: If it is an *integer*, the array will have that size and will be initialized with null bytes.
tr: Eğer bir *integer* ise, dizi bu boyuta göre null baytlar ile doldurulur.

source: If it is an object conforming to the :ref:`buffer interface <bufferobjects>`, a read-only buffer of the object will be used to initialize the bytes array.
tr: Eğer :ref:`arabellek arayüzü <bufferobjects>` 'ne uyan bir objeyse, bayt dizisini başlatmak için bir salt okunur arabellek kullanılır.

source: If it is an *iterable*, it must be an iterable of integers in the range ``0 <= x < 256``, which are used as the initial contents of the array.
tr: Eğer *iterable* ise, 0 <= x < 256 aralığındaki dizinin başlangıç içeriği olan tam sayılardan oluşan bir yinelenebilir nesne olmalıdır.

source: Without an argument, an array of size 0 is created.
tr: Argüman yoksa, boyutu 0 olan bir dizi oluşturulur.

source: See also :ref:`binaryseq` and :ref:`typebytearray`.
tr: :ref:`binaryseq` ve :ref:`typebytearray` 'a bakınız.

source: Return a new "bytes" object which is an immutable sequence of integers in the range ``0 <= x < 256``. :class:`bytes` is an immutable version of :class:`bytearray` -- it has the same non-mutating methods and the same indexing and slicing behavior.
tr: ``0 <= x < 256`` aralığındaki tam sayılardan oluşan değiştirilemez bir "bayt" objesi döndürür. :class:`bytes`, :class:`bytearray` 'in değiştirilemez versiyonudur. Aynı objeyi değiştirmeyen metotlara, indeksleme ve dilimleme davranışına sahiptir.

source: Accordingly, constructor arguments are interpreted as for :func:`bytearray`.
tr: Buna göre, yapıcı argümanları :func:`bytearray` için yorumlanır.

source: Bytes objects can also be created with literals, see :ref:`strings`.
tr: Bayt nesneleri değişmez değerler ile de oluşturulabilir, :ref:`strings` 'a bakınız.

source: See also :ref:`binaryseq`, :ref:`typebytes`, and :ref:`bytes-methods`.
tr: Ayrıca :ref:`binaryseq`, :ref:`typebytes`, ve :ref:`bytes-methods` 'a bakınız.

source: Return :const:`True` if the *object* argument appears callable, :const:`False` if not. If this returns ``True``, it is still possible that a call fails, but if it is ``False``, calling *object* will never succeed. Note that classes are callable (calling a class returns a new instance); instances are callable if their class has a :meth:`__call__` method.
tr: Eğer *object* argümanı çağrılabilir ise, :const:`True` , değilse :const:`False` döndürür. Eğer ``True`` döndürür ise, bir çağrının başarısız olması hala mümkündür, ``False`` döndürdüğü takdirde, *object* çağrısı hiçbir zaman başarılı olamaz. Sınıfların ve örneklerin (Sınıflarında :meth:`__call__` metodu varsa) çağrılabilir olduğunu not edin. Bir sınıfı çağırmak sınıftan türeyen yeni bir örnek döndürür.

source: This function was first removed in Python 3.0 and then brought back in Python 3.2.
tr: Bu fonksiyon Python 3.0 versiyonunda kaldırılmıştı ama Python 3.2 versiyonunda geri getirildi.

source: Return the string representing a character whose Unicode code point is the integer *i*. For example, ``chr(97)`` returns the string ``'a'``, while ``chr(8364)`` returns the string ``'€'``. This is the inverse of :func:`ord`.
tr: Unicode kod noktası *i* tamsayısı olan bir karakteri temsil eden dizeyi döndürür. Örneğin, ``chr(97)`` , ``'a'`` dizesini döndürürken, ``chr(8364)`` , ``'€'`` dizesini döndürür. Bu fonksiyon, :func:`ord` 'un tam tersidir.

source: The valid range for the argument is from 0 through 1,114,111 (0x10FFFF in base 16). :exc:`ValueError` will be raised if *i* is outside that range.
tr: Argüman için geçerli değer 0 ile 1.114.111 arasındadır (16'lık sayı sisteminde 0x10FFFF). Eğer *i* aralığın dışında ise :exc:`ValueError` hatası ortaya çıkar.

source: Transform a method into a class method.
tr: Bir metodu sınıf metoduna dönüştürür.

source: A class method receives the class as an implicit first argument, just like an instance method receives the instance. To declare a class method, use this idiom::
tr: Bir sınıf metodu, sınıfı örtük ilk argüman olarak alır, aynı sınıftan türeyen bir örneğin metodunun örneği aldığı gibi. Bir sınıf metodunu bu şekilde tanımlayabilirsiniz::

source: The ``@classmethod`` form is a function :term:`decorator` -- see :ref:`function` for details.
tr: ``@classmethod`` formu, bir :term:`decorator` fonksiyonudur. -- detaylar için :ref:`function` 'a bakınız.

source: A class method can be called either on the class (such as ``C.f()``) or on an instance (such as ``C().f()``). The instance is ignored except for its class. If a class method is called for a derived class, the derived class object is passed as the implied first argument.
tr: Bir sınıf metodu sınıf (``C.f()`` gibi) veya örnek (``C().f()`` gibi) üzerinden çağırılabilir. Örnek, sınıfı dışında yoksayılır. Eğer bir sınıf metodu türetilmiş bir sınıf için çağrılırsa, türetilmiş sınıf nesnesi örtük ilk argüman olarak geçer.

source: Class methods are different than C++ or Java static methods. If you want those, see :func:`staticmethod` in this section. For more information on class methods, see :ref:`types`.
tr: Sınıf metotları C++ ve Java static metotlarından farklıdır. Eğer bunları kullanmak isterseniz, bu bölümdeki :func:`staticmethod` kısmına bakınız. Sınıf metotları hakkında daha fazla bilgi için, :ref:`types` 'a bakınız.

source: Class methods can now wrap other :term:`descriptors <descriptor>` such as :func:`property`.
tr: Sınıf metotları artık :func:`property` gibi diğer :term:`descriptors <descriptor>` 'ları sarmalayabilir.

source: Class methods now inherit the method attributes (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` and ``__annotations__``) and have a new ``__wrapped__`` attribute.
tr: Sınıf metotları artık (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` and ``__annotations__``) metot özelliklerini miras alır ve yeni bir ``__wrapped__`` özelliğine sahiplerdir.

source: Class methods can no longer wrap other :term:`descriptors <descriptor>` such as :func:`property`.
tr: Sınıf metotları artık :func:`property` gibi diğer :term:`descriptor` 'ları sarmalayamaz.

source: Compile the *source* into a code or AST object. Code objects can be executed by :func:`exec` or :func:`eval`. *source* can either be a normal string, a byte string, or an AST object. Refer to the :mod:`ast` module documentation for information on how to work with AST objects.
tr: *source* 'ı bir koda veya AST nesnesine derler. Kod nesneleri :func:`exec` veya :func:`eval` fonksiyonları kullanılarak çalıştırılabilir. *source* normal bir dize, bayt dizesi veya bir AST nesnesi olabilir. AST nesneleriyle nasıl çalışılacağını öğrenmek için :mod:`ast` modülüne bkz.

source: The *filename* argument should give the file from which the code was read; pass some recognizable value if it wasn't read from a file (``'<string>'`` is commonly used).
tr: *filename* argümanı kodun okunduğu dosyayı vermelidir; eğer bir dosyadan okunmuyorsa ayırtedilebilir bir değer verebilirsin (genellikle ``'<string>'`` kullanılır).

source: The *mode* argument specifies what kind of code must be compiled; it can be ``'exec'`` if *source* consists of a sequence of statements, ``'eval'`` if it consists of a single expression, or ``'single'`` if it consists of a single interactive statement (in the latter case, expression statements that evaluate to something other than ``None`` will be printed).
tr: *mode* argümanı hangi türden kodun derleneceğini belirtir; eğer *source* bir dizi ifadeden oluşuyorsa ``'exec'`` , eğer tek bir ifadeden oluşuyorsa ``'eval'`` , veya tek bir etkileşimli ifadeden oluşuyorsa ``'single'`` olabilir (ikinci durumda, "None" dışında bir değere sahip ifadeler yazdırılacaktır).

source: The optional arguments *flags* and *dont_inherit* control which :ref:`compiler options <ast-compiler-flags>` should be activated and which :ref:`future features <future>` should be allowed. If neither is present (or both are zero) the code is compiled with the same flags that affect the code that is calling :func:`compile`. If the *flags* argument is given and *dont_inherit* is not (or is zero) then the compiler options and the future statements specified by the *flags* argument are used in addition to those that would be used anyway. If *dont_inherit* is a non-zero integer then the *flags* argument is it -- the flags (future features and compiler options) in the surrounding code are ignored.
tr: *flags* ve *dont_inherit* opsiyonel argümanları hangi :ref:`derleyici seçenekleri <ast-compiler-flags>` 'ın aktive edilmesi gerektiğini ve hangi :ref:`gelecekteki özellikler <future>` 'e izin verileceğini kontrol eder. İkisi de verilmediyse (veya ikisi de sıfır ise) kod, :func:`compile` 'ı çağıran kodu etkileyen aynı bayraklarla derlenir. Eğer *flags* argümanı verilip *dont_inherit* verilmediyse (veya sıfırsa), derleyici seçenekleri ve gelecek ifadeleri *flags* argümanı tarafından belirtilirler, her türlükullanılacak olanlara ek olarak kullanılır. Eğer *dont_inherit* sıfırdan farklı bir tamsayıysa, *flags* argümanı da odur. -- çevreleyen koddaki bayraklar (gelecekteki özellikler ve derleyici seçenekleri) yoksayılır.

source: Compiler options and future statements are specified by bits which can be bitwise ORed together to specify multiple options. The bitfield required to specify a given future feature can be found as the :attr:`~__future__._Feature.compiler_flag` attribute on the :class:`~__future__._Feature` instance in the :mod:`__future__` module. :ref:`Compiler flags <ast-compiler-flags>` can be found in :mod:`ast` module, with ``PyCF_`` prefix.
tr: Derleyici seçenekleri ve gelecek ifadeleri, birden fazla seçeneği belirlemek için bit düzeyinde VEYA'lanabilen bitler tarafından belirlenirler. Gelecekteki belirli bir özelliği belirtmek için gereken bit alanı, :mod:`__future__` modülündeki :class:`~__future__._Feature` örneğinde :attr:`~__future__._Feature.compiler_flag` niteliği olarak bulunabilir. :ref:`Derleyici bayrakları <ast-compiler-flags>` , :mod:`ast` modülünde ``PyCF_`` öneki ile bulunabilir.

source: The argument *optimize* specifies the optimization level of the compiler; the default value of ``-1`` selects the optimization level of the interpreter as given by :option:`-O` options. Explicit levels are ``0`` (no optimization; ``__debug__`` is true), ``1`` (asserts are removed, ``__debug__`` is false) or ``2`` (docstrings are removed too).
tr: *optimize* argümanı derleyicinin optimizasyon seviyesini belirler; ``-1`` varsayılan değeri, :option:`-O` seçenekleri tarafından verilen yorumlayıcının optimizasyon seviyesini seçer. Belli seviyeler: ``0`` (optimizasyon yok; ``__debug__`` doğru), ``1`` (iddialar kaldırılır, ``__debug__`` yanlış) veya ``2`` (Ekstradan doküman dizeleri de kaldırıldı).

source: This function raises :exc:`SyntaxError` if the compiled source is invalid, and :exc:`ValueError` if the source contains null bytes.
tr: Bu fonksiyon derlenmiş kaynak geçerli değil ise :exc:`SyntaxError` , null baytlar içeriyorsa :exc:`ValueError` hatalarını ortaya çıkarır.

source: If you want to parse Python code into its AST representation, see :func:`ast.parse`.
tr: Python kodunu onun AST temsiline ayrıştırmak isterseniz, :func:`ast.parse` 'a bakınız.

source: Raises an :ref:`auditing event <auditing>` ``compile`` with arguments ``source``, ``filename``.
tr: ``source`` ve ``filename`` argümanlarıyla :ref:`denetleme olayı <auditing>` ``compile`` ortaya çıkartır.

source: Raises an :ref:`auditing event <auditing>` ``compile`` with arguments ``source`` and ``filename``. This event may also be raised by implicit compilation.
tr: ``source`` ve ``filename`` argümanlarıyla :ref:`denetleme olayı <auditing>` ``compile`` ortaya çıkartır. Bu durum, örtük derleme ile de ortaya çıkarılabilir.

source: When compiling a string with multi-line code in ``'single'`` or ``'eval'`` mode, input must be terminated by at least one newline character. This is to facilitate detection of incomplete and complete statements in the :mod:`code` module.
tr: ``'single'`` veya ``'eval'`` modunda çok satırlı bir dize derleneceğinde, giren veri en az bir yeni satır karakteri ile sonlandırılmalıdır. Bu :mod:`code` modülündeki tamamlanmış ve tamamlanmamış ifadelerin tespitini kolaylaştırmak içindir.

source: It is possible to crash the Python interpreter with a sufficiently large/complex string when compiling to an AST object due to stack depth limitations in Python's AST compiler.
tr: Python'un AST derleyicisindeki yığın derinliği sınırlamaları nedeniyle yeterince büyük/karmaşık bir dizeyi bir AST nesnesine derlerken Python yorumlayıcısını çökertmek mümkündür.

source: Allowed use of Windows and Mac newlines. Also, input in ``'exec'`` mode does not have to end in a newline anymore. Added the *optimize* parameter.
tr: Windows ve Mac yeni satırlarının kullanımına izin verildi. Ayrıca, bundan böyle ``'exec'`` modunda iken veri girişinin yeni satırda sonlanması gerekmiyor. *optimize* parametresi eklendi.

source: Previously, :exc:`TypeError` was raised when null bytes were encountered in *source*.
tr: Önceden, *source* , null baytlar içeriyorsa :exc:`TypeError` hatası ortaya çıkardı.

source: ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` can now be passed in flags to enable support for top-level ``await``, ``async for``, and ``async with``.
tr: ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` artık üst düze ``await``, ``async for``, ve ``async with`` desteğini etkinleştirmek için bayraklarla iletilebilir.

source: Return a complex number with the value *real* + *imag*\*1j or convert a string or number to a complex number. If the first parameter is a string, it will be interpreted as a complex number and the function must be called without a second parameter. The second parameter can never be a string. Each argument may be any numeric type (including complex). If *imag* is omitted, it defaults to zero and the constructor serves as a numeric conversion like :class:`int` and :class:`float`. If both arguments are omitted, returns ``0j``.
tr: *real* + *imag*\*1j değeriyle bir karmaşık sayı döndürür veya dize veya sayıyı karmaşık sayıya dönüştürür. Eğer ilk parametre dize ise, karmaşık sayı olarak yorumlanır ve fonksiyon ikinci bir parametre olmadan çağrılmalıdır. İkinci parametre asla dize olamaz. Her argüman bir sayısal çeşit olabilir (karmaşık sayılar dahil). Eğer *imag* atlandıysa, varsayılan olarak sıfır alınır ve yapıcı metot :class:`int` ve :class:`float` gibi sayı dönüştürme işlevi görür. Eğer iki argüman da atlandıysa, ``0j`` döndürür.

source: For a general Python object ``x``, ``complex(x)`` delegates to ``x.__complex__()``. If ``__complex__()`` is not defined then it falls back to :meth:`__float__`. If ``__float__()`` is not defined then it falls back to :meth:`__index__`.
tr: Genel bir python nesnesi ``x`` için, ``complex(x)`` , ``x.__complex__()`` 'i temsil eder. Eğer ``__complex__()`` tanımlanmadıysa, :meth:`__float__` 'a geri döner. ``__float__()`` tanımlanmadıysa, :meth:`__index__` 'e geri döner.

source: When converting from a string, the string must not contain whitespace around the central ``+`` or ``-`` operator. For example, ``complex('1+2j')`` is fine, but ``complex('1 + 2j')`` raises :exc:`ValueError`.
tr: Bir dize dönüştürürken, dizenin, merkezi ``+`` veya ``-`` operatörünün etrafında boşluk içermemelidir. Örnek olarak, ``complex('1+2j')`` uygun, ama ``complex('1 + 2j')`` :exc:`ValueError` hatası ortaya çıkarır.

source: The complex type is described in :ref:`typesnumeric`.
tr: Karmaşık tür, :ref:`typesnumeric` kısmında açıklanmıştır.

source: Grouping digits with underscores as in code literals is allowed.
tr: Rakamların, kod sabitlerinde olduğu gibi alt çizgi ile gruplandırılmasına izin verilir.

source: Falls back to :meth:`__index__` if :meth:`__complex__` and :meth:`__float__` are not defined.
tr: Eğer :meth:`__complex__` ve :meth:`__float__` tanımlanmadıysa, :meth:`__index__` 'e geri döner.
