Repository: python/python-docs-tr
Catalog: library/functions.po
Languages: tr

source: Since :ref:`private name mangling <private-name-mangling>` happens at compilation time, one must manually mangle a private attribute's (attributes with two leading underscores) name in order to retrieve it with :func:`getattr`.
tr: :ref:`özel isim yönetimi <private-name-mangling>` derleme zamanında gerçekleştiğinden dolayı, :func:`getattr` ile almak için özel bir niteliğin (baştaki iki alt çizgili nitelikler) adını manuel olarak değiştirmek gerekir.

source: Return the dictionary implementing the current module namespace. For code within functions, this is set when the function is defined and remains the same regardless of where the function is called.
tr: Geçerli modül ad alanını uygulayan sözlüğü döndürür. Fonksiyonlar içeren kod için, bu fonksiyon tanımlandığında ayarlanır ve fonksiyonun çağrıldığı yerden bağımsız olarak aynı kalır.

source: The arguments are an object and a string. The result is ``True`` if the string is the name of one of the object's attributes, ``False`` if not. (This is implemented by calling ``getattr(object, name)`` and seeing whether it raises an :exc:`AttributeError` or not.)
tr: Argümanlar bir nesne ve dizedir. Eğer dize, nesnenin özelliklerinden birinin ismiyse ``True``, değilse ``False`` döndürür. (Bu ``getattr(object, name)`` 'i çağırarak uygulanır ve :exc:`AttributeError` hatası oluşup oluşmayacağı görülür.)

source: Return the hash value of the object (if it has one). Hash values are integers. They are used to quickly compare dictionary keys during a dictionary lookup. Numeric values that compare equal have the same hash value (even if they are of different types, as is the case for 1 and 1.0).
tr: Nesnenin karma değerini döndürür (eğer varsa). Karma değerler tam sayılardır. Sözlükleri incelerken hızlı bir şekilde anahtarları karşılaştırmak için kullanılırlar. Karşılaştırıldığında aynı olan nümerik değerler aynı karma değere sahiptir (1 ve 1.0 durumunda olduğu gibi farklı veri tiplerinde olsalar bile).

source: For objects with custom :meth:`__hash__` methods, note that :func:`hash` truncates the return value based on the bit width of the host machine. See :meth:`__hash__` for details.
tr: :meth:`__hash__` metodu olan nesneler için, :func:`hash` öğesinin ana makinenin bit genişliğine göre döndürdüğü değeri kestiğini unutmayın. Detaylar için :meth:`__hash__` 'e bakınız.

source: Invoke the built-in help system. (This function is intended for interactive use.) If no argument is given, the interactive help system starts on the interpreter console. If the argument is a string, then the string is looked up as the name of a module, function, class, method, keyword, or documentation topic, and a help page is printed on the console. If the argument is any other kind of object, a help page on the object is generated.
tr: Yerleşik yardım sistemini çağırın. (Bu fonksiyon interaktif kullanıma yöneliktir.) Eğer argüman verilmediyse, interaktif yardım sistemi yorumlayıcı konsolunda başlar. Eğer argüman bir dize ise, bir modül, fonksiyon, sınıf, metot, anahtar kelime veya dokümantasyon konusu için dizeye bakılır ve bir yardım sayfası konsola bastırılır. Eğer argüman başka tipte bir nesne ise, nesne üzerinde bir yardım sayfası oluşturulur.

source: Note that if a slash(/) appears in the parameter list of a function when invoking :func:`help`, it means that the parameters prior to the slash are positional-only. For more info, see :ref:`the FAQ entry on positional-only parameters <faq-positional-only-arguments>`.
tr: Eğer :func:`help` çağrılırken bir fonksiyonun parametre listesinde eğik çizgi(/) bulunuyorsa, bu, eğik çizgiden önceki parametrelerin yalnızca konumsal olduğu anlamına gelir. Daha fazla bilgi için :ref:`yalnızca konumsalparametrelerle ilgili SSS girişi <faq-positional-only-arguments>` 'ne bakınız.

source: This function is added to the built-in namespace by the :mod:`site` module.
tr: Bu fonksiyon :mod:`site` modülü tarafından yerleşik ad alanına eklenir.

source: Changes to :mod:`pydoc` and :mod:`inspect` mean that the reported signatures for callables are now more comprehensive and consistent.
tr: :mod:`pydoc` ve :mod:`inspect` 'e gelen değişiklikler, çağrılabilir nesneler için rapor edilen damgaların artık daha kapsamlı ve tutarlı olduğunu ifade eder.

source: Convert an integer number to a lowercase hexadecimal string prefixed with "0x". If *x* is not a Python :class:`int` object, it has to define an :meth:`__index__` method that returns an integer. Some examples:
tr: Bir tam sayıyı küçük harflerden oluşan ve "0x" ile başlayan onaltılık bir dizeye dönüştürür. Eğer *x* Python :class:`int` nesnesi değilse, tam sayı döndüren bir :meth:`__index__` metoduna sahip olmalidir. Bazı örnekler:

source: If you want to convert an integer number to an uppercase or lower hexadecimal string with prefix or not, you can use either of the following ways:
tr: Eğer bir tam sayıyı büyük harf-küçük harf, önekli-öneksiz bir onaltılık sayıya dönüştürmek istiyorsanız, aşağıdaki yolları kullanabilirsiniz:

source: See also :func:`int` for converting a hexadecimal string to an integer using a base of 16.
tr: Ayrıca onaltılık bir dizgiyi 16 tabanını kullanarak bir tam sayıya dönüştürmek için :func:`int` 'e bakınız.

source: To obtain a hexadecimal string representation for a float, use the :meth:`float.hex` method.
tr: Bir gerçel sayıdan onaltılık bir dize gösterimi elde etmek için :meth:`float.hex` metodunu kullanın.

source: Return the "identity" of an object. This is an integer which is guaranteed to be unique and constant for this object during its lifetime. Two objects with non-overlapping lifetimes may have the same :func:`id` value.
tr: Bir nesnenin "kimlik" 'ini döndürür. Bu nesnenin ömrü boyunca eşsiz ve sabit olduğu garanti edilen bir tam sayıdır. Ömürleri örtüşmeyen iki nesne aynı :func:`id` değerine sahip olabilir.

source: This is the address of the object in memory.
tr: Bu, bellekteki nesnenin adresidir.

source: Raises an :ref:`auditing event <auditing>` ``builtins.id`` with argument ``id``.
tr: ``id`` argümanıyla beraber bir :ref:`denetleme olayı <auditing>` ``builtins.id`` ortaya çıkartır.

source: If the *prompt* argument is present, it is written to standard output without a trailing newline. The function then reads a line from input, converts it to a string (stripping a trailing newline), and returns that. When EOF is read, :exc:`EOFError` is raised. Example::
tr: Eğer *prompt* argümanı bulunuyorsa, sonunda yeni bir satır olmadan standart çıktıya yazılır. Ardından fonksiyon veri girişinden bir satır okur ve bunu bir dizeye çevirip (sondaki yeni satırı çıkartır) döndürür. EOF okunduğunda, :exc:`EOFError` istisnası ortaya çıkar. Örnek::

source: If the :mod:`readline` module was loaded, then :func:`input` will use it to provide elaborate line editing and history features.
tr: Eğer :mod:`readline` modülü yüklendiyse, :func:`input` ayrıntılı satır düzenleme ve geçmiş özellikleri sağlamak için onu kullanacaktır.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input`` with argument ``prompt``.
tr: ``prompt`` argümanıyla birlikte bir :ref:`denetleme olayı <auditing>` ``builtins.input`` ortaya çıkartır.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input`` with argument ``prompt`` before reading input
tr: Girişi okumadan önce, ``prompt`` argümanıyla birlikte bir :ref:`denetleme olayı <auditing>` ``builtins.input`` ortaya çıkartır

source: Raises an :ref:`auditing event <auditing>` ``builtins.input/result`` with argument ``result``.
tr: ``result`` argümanıyla birlikte bir :ref:`denetleme olayı <auditing>` ``builtins.input/result`` ortaya çıkartır.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input/result`` with the result after successfully reading input.
tr: Girişi başarıyla okuduktan sonra sonuçla birlikte bir :ref:`auditing event <auditing>` ``builtins.input/result`` denetleme olayı ortaya çıkarır.

source: Return an integer object constructed from a number or string *x*, or return ``0`` if no arguments are given. If *x* defines :meth:`__int__`, ``int(x)`` returns ``x.__int__()``. If *x* defines :meth:`__index__`, it returns ``x.__index__()``. If *x* defines :meth:`__trunc__`, it returns ``x.__trunc__()``. For floating point numbers, this truncates towards zero.
tr: Bir numara veya *x* dizesinden bir tam sayı oluşturur. Eğer argüman verilmediyse 0 döndürür. *x* :meth:`__int__` 'i içeriyorsa, ``int(x)`` ``x.__int__()`` 'i döndürür. *x* :meth:`__index__` 'i içeriyorsa, ``x.__index__()`` 'i döndürür. *x* :meth:`__trunc__` 'ı içeriyorsa, ``x.__trunc__()`` 'ı döndürür. Gerçel sayılar için, sayı tam sayıya çevrilir.

source: If *x* is not a number or if *base* is given, then *x* must be a string, :class:`bytes`, or :class:`bytearray` instance representing an integer in radix *base*. Optionally, the string can be preceded by ``+`` or ``-`` (with no space in between), have leading zeros, be surrounded by whitespace, and have single underscores interspersed between digits.
tr: Eğer *x* bir sayı değilse veya *base* verilmişse, *x* *base* radiksinde bir tamsayıyı temsil eden bir string, :class:`bytes` veya :class:`bytearray` örneği olmalıdır. İsteğe bağlı olarak, dizeden önce ``+`` veya ``-`` (arada boşluk olmadan) gelebilir, önünde sıfırlar olabilir, boşluklarla çevrelenebilir ve rakamlar arasına serpiştirilmiş tek alt çizgilere sahip olabilir.

source: A base-n integer string contains digits, each representing a value from 0 to n-1. The values 0--9 can be represented by any Unicode decimal digit. The values 10--35 can be represented by ``a`` to ``z`` (or ``A`` to ``Z``). The default *base* is 10. The allowed bases are 0 and 2--36. Base-2, -8, and -16 strings can be optionally prefixed with ``0b``/``0B``, ``0o``/``0O``, or ``0x``/``0X``, as with integer literals in code. For base 0, the string is interpreted in a similar way to an :ref:`integer literal in code <integers>`, in that the actual base is 2, 8, 10, or 16 as determined by the prefix. Base 0 also disallows leading zeros: ``int('010', 0)`` is not legal, while ``int('010')`` and ``int('010', 8)`` are.
tr: Bir taban-n tamsayı dizesi, her biri 0 ile n-1 arasında bir değeri temsil eden rakamlar içerir. 0--9 değerleri herhangi bir Unicode ondalık basamağı ile temsil edilebilir. 10-35 değerleri ``a`` ila ``z`` (veya ``A`` ila ``Z``) ile temsil edilebilir. Varsayılan *taban* 10'dur. İzin verilen tabanlar 0 ve 2--36'dır. Taban-2, -8 ve -16 dizelerinin önüne isteğe bağlı olarak ``0b``/``0B``, ``0o``/``0O`` veya ``0x``/``0X`` eklenebilir, tıpkı koddaki tamsayı değişmezlerinde olduğu gibi. Taban 0 için, dize :ref:`koddaki tamsayı değişmezi <integers>` 'ne benzer bir şekilde yorumlanır, gerçek taban önek tarafından belirlenen 2, 8, 10 veya 16'dır. Taban 0 ayrıca baştaki sıfırlara da izin vermez: ``int('010', 0)`` yasal değilken, ``int('010')`` ve ``int('010', 8)`` yasaldır.

source: The integer type is described in :ref:`typesnumeric`.
tr: Tam sayı tipi :ref:`typesnumeric` kısmında açıklandı.

source: If *base* is not an instance of :class:`int` and the *base* object has a :meth:`base.__index__ <object.__index__>` method, that method is called to obtain an integer for the base. Previous versions used :meth:`base.__int__ <object.__int__>` instead of :meth:`base.__index__ <object.__index__>`.
tr: Eğer *base* bir :class:`int` örneği değilse ve *base* objesi :meth:`base.__index__ <object.__index__>` metoduna sahipse, bu metot, taban için bir tamsayı elde etmek için çağrılır. Önceki sürümler :meth:`base.__index__ <object.__index__>` yerine :meth:`base.__int__ <object.__int__>` 'i kullandı.

source: Falls back to :meth:`__index__` if :meth:`__int__` is not defined.
tr: :meth:`__int__` tanımlı değilse :meth:`__index__` konumuna geri döner.

source: The delegation to :meth:`__trunc__` is deprecated.
tr: :meth:`__trunc__` yetkisi kullanımdan kaldırıldı.

source: :class:`int` string inputs and string representations can be limited to help avoid denial of service attacks. A :exc:`ValueError` is raised when the limit is exceeded while converting a string *x* to an :class:`int` or when converting an :class:`int` into a string would exceed the limit. See the :ref:`integer string conversion length limitation <int_max_str_digits>` documentation.
tr: :class:`int` dizi girişleri ve dizi gösterimleri, hizmet reddi saldırılarından (DOS) kaçınmaya yardımcı olmak için sınırlandırılabilir. :exc:`ValueError`, bir *x* dizgesini :class:`int` 'e dönüştürürken sınır aşıldığında veya :class:`int` 'i bir dizgeye dönüştürürken sınırı aştığında ortaya çıkar. :ref:`tam sayı dönüştürme uzunluk sınırlaması <int_max_str_digits>` dokümanına bakın.

source: Return ``True`` if the *object* argument is an instance of the *classinfo* argument, or of a (direct, indirect, or :term:`virtual <abstract base class>`) subclass thereof. If *object* is not an object of the given type, the function always returns ``False``. If *classinfo* is a tuple of type objects (or recursively, other such tuples) or a :ref:`types-union` of multiple types, return ``True`` if *object* is an instance of any of the types. If *classinfo* is not a type or tuple of types and such tuples, a :exc:`TypeError` exception is raised. :exc:`TypeError` may not be raised for an invalid type if an earlier check succeeds.
tr: *object* argümanı, *classinfo* argümanının bir örneğiyse veya (doğrudan, dolaylı veya :term:`sanal <abstract base class>`) alt sınıfının bir örneğiyse ``True`` döndürür. Eğer *object* verilen tipte bir nesne değilse, fonksiyon mutlaka ``False`` döndürür. *classinfo*, tür nesnelerinden oluşan bir demet (veya yinelemeli olarak, bu tür diğer demetler) veya birden çok türden bir :ref:`types-union` ise, ayrıca *object* bu verilen türlerden herhangi birinin örneği ise ``True`` döndürür. Eğer *classinfo* bir tür veya türler içeren bir tuple değilse, :exc:`TypeError` hatası ortaya çıkar. Eğer önceden yapılmış bir kontrol başarılıysa :exc:`TypeError` geçersiz bir tip için ortaya çıkmayabilir.

source: *classinfo* can be a :ref:`types-union`.
tr: *classinfo* bir :ref:`types-union` olabilir.

source: Return ``True`` if *class* is a subclass (direct, indirect, or :term:`virtual <abstract base class>`) of *classinfo*. A class is considered a subclass of itself. *classinfo* may be a tuple of class objects (or recursively, other such tuples) or a :ref:`types-union`, in which case return ``True`` if *class* is a subclass of any entry in *classinfo*. In any other case, a :exc:`TypeError` exception is raised.
tr: Eğer *class*, *classinfo* 'nun bir alt sınıfıysa (doğrudan, dolaylı, veya :term:`sanal <abstract base class>`), ``True`` döndürür. Bir sınıf kendisinin alt sınıfı olarak dikkate alınır. *classinfo* sınıf nesnelerinden oluşan bir demet (veya tekrarlı diğer benzer demetler) veya :ref:`types-union` olabilir, bu durumda eğer *class*, *classinfo* 'daki elemanlardan herhangi birinin alt sınıfıysa ``True`` döndürülür. Diğer her durumda, :exc:`TypeError` hatası ortaya çıkar.

source: Return an :term:`iterator` object. The first argument is interpreted very differently depending on the presence of the second argument. Without a second argument, *object* must be a collection object which supports the :term:`iterable` protocol (the :meth:`__iter__` method), or it must support the sequence protocol (the :meth:`__getitem__` method with integer arguments starting at ``0``). If it does not support either of those protocols, :exc:`TypeError` is raised. If the second argument, *sentinel*, is given, then *object* must be a callable object. The iterator created in this case will call *object* with no arguments for each call to its :meth:`~iterator.__next__` method; if the value returned is equal to *sentinel*, :exc:`StopIteration` will be raised, otherwise the value will be returned.
tr: Bir :term:`iterator` nesnesi döndürür. İlk parametre ikinci parametrenin sunumuna oldukça bağımlı bir şekilde yorumlanır. İkinci parametre yoksa, *nesne* :term:`iterable` protokolünü (:meth:`__iter__` metodu) destekleyen bir koleksiyon objesi olmalıdır veya dizi protokolünü (``0`` 'dan başlayarak tam sayı değerleri alan :meth:`__getitem__` metodu) desteklemelidir. Eğer bu iki protokolü de desteklemiyorsa, :exc:`TypeError` hatası ortaya çıkar. Eğer 2. argüman, *sentinel*, verildiyse, *nesne* çağırılabilir bir nesne olmalıdır. Bu durumda oluşturulan yineleyici, :meth:`~iterator.__next__` yöntemine yapılan her çağrı için hiçbir argüman olmadan *nesne* 'yi çağırır; döndürülen değer *sentinel* 'e eşitse, :exc:`StopIteration` hatası ortaya çıkar, aksi takdirde değer döndürülür.

source: See also :ref:`typeiter`.
tr: Ayrıca :ref:`typeiter` bkz.

source: One useful application of the second form of :func:`iter` is to build a block-reader. For example, reading fixed-width blocks from a binary database file until the end of file is reached::
tr: :func:`iter` 'in ikinci formunun kullanışlı uygulamalarından biri bir blok okuyucu inşaa etmektir. Örnek olarak, dosyanın sonuna ulaşılana kadar ikili bir veritabanı dosyasından sabit genişlikte bloklar okunurken::

source: Return the length (the number of items) of an object. The argument may be a sequence (such as a string, bytes, tuple, list, or range) or a collection (such as a dictionary, set, or frozen set).
tr: Bir objenin uzunluğunu (element sayısını) döndürür. Argüman bir dizi (örneğin dize, bytes, demet, liste veya aralık) veya bir koleksiyon (örneğin sözlük, küme veya dondurulmuş küme) olabilir.

source: ``len`` raises :exc:`OverflowError` on lengths larger than :data:`sys.maxsize`, such as :class:`range(2 ** 100) <range>`.
tr: ``len``, :class:`range(2 ** 100) <range>` gibi :data:`sys.maxsize` 'dan daha geniş uzunluklar için :exc:`OverflowError` hatası ortaya çıkartır.

source: Rather than being a function, :class:`list` is actually a mutable sequence type, as documented in :ref:`typesseq-list` and :ref:`typesseq`.
tr: Bir fonksiyon görevi görmektense, :ref:`typesseq-list` ve :ref:`typesseq` de anlatıldığı gibi :class:`list` bir değiştirebilir dizi çeşididir.

source: Update and return a dictionary representing the current local symbol table. Free variables are returned by :func:`locals` when it is called in function blocks, but not in class blocks. Note that at the module level, :func:`locals` and :func:`globals` are the same dictionary.
tr: Anlık yerel sembol tablosunu temsil eden bir sözlüğü günceller ve döndürür. Serbest değişkenler :func:`locals` fonksiyon bloklarında çağırıldığında onun aracılığıyla döndürülür, aynısı sınıf bloklarında geçerli değildir. Unutmayın ki modül seviyesinde, :func:`locals` ve :func:`globals` aynı sözlüklerdir.

source: The contents of this dictionary should not be modified; changes may not affect the values of local and free variables used by the interpreter.
tr: Bu sözlüğün içeriği modifiye edilmemelidir, değişiklikler yorumlayıcı tarafından kullanılan yerel ve serbest değişkenlerin değerlerini etkilemeyebilir.

source: Return an iterator that applies *function* to every item of *iterable*, yielding the results. If additional *iterables* arguments are passed, *function* must take that many arguments and is applied to the items from all iterables in parallel. With multiple iterables, the iterator stops when the shortest iterable is exhausted. For cases where the function inputs are already arranged into argument tuples, see :func:`itertools.starmap`\.
tr: *iterable* 'in her elementini *function* 'a gönderen bir yineleyici döndürür ve sonuçları sunar. Eğer ek *iterables* parametreleri verildiyse, *function* o sayıda parametre almalı ve paralel bir şekilde tüm yinelenebilir nesnelerden tüm elementleri uygulamalıdır. Birden fazla yinelenebilir nesne ile, yineleyici en kısa yinelenebilir nesne tükendiğinde durur. Fonksiyon girdilerinin zaten demetler halinde verildiği durumlar için, :func:`itertools.starmap`\ 'a bakın.

source: Return the largest item in an iterable or the largest of two or more arguments.
tr: Bir yineleyicinin veya birden fazla parametrenin en büyük elementini döndürür.

source: If one positional argument is provided, it should be an :term:`iterable`. The largest item in the iterable is returned. If two or more positional arguments are provided, the largest of the positional arguments is returned.
tr: Eğer bir konumsal parametre sağlandıysa, o bir :term:`iterable` olmalıdır. Yineleyicinin en büyük elementi döndürülür. Eğer iki veya daha fazla pozisyonel parametre sağlandıysa, pozisyonel parametrelerin en büyüğü döndürülür.

source: There are two optional keyword-only arguments. The *key* argument specifies a one-argument ordering function like that used for :meth:`list.sort`. The *default* argument specifies an object to return if the provided iterable is empty. If the iterable is empty and *default* is not provided, a :exc:`ValueError` is raised.
tr: İki tane opsiyonel anahtar kelime parametresi vardır. *key* parametresi, :meth:`list.sort` için kullanıldığı gibi bir parametre talep etme fonksiyonunu belirtir. *varsayılan* parametre, sağlanan yineleyici boş ise döndürülecek nesneyi belirtir. Eğer yineleyici boş ve *varsayılan* verilmemiş ise, :exc:`ValueError` hatası ortaya çıkar.

source: If multiple items are maximal, the function returns the first one encountered. This is consistent with other sort-stability preserving tools such as ``sorted(iterable, key=keyfunc, reverse=True)[0]`` and ``heapq.nlargest(1, iterable, key=keyfunc)``.
tr: Eğer birden fazla element en büyük ise, fonksiyon ilk rastlananı döndürür. bu ``sorted(iterable, key=keyfunc, reverse=True)[0]`` ve ``heapq.nlargest(1, iterable, key=keyfunc)`` gibi sıralama kararlılığı muhafaza eden araçlar ile uygundur.

source: The *default* keyword-only argument.
tr: *varsayılan* yalnızca anahtar kelime parametresi.

source: The *key* can be ``None``.
tr: *key* ``None`` olabilir.

source: Return a "memory view" object created from the given argument. See :ref:`typememoryview` for more information.
tr: Verilen argümandan oluşturulan bir "memory view" objesi döndürür. Daha fazla bilgi için :ref:`typememoryview` bkz.

source: Return the smallest item in an iterable or the smallest of two or more arguments.
tr: Bir yineleyicideki en küçük elementi veya birden fazla argümandan en küçüğünü döndürür.

source: If one positional argument is provided, it should be an :term:`iterable`. The smallest item in the iterable is returned. If two or more positional arguments are provided, the smallest of the positional arguments is returned.
tr: Eğer bir argüman sağlandıysa, argüman bir :term:`iterable` olmalıdır. Yineleyicinin en küçük elementi döndürülür. Eğer birden fazla argüman sağlandıysa, argümanların en küçüğü döndürülür.

source: If multiple items are minimal, the function returns the first one encountered. This is consistent with other sort-stability preserving tools such as ``sorted(iterable, key=keyfunc)[0]`` and ``heapq.nsmallest(1, iterable, key=keyfunc)``.
tr: Eğer birden fazla element minimum ise, ilk karşılaşılan döndürülür. Bu, ``sorted(iterable, key=keyfunc)[0]`` ve ``heapq.nsmallest(1, iterable, key=keyfunc)`` gibi diğer sıralama kararlılığını koruma araçlarıyla tutarlı çalışır.

source: Retrieve the next item from the :term:`iterator` by calling its :meth:`~iterator.__next__` method. If *default* is given, it is returned if the iterator is exhausted, otherwise :exc:`StopIteration` is raised.
tr: :term:`iterator` 'ın :meth:`~iterator.__next__` metodunu çağırarak sıradaki elementi getirir. Eğer *default* verildiyse ve yineleyici tükenmiş ise *default* döndürülür, aksi takdirde :exc:`StopIteration` hatası ortaya çıkar.
