Repository: python/python-docs-tr
Catalog: library/functions.po
Languages: tr

source: The second use case is to support cooperative multiple inheritance in a dynamic execution environment. This use case is unique to Python and is not found in statically compiled languages or languages that only support single inheritance. This makes it possible to implement "diamond diagrams" where multiple base classes implement the same method. Good design dictates that such implementations have the same calling signature in every case (because the order of calls is determined at runtime, because that order adapts to changes in the class hierarchy, and because that order can include sibling classes that are unknown prior to runtime).
tr: İkinci kullanım şekli dinamik yürütme ortamında işbirlikli çoklu kalıtımı desteklemektir. Bu durum Python'a özgüdür ve statik derlenen diller veya tekli kalıtımı destekleyen dillerde bulunmaz. Bu çoklu temel sınıfların aynı metodu uyguladığı "diamond diagrams" sistemini uygulamayı mümkün kılar. İyi tasarım bu tür uygulamaların her durumda aynı çağrı imzasına sahip olduğunu (çünkü çağrıların sırası yürütme zamanında belirlenir, çünkü bu sıra sınıf hiyerarşisindeki değişikliklere uyarlanır ve çalışma zamanından önce bilinmeyen kardeş sınıfları içerebilir) dikte eder.

source: For both use cases, a typical superclass call looks like this::
tr: İki kullanım durumu için de, tipik bir üst sınıf çağrısı bu şekildedir::

source: In addition to method lookups, :func:`super` also works for attribute lookups. One possible use case for this is calling :term:`descriptors <descriptor>` in a parent or sibling class.
tr: Metot aramalarına ek olarak, :func:`super` özellik aramaları için de çalışır. Bunun kullanım şekli ebeveyn veya kardeş bir sınıfta :term:`tanımlayıcılar <descriptor>` 'i çağırmaktır.

source: Note that :func:`super` is implemented as part of the binding process for explicit dotted attribute lookups such as ``super().__getitem__(name)``. It does so by implementing its own :meth:`__getattribute__` method for searching classes in a predictable order that supports cooperative multiple inheritance. Accordingly, :func:`super` is undefined for implicit lookups using statements or operators such as ``super()[name]``.
tr: :func:`super` 'ın, ``super().__getitem__(name)`` gibi açık noktalı öznitelik aramaları için bağlayan işlemin bir parçası olarak uygulanır. Sınıfları işbirlikli çoklu kalıtımı destekleyen tahmin edilebilir bir sırada aramak için kendi :meth:`__getattribute__` metodunu sağlar. Bu nedenle :func:`super`, ifadeler veya ``super()[name]`` gibi operatörler kullanarak kesin aramalar için tanımsızdır.

source: Also note that, aside from the zero argument form, :func:`super` is not limited to use inside methods. The two argument form specifies the arguments exactly and makes the appropriate references. The zero argument form only works inside a class definition, as the compiler fills in the necessary details to correctly retrieve the class being defined, as well as accessing the current instance for ordinary methods.
tr: Ayrıca, argümansız formunun yanı sıra, :func:`süper` iç metotları kullanmakla sınırlı değildir. İki parametreli form parametlerini tamı tamına belirler ve uygun karşılaştırmaları yapar. Argümansız form sadece bir sınıf tanımının içinde çalışır, derleyici tanımlanan sınıfı doğru şekilde almak ve sıradan yöntemlere geçerli örnekten erişmek için gerekli detayları doldurur.

source: For practical suggestions on how to design cooperative classes using :func:`super`, see `guide to using super() <https://rhettinger.wordpress.com/2011/05/26/super-considered-super/>`_.
tr: :func:`super` 'ı kullanarak kooperatif sınıflar tasarlamaya yönelik pratik öneriler için, `guide to using super() <https://rhettinger.wordpress.com/2011/05/26/super-considered-super/>`_ bkz.

source: Rather than being a function, :class:`tuple` is actually an immutable sequence type, as documented in :ref:`typesseq-tuple` and :ref:`typesseq`.
tr: Bir fonksiyon olmaktansa, :class:`tuple` :ref:`typesseq-tuple` ve :ref:`typesseq` 'de gösterildiği gibi düzenlenemez bir dizi türüdür.

source: With one argument, return the type of an *object*. The return value is a type object and generally the same object as returned by :attr:`object.__class__ <instance.__class__>`.
tr: Bir parametre ile, *object* 'in türünü döndürür. Döndürülen değer bir obje türüdür ve genellikle :attr:`object.__class__ <instance.__class__>` tarafından döndürülen obje ile aynıdır.

source: The :func:`isinstance` built-in function is recommended for testing the type of an object, because it takes subclasses into account.
tr: :func:`isinstance` yerleşik fonksiyonu bir objenin türünü test etmek için önerilir. Çünkü altsınıfları hesaba katar.

source: With three arguments, return a new type object. This is essentially a dynamic form of the :keyword:`class` statement. The *name* string is the class name and becomes the :attr:`~definition.__name__` attribute. The *bases* tuple contains the base classes and becomes the :attr:`~class.__bases__` attribute; if empty, :class:`object`, the ultimate base of all classes, is added. The *dict* dictionary contains attribute and method definitions for the class body; it may be copied or wrapped before becoming the :attr:`~object.__dict__` attribute. The following two statements create identical :class:`type` objects:
tr: Üç parametre ile, yeni nesne türü döndürür. Bu esasen :keyword:`class` ifadesinin dinamik biçimidir. *name* dizesi sınıfın ismidir ve :attr:`~definition.__name__` özelliği yerine gelir. *bases* demeti temel sınıfları içerir ve :attr:`~class.__bases__` özelliği yerine gelir; eğer boş ise, :class:`object`, tüm sınıfların nihai temeli eklenir. *dict* sözlüğü sınıf gövdesi için özellik ve metot tanımlamaları içerir; :attr:`~object.__dict__` özelliği yerine geçmeden önce kopyalanabilir veya sarılabilir. Aşağıdaki iki ifade birebir aynı :class:`type` nesneleri oluşturur:

source: See also :ref:`bltin-type-objects`.
tr: :ref:`bltin-type-objects` 'e de bkz.

source: Keyword arguments provided to the three argument form are passed to the appropriate metaclass machinery (usually :meth:`~object.__init_subclass__`) in the same way that keywords in a class definition (besides *metaclass*) would.
tr: Üç değişkene sağlanan anahtar kelime argümanları, uygun metasınıf makinelerine (genellikle :meth:`~object.__init_subclass__`) bir sınıf tanımındaki anahtar sözcüklerin (*metaclass* dışında) yapacağı şekilde iletilir.

source: See also :ref:`class-customization`.
tr: :ref:`class-customization` 'a da bkz.

source: Subclasses of :class:`type` which don't override ``type.__new__`` may no longer use the one-argument form to get the type of an object.
tr: ``type.__new__`` 'in üzerine yazmayan :class:`type` altsınıfları artık bir objenin türünü almak için tek argümanlı formu kullanamaz.

source: Return the :attr:`~object.__dict__` attribute for a module, class, instance, or any other object with a :attr:`~object.__dict__` attribute.
tr: Bir modül, sınıf, örnek veya :attr:`~object.__dict__` özelliği bulunan herhangi bir obje için, :attr:`~object.__dict__` özelliğini döndürür.

source: Objects such as modules and instances have an updateable :attr:`~object.__dict__` attribute; however, other objects may have write restrictions on their :attr:`~object.__dict__` attributes (for example, classes use a :class:`types.MappingProxyType` to prevent direct dictionary updates).
tr: Modüller ve örnekler gibi nesneler güncellenebilir bir :attr:`~object.__dict__` özelliğine sahiptir; ama diğer nesnelerin kendilerinin :attr:`~object.__dict__` özelliklerine yazma kısıtlaması olabilir (örnek olarak, sınıflar doğrudan sözlük güncellemelerini önlemek için :class:`types.MappingProxyType` sınıfını kullanırlar).

source: Without an argument, :func:`vars` acts like :func:`locals`. Note, the locals dictionary is only useful for reads since updates to the locals dictionary are ignored.
tr: Parametre olmadan, :func:`vars` :func:`locals` gibi davranır. Yerel sözlük, ona yapılan güncellemeler görmezden gelindiğinden ötürü, sadece okuma işlemi için kullanışlıdır.

source: A :exc:`TypeError` exception is raised if an object is specified but it doesn't have a :attr:`~object.__dict__` attribute (for example, if its class defines the :attr:`~object.__slots__` attribute).
tr: Eğer bir obje belirtildiyse ama :attr:`~object.__dict__` özelliği yoksa (örneğin, :attr:`~object.__slots__` özelliğini tanımlayan bir sınıf ise), :exc:`TypeError` hatası ortaya çıkar.

source: Iterate over several iterables in parallel, producing tuples with an item from each one.
tr: Paralel olarak birkaç yinelenebilir nesneyi yineler ve hepsinden bir element alarak bir demet üretir.

source: Example::
tr: Örnek::

source: More formally: :func:`zip` returns an iterator of tuples, where the *i*-th tuple contains the *i*-th element from each of the argument iterables.
tr: Daha resmice: :func:`zip` demetlerden oluşan ve *i* inci demetin her parametre yineleyicisinden *i* 'inci elementi içerdiği bir yineleyici döndürür.

source: Another way to think of :func:`zip` is that it turns rows into columns, and columns into rows. This is similar to `transposing a matrix <https://en.wikipedia.org/wiki/Transpose>`_.
tr: :func:`zip` 'i anlamanın başka bir yolu da, sütunları satırlara ve satırları sütunlara çevirmesidir. Bu `transposing a matrix <https://en.wikipedia.org/wiki/Transpose>`_ 'a benzer.

source: :func:`zip` is lazy: The elements won't be processed until the iterable is iterated on, e.g. by a :keyword:`!for` loop or by wrapping in a :class:`list`.
tr: :func:`zip` tembeldir: Yinelenebilir nesne, örneğin bir :keyword:`!for` döngüsü veya :class:`list` tarafından sarılarak yinelenmediği sürece elementler işlenmez.

source: One thing to consider is that the iterables passed to :func:`zip` could have different lengths; sometimes by design, and sometimes because of a bug in the code that prepared these iterables. Python offers three different approaches to dealing with this issue:
tr: Dikkate alınması gereken şeylerden biri de :func:`zip` 'e verilen yineleyiciler bazen tasarım gereği, bazen ise yineleyicileri hazırlayan kodda oluşan bir hatadan dolayı farklı uzunluklarda olabilirler. Python bununla başa çıkmak için üç farklı yaklaşım sunar:

source: By default, :func:`zip` stops when the shortest iterable is exhausted. It will ignore the remaining items in the longer iterables, cutting off the result to the length of the shortest iterable::
tr: Varsayılan olarak, :func:`zip` en kısa yinelenebilir nesne tükendiğinde durur. Daha uzun yinelebilirlerde kalan elementleri görmezden gelecektir ve sonucu en kısa yineleyicinin uzunluğuna eşitleyecektir::

source: :func:`zip` is often used in cases where the iterables are assumed to be of equal length. In such cases, it's recommended to use the ``strict=True`` option. Its output is the same as regular :func:`zip`::
tr: :func:`zip` genellikle yineleyicilerin aynı uzunlukta olduğu varsayıldığında kullanılır. Bu gibi durumlarda, ``strict=True`` opsiyonunu kullanmak önerilir. Çıktısı sıradan :func:`zip` ile aynıdır::

source: Unlike the default behavior, it raises a :exc:`ValueError` if one iterable is exhausted before the others:
tr: Varsayılan davranışın aksine, bir yinelenebilir diğerlerinden önce tükenirse bir :exc:`ValueError` ortaya çıkar:

source: Without the ``strict=True`` argument, any bug that results in iterables of different lengths will be silenced, possibly manifesting as a hard-to-find bug in another part of the program.
tr: ``strict=True`` parametresi olmadan, farklı boyutlardaki nesnelerde sonuçlanan hatalar susturulacaktır. Mümkün olduğunca programın başka bir bölümünde bulunması zor bir hata olarak tezahür ediyor.

source: Shorter iterables can be padded with a constant value to make all the iterables have the same length. This is done by :func:`itertools.zip_longest`.
tr: Daha kısa yinelenebilir nesneler, tüm yinelenebilir nesnelerin aynı uzunlukta olması için sabit bir değerle doldurulabilirler. Bu :func:`itertools.zip_longest` tarafından yapılır.

source: Edge cases: With a single iterable argument, :func:`zip` returns an iterator of 1-tuples. With no arguments, it returns an empty iterator.
tr: Kenar durumları: Tek bir yinelenebilir nesne argümanı verilirse, :func:`zip` bir demetin yineleyicisini döndürür. Argüman verilmezse, boş bir yineleyici döndürür.

source: Tips and tricks:
tr: İpucu ve hileler:

source: The left-to-right evaluation order of the iterables is guaranteed. This makes possible an idiom for clustering a data series into n-length groups using ``zip(*[iter(s)]*n, strict=True)``. This repeats the *same* iterator ``n`` times so that each output tuple has the result of ``n`` calls to the iterator. This has the effect of dividing the input into n-length chunks.
tr: Yinelenebilir nesnelerin soldan sağa değerlendirme sırası garanti edilir. Bu, bir veri serisini ``zip(*[iter(s)]*n, strict=True)`` kullanarak n-uzunluklu gruplar halinde kümelemeyi mümkün kılar. Bu *aynı* yineleyiciyi ``n`` defa tekrar eder ve böylece tüm çıktı demetler yineleyiciye ``n`` sayıda çağrı yapmış olur. Bu, girdiyi n-uzunluklu parçalara bölme etkisine sahiptir.

source: :func:`zip` in conjunction with the ``*`` operator can be used to unzip a list::
tr: :func:`zip`, bir listeyi açmak için ``*`` operatörüyle birlikte kullanılabilir::

source: Added the ``strict`` argument.
tr: ``strict`` argümanı eklendi.

source: This is an advanced function that is not needed in everyday Python programming, unlike :func:`importlib.import_module`.
tr: Bu :func:`importlib.import_module` 'un aksine günlük Python programlamasında genel olarak kullanılmayan gelişmiş bir fonksiyondur.

source: This function is invoked by the :keyword:`import` statement. It can be replaced (by importing the :mod:`builtins` module and assigning to ``builtins.__import__``) in order to change semantics of the :keyword:`!import` statement, but doing so is **strongly** discouraged as it is usually simpler to use import hooks (see :pep:`302`) to attain the same goals and does not cause issues with code which assumes the default import implementation is in use. Direct use of :func:`__import__` is also discouraged in favor of :func:`importlib.import_module`.
tr: Bu fonksiyon :keyword:`import` ifadesi tarafından çağırılır. :keyword:`!import` ifadesinin anlamlarını değiştirmek için yenisiyle değiştirilebilir (:mod:`builtins` modülünü içe aktarıp ``builtins.__import__`` 'a devrederek), ama bunu yapmak aynı amaçlara ulaşmak için içe aktarma çengellerini kullanmak daha basit olduğundan ve içe aktarma çengellerinin kodda hatalara neden olmayacağından tavsiye **edilmez**. :func:`__import__` 'un doğrudan kullanımı da :func:`importlib.import_module` 'ın lehine tavsiye edilmez.

source: The function imports the module *name*, potentially using the given *globals* and *locals* to determine how to interpret the name in a package context. The *fromlist* gives the names of objects or submodules that should be imported from the module given by *name*. The standard implementation does not use its *locals* argument at all and uses its *globals* only to determine the package context of the :keyword:`import` statement.
tr: Fonksiyon modül *adını* içe aktarır, potansiyel olarak bir paket bağlamındaki isimleri nasıl yorumlayacağını belirlemek için verien *globals* ve *locals* 'i kullanır. *fromlist*, *name* ismiyle içe aktarılması gereken modülün alt modüllerinin ve nesnelerinin isimlerini verir. Standart uygulama *locals* argümanını kullanmaya teşebbüs etmez ve *globals* 'i :keyword:`import` ifadesinin paket bağlamını belirlemek için kullanır.

source: *level* specifies whether to use absolute or relative imports. ``0`` (the default) means only perform absolute imports. Positive values for *level* indicate the number of parent directories to search relative to the directory of the module calling :func:`__import__` (see :pep:`328` for the details).
tr: *level* mutlak mı yoksa göreli içe aktarmaların mı kullanılacağını belirtir. ``0`` (varsayılan) sadece mutlak içe aktarmaların uygulanacağını belirtir. *level* için pozitif değerler, :func:`__import__` çağrısı yapan modülün dizinine göre aranacak üst dizinlerin sayısını gösterir (detaylar için :pep:`328` 'e bakınız).

source: When the *name* variable is of the form ``package.module``, normally, the top-level package (the name up till the first dot) is returned, *not* the module named by *name*. However, when a non-empty *fromlist* argument is given, the module named by *name* is returned.
tr: *name* değişkeni ``package.module`` biçiminde olduğunda, üst düzey paket ((ilk noktaya kadar olan isim) döndürülür, *name* isimli modül *değil*. Boş olmayan bir *fromlist* argümanı verildiğinde, *name* isimli modül döndürülür.

source: For example, the statement ``import spam`` results in bytecode resembling the following code::
tr: Örnek olarak, ``import spam`` ifadesi aşağıdaki koda benzeyen bayt koduyla sonuçlanır::

source: The statement ``import spam.ham`` results in this call::
tr: ``import spam.ham`` ifadesi şu çağrıyla sonuçlanır::

source: Note how :func:`__import__` returns the toplevel module here because this is the object that is bound to a name by the :keyword:`import` statement.
tr: Burada :func:`__import__` öğesinin üst düzey modülü nasıl döndürdüğüne dikkat edin, çünkü bu, :keyword:`import` ifadesiyle bir ada bağlanan nesnedir.

source: On the other hand, the statement ``from spam.ham import eggs, sausage as saus`` results in ::
tr: Diğer yandan, ``from spam.ham import eggs, sausage as saus`` ifadesi şöyle sonuçlanır::

source: Here, the ``spam.ham`` module is returned from :func:`__import__`. From this object, the names to import are retrieved and assigned to their respective names.
tr: Burada, ``spam.ham`` modülü :func:`__import__` 'dan döndürülür. Bu objeden, içeri aktarılacak isimler alınır ve sırasıyla adlarına atanır.

source: If you simply want to import a module (potentially within a package) by name, use :func:`importlib.import_module`.
tr: Eğer ismiyle bir modülü (potansiyel olarak bir paket içinde) içe aktarmak istiyorsanız, :func:`importlib.import_module` 'i kullanın.

source: Negative values for *level* are no longer supported (which also changes the default value to 0).
tr: *level* için negatif değerler artık desteklenmiyor (bu, varsayılan değeri 0 olarak da değiştirir).

source: When the command line options :option:`-E` or :option:`-I` are being used, the environment variable :envvar:`PYTHONCASEOK` is now ignored.
tr: Komut satırı opsiyonlarından :option:`-E` veya :option:`-I` kullanıldığında, ortam değişkeni :envvar:`PYTHONCASEOK` görmezden gelinir.

source: Footnotes
tr: Dipnotlar

source: Note that the parser only accepts the Unix-style end of line convention. If you are reading the code from a file, make sure to use newline conversion mode to convert Windows or Mac-style newlines.
tr: Ayrıştırıcının yalnızca Unix stili satır sonu kuralını kabul ettiğini unutmayın. Eğer bir dosyadan kod okuyorsanız, Windows veya Mac tarzı yeni satırları dönüştürmek için yeni satır dönüştürme modunu kullandığınızdan emin olun.
