Repository: python/python-docs-tr
Catalog: library/functions.po
Languages: tr

source: This is a relative of :func:`setattr`. The arguments are an object and a string. The string must be the name of one of the object's attributes. The function deletes the named attribute, provided the object allows it. For example, ``delattr(x, 'foobar')`` is equivalent to ``del x.foobar``. *name* need not be a Python identifier (see :func:`setattr`).
tr: :func:`setattr` fonksiyonu ile ilişkilidir . Argümanlar bir nesne ve bir dizedir. Dize nesnenin özelliklerinden birinin adı olmak zorundadır. Fonksiyon nesnenin izin vermesi koşuluyla, dizede belirtilen bu özelliği siler. Örnek olarak, ``delattr(x, 'foobar')`` , ``del x.foobar`` 'a eş değerdir. *name* bir Python tanımlayıcısı olmak zorunda değildir (:func:`setattr` bkz.).

source: Create a new dictionary. The :class:`dict` object is the dictionary class. See :class:`dict` and :ref:`typesmapping` for documentation about this class.
tr: Yeni bir sözlük yaratır. :class:`dict` nesnesi bir sözlük sınıfıdır. Bu sınıf hakkındaki dökümantasyon için :class:`dict` ve :ref:`typesmapping` 'e bakınız.

source: For other containers see the built-in :class:`list`, :class:`set`, and :class:`tuple` classes, as well as the :mod:`collections` module.
tr: Diğer konteynerler için dahili :class:`list` , :class:`set` , :class:`tuple` sınıfları ve :mod:`collections` modülüne bakınız.

source: Without arguments, return the list of names in the current local scope. With an argument, attempt to return a list of valid attributes for that object.
tr: Argüman yoksa, mevcut yerel kapsamdaki isimleri liste olarak döndürür. Argüman varsa, o nesne için geçerli özelliklerin bir listesini döndürmeye çalışır.

source: If the object has a method named :meth:`__dir__`, this method will be called and must return the list of attributes. This allows objects that implement a custom :func:`__getattr__` or :func:`__getattribute__` function to customize the way :func:`dir` reports their attributes.
tr: Eğer nesne :meth:`__dir__` adında bir metoda sahipse, bu metot çağrılır ve nesnenin özelliklerinin listesini döndürmelidir. Bu, özel bir :func:`__getattr__` veya :func:`__getattribute__` fonksiyonunu uygulayan nesnelerin, :func:`dir` 'in özellikleri bildirme şeklini özelleştirmesine izin verir.

source: If the object does not provide :meth:`__dir__`, the function tries its best to gather information from the object's :attr:`~object.__dict__` attribute, if defined, and from its type object. The resulting list is not necessarily complete and may be inaccurate when the object has a custom :func:`__getattr__`.
tr: Eğer nesne :meth:`__dir__` metodu sağlamıyorsa, fonksiyon nesnenin :attr:`~object.__dict__` özelliğinden veri toplamak için elinen gelenin en iyisini dener. Sonuç listesinin tamamlanmış olmasına gerek yoktur ve nesnenin özel bir :func:`__getattr__` fonksiyonu varsa kusurlu olabilir.

source: The default :func:`dir` mechanism behaves differently with different types of objects, as it attempts to produce the most relevant, rather than complete, information:
tr: Varsayılan :func:`dir` mekanizması, eksiksiz bilgi yerine en alakalı bilgiyi üretmeye çalıştığı için farklı nesne türleriyle farklı çalışır:

source: If the object is a module object, the list contains the names of the module's attributes.
tr: Eğer nesne bir modül nesnesiyse, liste modülün özelliklerinin isimlerini içerir.

source: If the object is a type or class object, the list contains the names of its attributes, and recursively of the attributes of its bases.
tr: Eğer nesne bir tür veya sınıf nesnesiyse, liste onun özelliklerini ve yinelemeli olarak tabanlarının özelliklerini içerir.

source: Otherwise, the list contains the object's attributes' names, the names of its class's attributes, and recursively of the attributes of its class's base classes.
tr: Aksi takdirde, liste nesnenin özelliklerini, sınıfının özelliklerini ve yinelemeli olarak sınıfının temel sınıflarının özelliklerini içerir.

source: The resulting list is sorted alphabetically. For example:
tr: Sonuç listesi alfabetik olarak sıralanmıştır. Örnek olarak:

source: Because :func:`dir` is supplied primarily as a convenience for use at an interactive prompt, it tries to supply an interesting set of names more than it tries to supply a rigorously or consistently defined set of names, and its detailed behavior may change across releases. For example, metaclass attributes are not in the result list when the argument is a class.
tr: Çünkü :func:`dir`, öncelikle etkileşimli bir komut isteminde kullanım kolaylığı sunmak amacıyla sağlanır. Titizlikle ve tutarlı bir isim kümesi sağlamaktansa ilginç bir isim kümesi sağlar, Detaylı davranışlı sürümler arasında değişikliğe uğrayabilir. Örnek olarak, argüman sınıf ise metasınıf özellikleri sonuç listesinde yer almaz.

source: Take two (non-complex) numbers as arguments and return a pair of numbers consisting of their quotient and remainder when using integer division. With mixed operand types, the rules for binary arithmetic operators apply. For integers, the result is the same as ``(a // b, a % b)``. For floating point numbers the result is ``(q, a % b)``, where *q* is usually ``math.floor(a / b)`` but may be 1 less than that. In any case ``q * b + a % b`` is very close to *a*, if ``a % b`` is non-zero it has the same sign as *b*, and ``0 <= abs(a % b) < abs(b)``.
tr: Argüman olarak iki (karmaşık olmayan) sayı alır ve bölme işlemi yapılırken bu argümanların bölümleri ve kalanlarından oluşan bir sayı çifti döndürür. Karışık işlenen türlerinde, ikili aritmetik işleçler için geçerli olan kurallar geçerlidir. Sonuç tam sayılar için ``(a // b, a % b)`` , Gerçel sayılar için ``(q, a % b)`` (*q* genellikle ``math.floor(a / b)`` 'ye eşit ama bundan 1 eksik olabilir). Her durumda ``q * b + a % b`` , *a* 'ya çok yakındır. Eğer ``a % b`` sıfır değilse, *b* ile aynı işarete sahiptir ve ``0 <= abs(a % b) < abs(b)``.

source: Return an enumerate object. *iterable* must be a sequence, an :term:`iterator`, or some other object which supports iteration. The :meth:`~iterator.__next__` method of the iterator returned by :func:`enumerate` returns a tuple containing a count (from *start* which defaults to 0) and the values obtained from iterating over *iterable*.
tr: Bir numaralandırma nesnesi döndürür. *iterable* bir dize, :term:`iterator` veya tekrarlamayı destekleyen başka bir nesne olmalıdır. Yineleyicinin by :func:`enumerate` tarafından döndürülen :meth:`~iterator.__next__` metodu bir sayıyı (varsayılan olarak 0 olan *start* 'dan) ve *iterable* üzerinde yinelemeden elde edilen değerleri içeren bir demet döndürür.

source: Equivalent to::
tr: Şuna eşittir::

source: The arguments are a string and optional globals and locals. If provided, *globals* must be a dictionary. If provided, *locals* can be any mapping object.
tr: Argümanlar bir dize veya opsiyonel global ve yerel değişkenler olabilir. Sağlanırsa, *globals* bir sözlük olmalıdır. Sağlanırsa, *locals* herhangi bir haritalama nesnesi olabilir.

source: The *expression* argument is parsed and evaluated as a Python expression (technically speaking, a condition list) using the *globals* and *locals* dictionaries as global and local namespace. If the *globals* dictionary is present and does not contain a value for the key ``__builtins__``, a reference to the dictionary of the built-in module :mod:`builtins` is inserted under that key before *expression* is parsed. That way you can control what builtins are available to the executed code by inserting your own ``__builtins__`` dictionary into *globals* before passing it to :func:`eval`. If the *locals* dictionary is omitted it defaults to the *globals* dictionary. If both dictionaries are omitted, the expression is executed with the *globals* and *locals* in the environment where :func:`eval` is called. Note, *eval()* does not have access to the :term:`nested scopes <nested scope>` (non-locals) in the enclosing environment.
tr: *expression* bağımsız değişkeni, genel ve yerel ad alanı olarak *globals* ve *locals* sözlükleri kullanılarak Python ifadesi (teknik olarak bir koşul listesi) olarak ayrıştırılır ve değerlendirilir. *globals* sözlüğü varsa ve ``__builtins__`` anahtarı için bir değer içermiyorsa, *expression* ayrıştırılmadan önce bu anahtarın altına yerleşik modül :mod:`builtins` sözlüğüne bir referans eklenir. Bu şekilde, kendi ``__builtins__`` sözlüğünüzü :func:`eval` içine geçirmeden önce *globals* içine ekleyerek yürütülen kod için hangi yerleşiklerin kullanılabilir olduğunu kontrol edebilirsiniz. *locals* sözlüğü atlanırsa, varsayılan olarak *globals* sözlüğünü kullanır. Her iki sözlük de atlanırsa, ifade :func:`eval` olarak adlandırılan ortamda *globals* ve *locals* ile yürütülür. Not, *eval()* kapsama ortamında :term:`iç içe kapsamlar <nested scope>` (yerel olmayan) erişimi yoktur.

source: The return value is the result of the evaluated expression. Syntax errors are reported as exceptions. Example:
tr: Dönen değer değerlendirilmiş ifadenin sonucudur. Söz dizimi hataları, istisnalar olarak rapor edilir. Örnek:

source: This function can also be used to execute arbitrary code objects (such as those created by :func:`compile`). In this case, pass a code object instead of a string. If the code object has been compiled with ``'exec'`` as the *mode* argument, :func:`eval`\'s return value will be ``None``.
tr: Bu fonksiyon keyfi kod nesnelerini (:func:`compile` tarafından oluşturulanlar gibi) çalıştırmak için de kullanılabilir. Bu durumda, dize yerine bir kod nesnesi iletin. Eğer kod nesnesi *mode* argümanı olarak ``'exec'`` ile derlendiyse, :func:`eval` 'in döndürdüğü değer ``None`` olacaktır.

source: Hints: dynamic execution of statements is supported by the :func:`exec` function. The :func:`globals` and :func:`locals` functions return the current global and local dictionary, respectively, which may be useful to pass around for use by :func:`eval` or :func:`exec`.
tr: İpuçları: ifadelerin dinamik yürütmeleri :func:`exec` fonksiyonu tarafından desteklenir. :func:`globals` ve :func:`locals` fonksiyonları sırasıyla mevcut global ve yerel sözlüğü döndürür. :func:`eval` veya :func:`exec` tarafından kullanım için dolaşmak yararlı olabilir.

source: If the given source is a string, then leading and trailing spaces and tabs are stripped.
tr: Eğer verilen kaynak dize ise, baştaki ve sondaki boşluklar ve tab'lar çıkarılır.

source: See :func:`ast.literal_eval` for a function that can safely evaluate strings with expressions containing only literals.
tr: Sadece kalıp içeren ifadelerle dizeleri güvenli bir şekilde değerlendirebilen bir fonksiyon arıyorsanız, :func:`ast.literal_eval` 'a bakınız.

source: Raises an :ref:`auditing event <auditing>` ``exec`` with argument ``code_object``.
tr: ``code_object`` argümanıyla bir :ref:`denetleme olayı <auditing>` ``exec`` hatası ortaya çıkarır.

source: Raises an :ref:`auditing event <auditing>` ``exec`` with the code object as the argument. Code compilation events may also be raised.
tr: Argüman olarak kod nesnesi ile bir :ref:`denetleme olayı <auditing>` ``exec`` hatası ortaya çıkartır. Kodun derlendiği sırada çıkan hatalar da yükseltilir.

source: This function supports dynamic execution of Python code. *object* must be either a string or a code object. If it is a string, the string is parsed as a suite of Python statements which is then executed (unless a syntax error occurs). [#]_ If it is a code object, it is simply executed. In all cases, the code that's executed is expected to be valid as file input (see the section :ref:`file-input` in the Reference Manual). Be aware that the :keyword:`nonlocal`, :keyword:`yield`, and :keyword:`return` statements may not be used outside of function definitions even within the context of code passed to the :func:`exec` function. The return value is ``None``.
tr: Bu fonksiyon Python kodunun dinamik çalıştırılmasını destekler. *object* bir kod objesi veya dize olmalıdır. Dize ise, dize daha sonra yürütülen bir Python ifadeleri paketi olarak ayrıştırılır (bir sözdizimi hatası olmadıkça). [#]_ eğer bir kod objesiyse, sadece çalıştırılır. Her durumda, çalıştırılacak kodun dosya girişi olarak geçerli olması beklenir (Referans Kılavuzundaki :ref:`file-input` kısmına bakınız). :keyword:`nonlocal`, :keyword:`yield`, ve :keyword:`return` ifadelerinin :func:`exec` fonksiyonuna geçirilen kod kaynağında bile fonksiyonlar dışında kullanılamayacağını unutmayınız. Döndürülen değer ``None`` 'dır.

source: In all cases, if the optional parts are omitted, the code is executed in the current scope. If only *globals* is provided, it must be a dictionary (and not a subclass of dictionary), which will be used for both the global and the local variables. If *globals* and *locals* are given, they are used for the global and local variables, respectively. If provided, *locals* can be any mapping object. Remember that at the module level, globals and locals are the same dictionary. If exec gets two separate objects as *globals* and *locals*, the code will be executed as if it were embedded in a class definition.
tr: Her durumda eğer opsiyonal kısımlar atlandıysa, kod mevcut kapsamda çalıştırılır. Eğer sadece *globals* sağlandıysa, global ve yerel değişkenler için kullanılacak bir sözlük olmalıdır (bir sözlüğün alt sınıfı değil). Eğer *globals* ve *locals* sağlandıysa, global ve yerel değişkenler için sırasıyla kullanılırlar. Eğer sağlandıysa, *locals* herhangi bir haritalama objesi olabilir. Modül seviyesinde global ve yerel değişkenlerin aynı sözlükte bulunduğunu unutmayın. Eğer exec *globals* ve *locals* olarak iki ayrı nesne alırsa, kod bir sınıf tanımına gömülmüş gibi çalıştırılacaktır.

source: If the *globals* dictionary does not contain a value for the key ``__builtins__``, a reference to the dictionary of the built-in module :mod:`builtins` is inserted under that key. That way you can control what builtins are available to the executed code by inserting your own ``__builtins__`` dictionary into *globals* before passing it to :func:`exec`.
tr: Eğer *globals* sözlüğü ``__builtins__`` anahtarı için bir değer içermiyorsa, bu anahtarın altına bir referans yerleşik modül :mod:`builtins` 'in sözlüğüne eklenir. Bu şekilde, kendi ``__builtins__`` sözlüğünüzü :func:`exec` 'e geçirmeden önce *globals* içine ekleyerek yürütülen kod için hangi yerleşiklerin mevcut olduğunu kontrol edebilirsiniz.

source: The *closure* argument specifies a closure--a tuple of cellvars. It's only valid when the *object* is a code object containing free variables. The length of the tuple must exactly match the number of free variables referenced by the code object.
tr: *closure* argümanı, bir hücre değişkenleri demeti olan bir kapatmayı belirtir. Yalnızca *nesne* serbest değişkenler içeren bir kod nesnesi olduğunda geçerlidir. Demetin uzunluğu, kod nesnesi tarafından başvurulan serbest değişkenlerin sayısıyla tam olarak eşleşmelidir.

source: The built-in functions :func:`globals` and :func:`locals` return the current global and local dictionary, respectively, which may be useful to pass around for use as the second and third argument to :func:`exec`.
tr: Yerleşik :func:`globals` ve :func:`locals` fonksiyonları mevcut global ve yerel sözlüğü sırasıyla döndürür. Bu, :func:`exec` 'e ikinci ve üçüncü argüman olarak kullanılmak üzere geçirmek için yararlı olabilir.

source: The default *locals* act as described for function :func:`locals` below: modifications to the default *locals* dictionary should not be attempted. Pass an explicit *locals* dictionary if you need to see effects of the code on *locals* after function :func:`exec` returns.
tr: Varsayılan *locals* davranışı aşağıda :func:`locals` fonksiyonu için açıklandığı gibi: varsayılan *locals* sözlüğünde değişiklik yapılmaya çalışılmamalıdır. :func:`exec` fonksiyonu değer döndürdükten sonra kodun *locals* üzerindeki etkilerini görmeniz gerekiyorsa, açık bir *local* sözlüğü geçirin.

source: Added the *closure* parameter.
tr: *closure* parametresi eklendi.

source: Construct an iterator from those elements of *iterable* for which *function* is true. *iterable* may be either a sequence, a container which supports iteration, or an iterator. If *function* is ``None``, the identity function is assumed, that is, all elements of *iterable* that are false are removed.
tr: *fonksiyon*'un doğru olduğu *iterable* öğelerinden bir yineleyici oluşturun. *iterable* bir dizi, yinelemeyi destekleyen bir kapsayıcı veya bir yineleyici olabilir. *fonksiyon* ``None`` ise, kimlik işlevi varsayılır, yani *iterable* öğesinin yanlış olan tüm öğeleri kaldırılır.

source: Note that ``filter(function, iterable)`` is equivalent to the generator expression ``(item for item in iterable if function(item))`` if function is not ``None`` and ``(item for item in iterable if item)`` if function is ``None``.
tr: Eğer fonksiyon ``None`` değilse ve ``(item for item in iterable if item)`` için fonksiyon ``None`` ise, ``filter(function, iterable)`` 'ın bir üretici ifadesine ``(item for item in iterable if function(item))`` eşit olduğunu unutmayın.

source: See :func:`itertools.filterfalse` for the complementary function that returns elements of *iterable* for which *function* is false.
tr: *fonksiyon*'un yanlış olduğu *iterable* öğelerini döndüren tamamlayıcı fonksiyon için :func:`itertools.filterfalse` konusuna bakın.

source: Return a floating point number constructed from a number or string *x*.
tr: Bir numara veya string *x* 'ten oluşturulan bir reel sayı döndürür.

source: If the argument is a string, it should contain a decimal number, optionally preceded by a sign, and optionally embedded in whitespace. The optional sign may be ``'+'`` or ``'-'``; a ``'+'`` sign has no effect on the value produced. The argument may also be a string representing a NaN (not-a-number), or positive or negative infinity. More precisely, the input must conform to the ``floatvalue`` production rule in the following grammar, after leading and trailing whitespace characters are removed:
tr: Eğer argüman dize ise, bir ondalık sayı içermelidir, isteğe bağlı olarak önünde bir işaret bulunabilir veya boşluk içine gömülebilir. Opsiyonel işaret ``'+'`` veya ``'-'`` olabilir; ``'+'`` işareti üretilen değerde bir etkisi yoktur. Argüman ayrıca NaN (not-a-number), pozitif sonsuz veya negatif sonsuzu temsil eden bir dize olabilir. Daha açık olmak gerekirse, baştaki ve sondaki boşluk karakterleri kaldırıldıktan sonra veri girişi aşağıdaki dilbilgisindeki ``floatvalue`` üretim kuralına uygun olmalıdır:

source: Here ``digit`` is a Unicode decimal digit (character in the Unicode general category ``Nd``). Case is not significant, so, for example, "inf", "Inf", "INFINITY", and "iNfINity" are all acceptable spellings for positive infinity.
tr: Burada ``digit`` bir Unicode ondalık basamağıdır (Unicode genel kategorisi ``Nd`` 'deki karakter). Büyük/küçük harf önemli değildir, bu nedenle, örneğin, "inf", "Inf", "INFINITY" ve "iNfINity" pozitif sonsuzluk için kabul edilebilir yazımlardır.

source: Otherwise, if the argument is an integer or a floating point number, a floating point number with the same value (within Python's floating point precision) is returned. If the argument is outside the range of a Python float, an :exc:`OverflowError` will be raised.
tr: Aksi takdirde, argüman bir tam sayı veya reel sayıysa, aynı değerde reel sayı döndürülür. Eğer argüman Python reel sayı aralığının dışındaysa, :exc:`OverflowError` hatası ortaya çıkar.

source: For a general Python object ``x``, ``float(x)`` delegates to ``x.__float__()``. If ``__float__()`` is not defined then it falls back to :meth:`__index__`.
tr: Genel bir Python nesnesi ``x`` için, ``float(x)``, ``x.__float__()`` fonksiyonuna delege eder. Eğer ``__float__()`` tanımlanmamışsa, :meth:`__index__` 'e geri döner.

source: If no argument is given, ``0.0`` is returned.
tr: Argüman verilmediyse, ``0.0`` döndürülür.

source: Examples::
tr: Örnekler::

source: The float type is described in :ref:`typesnumeric`.
tr: Float tipi :ref:`typesnumeric` kısmında açıklandı.

source: Falls back to :meth:`__index__` if :meth:`__float__` is not defined.
tr: :meth:`__float__` tanımlanmadıysa, :meth:`__index__` konumuna geri döner.

source: Convert a *value* to a "formatted" representation, as controlled by *format_spec*. The interpretation of *format_spec* will depend on the type of the *value* argument; however, there is a standard formatting syntax that is used by most built-in types: :ref:`formatspec`.
tr: Bir *value* 'ı, *format_spec* tarafından kontrol edildiği gibi "biçimlendirilmiş" bir gösterime dönüştürür. *format_spec* 'in yorumlanması *value* argümanının tipine göre değişkendir; ama, çoğu yerleşik tiplerde kullanılan :ref:`formatspec` adında bir standart biçimlendirme sözdizimi var.

source: The default *format_spec* is an empty string which usually gives the same effect as calling :func:`str(value) <str>`.
tr: Varsayılan *format_spec*, :func:`str(value) <str>` fonksiyonunu çağırmakla aynı etkiyi gösteren boş bir dizedir.

source: A call to ``format(value, format_spec)`` is translated to ``type(value).__format__(value, format_spec)`` which bypasses the instance dictionary when searching for the value's :meth:`__format__` method. A :exc:`TypeError` exception is raised if the method search reaches :mod:`object` and the *format_spec* is non-empty, or if either the *format_spec* or the return value are not strings.
tr: ``format(value, format_spec)`` çağrısı, değerin :meth:`__format__` metodunu ararken örnek sözlüğü atlayan ``type(value).__format__(value, format_spec)`` biçimine çevrilir. Eğer metot araması :mod:`object` 'e ulaşırsa ve *format_spec* boş değilse, veya *format_spec* veya döndürülen değer dize değilse, :exc:`TypeError` hatası ortaya çıkar.

source: ``object().__format__(format_spec)`` raises :exc:`TypeError` if *format_spec* is not an empty string.
tr: *format_spec* boş bir dize değilse, ``object().__format__(format_spec)``, :exc:`TypeError` hatasını ortaya çıkartır.

source: Return a new :class:`frozenset` object, optionally with elements taken from *iterable*. ``frozenset`` is a built-in class. See :class:`frozenset` and :ref:`types-set` for documentation about this class.
tr: Opsiyonel olarak *iterable* öğesinden alınan öğelerle yeni bir :class:`frozenset` nesnesi döndürür. ``frozenset`` yerleşik bir sınıftır. Bu sınıf hakkında dokümantasyona ulaşmak için :class:`frozenset` ve :ref:`types-set` 'e bakınız.

source: For other containers see the built-in :class:`set`, :class:`list`, :class:`tuple`, and :class:`dict` classes, as well as the :mod:`collections` module.
tr: Diğer konteynerler için, yerleşik :class:`set`, :class:`list`, :class:`tuple`, ve :class:`dict` sınıflarına, ayrıca :mod:`collections` modülüne bakabilirsiniz.

source: Return the value of the named attribute of *object*. *name* must be a string. If the string is the name of one of the object's attributes, the result is the value of that attribute. For example, ``getattr(x, 'foobar')`` is equivalent to ``x.foobar``. If the named attribute does not exist, *default* is returned if provided, otherwise :exc:`AttributeError` is raised. *name* need not be a Python identifier (see :func:`setattr`).
tr: *object* 'in parametre olarak verilmiş isimli özelliğinin değerini döndürür. *name* bir dize olmalıdır. Eğer dize nesnenin özelliklerinden birinin ismi ise, sonuç bu özelliğin değeri olur. Örnek olarak, ``getattr(x, 'foobar')``, ``x.foobar`` 'a eşittir. Eğer isimlendirilmiş özellik objede bulunmuyorsa, *default* sağlanmışsa döndürülür, aksi takdirde :exc:`AttributeError` hatası ortaya çıkar. *name* bir Python tanımlayıcısı olmak zorunda değildir (:func:`setattr` bkz).
