Repository: python/python-docs-tr
Catalog: library/functions.po
Languages: tr

source: Print *objects* to the text stream *file*, separated by *sep* and followed by *end*. *sep*, *end*, *file*, and *flush*, if present, must be given as keyword arguments.
tr: Metin akış *file* 'ına *sep* tarafından ayırılacak ve *end* ile bitirilecek şekilde *objects* 'i yazdırır. *sep*, *end, *file*, ve *flush* sunulursa anahtar kelime parametreleri olarak verilmelidir.

source: All non-keyword arguments are converted to strings like :func:`str` does and written to the stream, separated by *sep* and followed by *end*. Both *sep* and *end* must be strings; they can also be ``None``, which means to use the default values. If no *objects* are given, :func:`print` will just write *end*.
tr: Tüm anahtar kelime olmayan parametler :func:`str` 'in yaptığı gibi dizeye çevirilir ve *sep* tarafından ayırılıp *end* ile bitecek şekilde akışa yazdırılır. *sep* ve *end* dize veya ``None`` olmalıdır. ``None`` olduğunda varsayılan değerler kullanılır. Eğer *objects* verilmediyse, :func:`print` sadece *end* 'i yazdırır.

source: The *file* argument must be an object with a ``write(string)`` method; if it is not present or ``None``, :data:`sys.stdout` will be used. Since printed arguments are converted to text strings, :func:`print` cannot be used with binary mode file objects. For these, use ``file.write(...)`` instead.
tr: *file* parametresi ``write(string)`` metodu içeren bir obje olmalıdır; eğer sunulmamış veya ``None`` ise, :data:`sys.stdout` kullanılacaktır. Yazdırılan argümanlar metin dizelerine çevrildiğinden, :func:`print` ikili dosya nesneleri ile kullanılamaz. Bunlar için, ``file.write(...)`` 'ı kullanın.

source: Whether the output is buffered is usually determined by *file*, but if the *flush* keyword argument is true, the stream is forcibly flushed.
tr: Çıktının arabelleğe alınıp alınmadığı genellikle *file* tarafından belirlenir, ama *flush* argümanı doğru ise, akış zorla boşaltılır.

source: Added the *flush* keyword argument.
tr: *flush* anahtar kelimesi argümanı eklendi.

source: Return a property attribute.
tr: Bir özellik özelliği döndürür.

source: *fget* is a function for getting an attribute value. *fset* is a function for setting an attribute value. *fdel* is a function for deleting an attribute value. And *doc* creates a docstring for the attribute.
tr: *fget* bir özelliğin değerini almak için kullanılan bir fonksiyondur. *fset* bir özelliğin değerini ayarlamak için kullanılan bir fonksiyondur. *fdel* bir özelliğin değerini silmek için kullanılan bir fonksiyondur, ve *doc* özellik için bir belge dizisi oluşturur.

source: A typical use is to define a managed attribute ``x``::
tr: Yönetilen bir ``x`` özelliği tanımlamak için tipik bir yöntem::

source: If *c* is an instance of *C*, ``c.x`` will invoke the getter, ``c.x = value`` will invoke the setter, and ``del c.x`` the deleter.
tr: Eğer *c*, *C* 'nin bir örneğiyse, ``c.x``, alıcı fonksiyonu çağıracaktır. ``c.x = value`` ayarlayıcı fonksiyonu, ``del c.x`` ise siliciyi çağıracaktır.

source: If given, *doc* will be the docstring of the property attribute. Otherwise, the property will copy *fget*'s docstring (if it exists). This makes it possible to create read-only properties easily using :func:`property` as a :term:`decorator`::
tr: Eğer verildiyse, *doc* property özelliğinin doküman dizisi olacaktır. Aksi takdirde, property *fget* 'in (bulunuyorsa) doküman dizisini kopyalayacaktır. Bu :func:`property` 'i :term:`decorator` olarak kullanarak kolayca salt-okunur özellikler oluşturmayı mümkün kılar::

source: The ``@property`` decorator turns the :meth:`voltage` method into a "getter" for a read-only attribute with the same name, and it sets the docstring for *voltage* to "Get the current voltage."
tr: ``@property`` dekoratörü :meth:`voltage` metodunu aynı isimli salt-okunur bir özellik için "getter" metoduna dönüştürür ve *voltage* için doküman dizisini "Get the current voltage." olarak ayarlar.

source: A property object has :attr:`~property.getter`, :attr:`~property.setter`, and :attr:`~property.deleter` methods usable as decorators that create a copy of the property with the corresponding accessor function set to the decorated function. This is best explained with an example::
tr: Bir property nesnesi, dekore edilmiş metoda ayarlanan ilgili erişimci metoduyla özelliğin bir kopyasını oluşturmak için dekoratör olarak kullanılabilen :attr:`~property.getter`, :attr:`~property.setter`, ve :attr:`~property.deleter` metotlarını içerir. Bu en iyi şekilde bir örnekle açıklanabilir::

source: This code is exactly equivalent to the first example. Be sure to give the additional functions the same name as the original property (``x`` in this case.)
tr: Bu kod birinci örneğin tamamen eş değeridir. Orijinal özellikte olduğu gibi ekstra fonksiyonlara aynı ismi verdiğinizden emin olun (bu durumda ``x``).

source: The returned property object also has the attributes ``fget``, ``fset``, and ``fdel`` corresponding to the constructor arguments.
tr: Döndürülen property nesnesi yapıcı metotta verilen ``fget``, ``fset``, ve ``fdel`` özelliklerine sahiptir.

source: The docstrings of property objects are now writeable.
tr: Property nesnelerinin doküman dizeleri artık yazılabilir.

source: Rather than being a function, :class:`range` is actually an immutable sequence type, as documented in :ref:`typesseq-range` and :ref:`typesseq`.
tr: Bir metot olmaktansa, :class:`range` aslında bir değiştirilemez dizi tipidir. Daha fazla bilgi için :ref:`typesseq-range` ve :ref:`typesseq` 'e bakınız.

source: Return a string containing a printable representation of an object. For many types, this function makes an attempt to return a string that would yield an object with the same value when passed to :func:`eval`; otherwise, the representation is a string enclosed in angle brackets that contains the name of the type of the object together with additional information often including the name and address of the object. A class can control what this function returns for its instances by defining a :meth:`__repr__` method. If :func:`sys.displayhook` is not accessible, this function will raise :exc:`RuntimeError`.
tr: Bir nesnenin yazdırılabilir temsilini içeren bir dize döndürür. Birçok tür için bu fonksiyon, :func:`eval`; fonksiyonuna iletildiğinde aynı değere sahip bir nesne verecek bir dize döndürme girişiminde bulunur. Aksi halde gösterim, genellikle nesnenin adı ve adresini içeren ek bilgilerle birlikte nesnenin türünün adını içeren açılı ayraçlar içine alınmış bir dizedir. Bir sınıf, bir :meth:`__repr__` yöntemi tanımlayarak bu işlevin örnekleri için ne döndürdüğünü kontrol edebilir. :func:`sys.displayhook` erişilebilir değilse, bu fonksiyon :exc:`RuntimeError` değerini yükseltir.

source: Return a reverse :term:`iterator`. *seq* must be an object which has a :meth:`__reversed__` method or supports the sequence protocol (the :meth:`__len__` method and the :meth:`__getitem__` method with integer arguments starting at ``0``).
tr: Ters bir :term:`iterator` döndürür. *seq* :meth:`__reversed__` metodunu içeren veya dizi protokolünü (:meth:`__len__` metodu ve ``0`` ile başlayıp tam sayı argümanları alan bir :meth:`__getitem__` metodu) destekleyen bir nesne olmalıdır.

source: Return *number* rounded to *ndigits* precision after the decimal point. If *ndigits* is omitted or is ``None``, it returns the nearest integer to its input.
tr: Noktadan sonra *ndigits* basamak hassasiyetiyle *number* 'ı yuvarlar. Eğer *ndigits* verilmediyse veya ``None`` ise, *number* 'a en yakın tam sayı döndürülür.

source: For the built-in types supporting :func:`round`, values are rounded to the closest multiple of 10 to the power minus *ndigits*; if two multiples are equally close, rounding is done toward the even choice (so, for example, both ``round(0.5)`` and ``round(-0.5)`` are ``0``, and ``round(1.5)`` is ``2``). Any integer value is valid for *ndigits* (positive, zero, or negative). The return value is an integer if *ndigits* is omitted or ``None``. Otherwise, the return value has the same type as *number*.
tr: :func:`round` 'u destekleyen yerleşik yapılar için, değerler 10 üssü *ndigits* 'in en yakın katına yuvarlanır; eğer iki kat da eşitse, yuvarlama işlemi çift sayıya doğru yapılır (örneğin, ``round(0.5)`` ve ``round(-0.5)`` 'in değerleri ``0`` 'dır. ve ``round(1.5)``, ``2`` 'dir). *ndigits* için herhangi bir tamsayı değeri (pozitif, sıfır veya negatif) uygundur. *ndigits* verilmediyse veya ``None`` ise döndürülen değer bir tam sayıdır. Aksi takdirde, döndürülen değerin tipi *number* 'ınkiyle aynıdır.

source: For a general Python object ``number``, ``round`` delegates to ``number.__round__``.
tr: Genel bir Python nesnesi için ``number``, ``round`` ``number.__round__`` 'u temsil eder.

source: The behavior of :func:`round` for floats can be surprising: for example, ``round(2.675, 2)`` gives ``2.67`` instead of the expected ``2.68``. This is not a bug: it's a result of the fact that most decimal fractions can't be represented exactly as a float. See :ref:`tut-fp-issues` for more information.
tr: Gerçel sayılar için :func:`round` 'un davranışı şaşırtıcı olabilir: örneğin ``round(2.675, 2)`` beklenen gibi ``2.68`` yerine ``2.67`` sonucunu verir. Bu bir hata değil; çoğu ondalıklı kesir tamı tamına bir gerçel sayı olarak gösterilemeyeceğinden bu sonucu alıyoruz. Daha fazla bilgi için :ref:`tut-fp-issues` 'e bkz.

source: Return a new :class:`set` object, optionally with elements taken from *iterable*. ``set`` is a built-in class. See :class:`set` and :ref:`types-set` for documentation about this class.
tr: Opsiyonel olarak *iterable* 'dan alınan elementlerle yeni bir :class:`set` nesnesi döndürür. ``set`` yerleşik bir sınıftır. Bu sınıf hakkında dokümantasyon için :class:`set` ve :ref:`types-set` 'e bakınız.

source: For other containers see the built-in :class:`frozenset`, :class:`list`, :class:`tuple`, and :class:`dict` classes, as well as the :mod:`collections` module.
tr: Diğer konteynerler için, yerleşik :class:`frozenset`, :class:`list`, :class:`tuple` ve :class:`dict` sınıflarını; aynı zamanda :mod:`collections` modülüne bakınız.

source: This is the counterpart of :func:`getattr`. The arguments are an object, a string, and an arbitrary value. The string may name an existing attribute or a new attribute. The function assigns the value to the attribute, provided the object allows it. For example, ``setattr(x, 'foobar', 123)`` is equivalent to ``x.foobar = 123``.
tr: Bu :func:`getattr` 'un karşılığıdır. Argümanlar bir nesne, dize ve opsiyonel değerdir. Dize halihazırda var olan veya yeni bir özelliğe isim verebilir. Fonksiyon, nesnenin izin vermesi koşuluyla, değeri özelliğe atar. Örneğin ``setattr(x, 'foobar', 123)`` ve ``x.foobar = 123`` eş değerdir.

source: *name* need not be a Python identifier as defined in :ref:`identifiers` unless the object chooses to enforce that, for example in a custom :meth:`~object.__getattribute__` or via :attr:`~object.__slots__`. An attribute whose name is not an identifier will not be accessible using the dot notation, but is accessible through :func:`getattr` etc..
tr: *name*, nesne bunu zorunlu kılmayı seçmedikçe, örneğin özel bir :meth:`~object.__getattribute__` veya :attr:`~object.__slots__` aracılığıyla, :ref:`identifiers` içinde tanımlandığı gibi bir Python tanımlayıcısı olmak zorunda değildir. Adı tanımlayıcı olmayan bir özelliğe nokta kullanılarak erişilemez, ancak :func:`getattr` vb. aracılığıyla erişilebilir.

source: Since :ref:`private name mangling <private-name-mangling>` happens at compilation time, one must manually mangle a private attribute's (attributes with two leading underscores) name in order to set it with :func:`setattr`.
tr: :ref:`Özel isim karıştırma <private-name-mangling>`, derleme sürecinde olacağından, :func:`setattr` ile ayarlamak için özel bir niteliğin (iki alt çizgi ile başlayan nitelikler) adını manuel olarak değiştirmek gerekir.

source: Return a :term:`slice` object representing the set of indices specified by ``range(start, stop, step)``. The *start* and *step* arguments default to ``None``. Slice objects have read-only data attributes :attr:`~slice.start`, :attr:`~slice.stop`, and :attr:`~slice.step` which merely return the argument values (or their default). They have no other explicit functionality; however, they are used by NumPy and other third-party packages. Slice objects are also generated when extended indexing syntax is used. For example: ``a[start:stop:step]`` or ``a[start:stop, i]``. See :func:`itertools.islice` for an alternate version that returns an iterator.
tr: ``range(start, stop, step)`` tarafından belirtilen indekslerden oluşan kümeyi temsil eden bir :term:`slice` nesnesi döndürür. *start* ve *step* parametreleri varsayılan olarak ``None`` 'dır. Dilim nesneleri sadece parametre değerlerini (veya varsayılan değerleri) döndüren salt-okunur :attr:`~slice.start`, :attr:`~slice.stop`, ve :attr:`~slice.step` özelliklerine sahiptir. Başka belirgin işlevselliği olmasa da; NumPy ve diğer üçüncü parti paketler tarafından kullanılırlar. Dilim nesneleri, genişletilmiş indeksleme sözdizimi kullanıldığında da üretilirler. Örneğin: ``a[start:stop:step]`` veya ``a[start:stop, i]``. Yineleyici döndüren alternatif bir versiyon için :func:`itertools.islice` 'e bakınız.

source: Return a new sorted list from the items in *iterable*.
tr: *iterable* 'ın içindeki elementlerden oluşan sıralı bir liste döndürür.

source: Has two optional arguments which must be specified as keyword arguments.
tr: İsimle belirtilmesi gereken 2 opsiyonel parametresi vardır.

source: *key* specifies a function of one argument that is used to extract a comparison key from each element in *iterable* (for example, ``key=str.lower``). The default value is ``None`` (compare the elements directly).
tr: *key*, *iterable* 'ın her elementinden bir karşılaştırma anahtarı ayıklamak için kullanılan bir argümanın fonksiyonunu belirtir (örneğin, ``key=str.lower``). Varsayılan değer ``None`` 'dır (elementleri direkt karşılaştırır).

source: *reverse* is a boolean value. If set to ``True``, then the list elements are sorted as if each comparison were reversed.
tr: *reverse* bir boolean değerdir. Eğer ``True`` ise, liste elementleri tüm karşılaştırmalar tersine çevrilmiş şekilde sıralanır.

source: Use :func:`functools.cmp_to_key` to convert an old-style *cmp* function to a *key* function.
tr: Eski stil *cmp* fonksiyonunu bir *key* fonksiyonuna dönüştürmek için :func:`functools.cmp_to_key` 'yi kullanın.

source: The built-in :func:`sorted` function is guaranteed to be stable. A sort is stable if it guarantees not to change the relative order of elements that compare equal --- this is helpful for sorting in multiple passes (for example, sort by department, then by salary grade).
tr: Yerleşik :func:`sorted` fonksiyonunun stabil çalışması garantilenmiştir. Bir sıralama eşit olan elementlerin ilgili sırasını değiştirmemeyi garantiliyorsa stabildir --- bu çoklu geçişlerle sıralama (örneğin önce departman, ardından maaş sıralama) için yardımcıdır.

source: The sort algorithm uses only ``<`` comparisons between items. While defining an :meth:`~object.__lt__` method will suffice for sorting, :PEP:`8` recommends that all six :ref:`rich comparisons <comparisons>` be implemented. This will help avoid bugs when using the same data with other ordering tools such as :func:`max` that rely on a different underlying method. Implementing all six comparisons also helps avoid confusion for mixed type comparisons which can call reflected the :meth:`~object.__gt__` method.
tr: Sıralama algoritması elementler arasında sadece ``<`` karşılaştırmalarını kullanır. Bir :meth:`~object.__lt__` metodu tanımlamak sıralamak için yeterli olmasına rağmen, :PEP:`8` tüm altı :ref:`rich comparisons <comparisons>` 'ların uygulanmasını öneriyor. Bu aynı veri ile :func:`max` gibi farklı bir temel metot ile çalışan farklı sıralama araçlarını kullanırken hataları önlemeyi kolaylaştıracaktır. Tüm karşılaştırmaları uygulamak ayrıca yansıtılan :meth:`~object.__gt__` metodunu çağırabilen karmaşık tür karşılaştırmaları için karışıklığı da önler.

source: For sorting examples and a brief sorting tutorial, see :ref:`sortinghowto`.
tr: Sıralama örnekleri ve kısa sıralama öğreticisi için :ref:`sortinghowto` 'ya bakınız.

source: Transform a method into a static method.
tr: Bir metodu statik metoda dönüştürür.

source: A static method does not receive an implicit first argument. To declare a static method, use this idiom::
tr: Statik bir metot üstü kapalı şekilde bir ilk argüman almaz. Statik metot tanımlamak için bu ifadeyi kullanabilirsiniz::

source: The ``@staticmethod`` form is a function :term:`decorator` -- see :ref:`function` for details.
tr: ``@staticmethod`` ifadesi bir :term:`decorator` fonksiyonudur. -- detaylar için :ref:`function` bkz.

source: A static method can be called either on the class (such as ``C.f()``) or on an instance (such as ``C().f()``). Moreover, they can be called as regular functions (such as ``f()``).
tr: Bir statik metot sınıf üzerinden (``C.f()`` gibi) veya bir örnek üzerinden (``C().f()`` gibi) çağırılabilir. Hatta normal fonksiyonlar gibi (``f()``) de çağırılabilirler.

source: Static methods in Python are similar to those found in Java or C++. Also, see :func:`classmethod` for a variant that is useful for creating alternate class constructors.
tr: Python'daki statik metotlar Java ve C++'takilerle benzerdir. Ayrıca, sınıf için alternatif bir yapıcı metot oluşturmak isterseniz :func:`classmethod` bkz.

source: Like all decorators, it is also possible to call ``staticmethod`` as a regular function and do something with its result. This is needed in some cases where you need a reference to a function from a class body and you want to avoid the automatic transformation to instance method. For these cases, use this idiom::
tr: Tüm dekoratörler gibi, ``staticmethod`` 'u normal bir fonksiyon gibi çağırmak ve sonucu ile bir şeyler yapmak mümkündür. Bu, bir sınıfın fonksiyonuna referans vermeniz gerektiğinde ve örnek metoda otomatik dönüşümü engellemek istediğinizde işinize yarayabilir. Böyle durumlar için, bu ifadeyi kullanabilirsiniz::

source: For more information on static methods, see :ref:`types`.
tr: Statik metotlar hakkında daha fazla bilgi için, :ref:`types` bkz.

source: Static methods now inherit the method attributes (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` and ``__annotations__``), have a new ``__wrapped__`` attribute, and are now callable as regular functions.
tr: Statik metotlar artık metot özelliklerini (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` and ``__annotations__``) miras alır, yeni bir ``__wrapped__`` özellikleri var ve artık normal fonksiyonlar gibi çağırılabilirler.

source: Return a :class:`str` version of *object*. See :func:`str` for details.
tr: *object* 'in :class:`str` versiyonunu döndürür. Detaylar için :func:`str` bkz.

source: ``str`` is the built-in string :term:`class`. For general information about strings, see :ref:`textseq`.
tr: ``str`` yerleşik dize :term:`class` 'ıdır. Dizeler hakkında genel bilgi için, :ref:`textseq` bkz.

source: Sums *start* and the items of an *iterable* from left to right and returns the total. The *iterable*'s items are normally numbers, and the start value is not allowed to be a string.
tr: *start* ve *iterable* 'ın elemanlarını soldan sağa toplar ve toplamı döndürür. *iterable* 'ın elemanları normal olarak numaralardır ve başlangıç değeri bir dize olamaz.

source: For some use cases, there are good alternatives to :func:`sum`. The preferred, fast way to concatenate a sequence of strings is by calling ``''.join(sequence)``. To add floating point values with extended precision, see :func:`math.fsum`\. To concatenate a series of iterables, consider using :func:`itertools.chain`.
tr: Bazı kullanım durumları için, :func:`sum` fonksiyonuna iyi alternatifler var. Dizelerden oluşan bir diziyi birleştirmek için tercih edilen hızlı yöntem ``''.join(sequence)`` fonksiyonudur. Gerçel değerleri hassas bir şekilde eklemek istiyorsanız, :func:`math.fsum`\ bkz. Yinelenebilir nesnelerden oluşan bir diziyi birleştirmek istiyorsanız, :func:`itertools.chain` fonksiyonunu kullanmayı göz önünde bulundurun.

source: The *start* parameter can be specified as a keyword argument.
tr: *start* parametresi bir anahtar kelime argümanı olarak belirtilebilir.

source: Return a proxy object that delegates method calls to a parent or sibling class of *type*. This is useful for accessing inherited methods that have been overridden in a class.
tr: *type* 'ın ebeveyn veya kardeş sınıfına yapılan metot çağrılarını temsil eden bir proxy objesi döndürür. Bu bir sınıfta üzerine yazılmış kalıtılan metotlara erişmek için kullanışlıdır.

source: The *object_or_type* determines the :term:`method resolution order` to be searched. The search starts from the class right after the *type*.
tr: *object_or_type* aranacak :term:`method resolution order` 'nı belirler. Arama *type* 'dan sonraki ilk sınıftan başlar.

source: For example, if :attr:`~class.__mro__` of *object_or_type* is ``D -> B -> C -> A -> object`` and the value of *type* is ``B``, then :func:`super` searches ``C -> A -> object``.
tr: Örnek olarak, eğer *object_or_type* 'ın :attr:`~class.__mro__` özelliği ``D -> B -> C -> A -> object`` ise ve *type* değeri ``B`` ise, :func:`super` ``C -> A -> object`` 'i arar.

source: The :attr:`~class.__mro__` attribute of the *object_or_type* lists the method resolution search order used by both :func:`getattr` and :func:`super`. The attribute is dynamic and can change whenever the inheritance hierarchy is updated.
tr: *object_or_type* 'ın :attr:`~class.__mro__` özelliği, hem :func:`getattr` hem de :func:`super` tarafından kullanılan yöntem çözümleme arama sırasını listeler. Özellik dinamiktir ve kalıtım hiyerarşisi her güncellendiğinde değişebilir.

source: If the second argument is omitted, the super object returned is unbound. If the second argument is an object, ``isinstance(obj, type)`` must be true. If the second argument is a type, ``issubclass(type2, type)`` must be true (this is useful for classmethods).
tr: Eğer ikinci parametre atlanırsa, döndürülen süper objesi serbesttir. Eğer ikinci parametre bir objeyse, ``isinstance(obj, type)`` doğru olmak zorundadır. Eğer ikinci parametre bir tür ise, ``issubclass(type2, type)`` doğru olmak zorundadır (bu sınıf metotları için kullanışlıdır).

source: There are two typical use cases for *super*. In a class hierarchy with single inheritance, *super* can be used to refer to parent classes without naming them explicitly, thus making the code more maintainable. This use closely parallels the use of *super* in other programming languages.
tr: *super* için tipik iki kullanım şekli vardır. Tek kalıtımlı bir sınıf hiyerarşisinde *super* üst sınıfları açıkça adlandırmadan onlara başvurmak için kullanılabilir. böylece kodu daha sürdürülebilir hale getirir.
