Repository: python/python-docs-tr
Catalog: library/functions.po
Languages: tr

source: Return a new featureless object. :class:`object` is a base for all classes. It has methods that are common to all instances of Python classes. This function does not accept any arguments.
tr: Yeni bir niteliksiz nesne döndürür. :class:`object` tüm sınıflar için temeldir. Tüm Python sınıflarında bulunan genel metotları içerir. Bu fonksiyon hiçbir argüman kabul etmez.

source: :class:`object` does *not* have a :attr:`~object.__dict__`, so you can't assign arbitrary attributes to an instance of the :class:`object` class.
tr: :class:`object`, :attr:`~object.__dict__` özelliğine sahip *değildir*, yani bir :class:`object` örneğine keyfi özellikler atayamazsınız.

source: Convert an integer number to an octal string prefixed with "0o". The result is a valid Python expression. If *x* is not a Python :class:`int` object, it has to define an :meth:`__index__` method that returns an integer. For example:
tr: Bir tamsayıyı "0o" ön ekiyle oktal bir dizeye çevirir. Sonuç geçerli bir Python ifadesidir. Eğer *x* bir Python :class:`int` nesnesi değilse, tamsayı döndüren bir :meth:`__index__` metoduna sahip olmalıdır. Örnek olarak:

source: If you want to convert an integer number to an octal string either with the prefix "0o" or not, you can use either of the following ways.
tr: Eğer bir tamsayıyı "0o" ön ekiyle veya ön eksiz oktal bir dizeye dönüştürmek istiyorsanız, aşağıdaki yolları kullanabilirsiniz.

source: Open *file* and return a corresponding :term:`file object`. If the file cannot be opened, an :exc:`OSError` is raised. See :ref:`tut-files` for more examples of how to use this function.
tr: *file* 'ı açar ve buna karşılık gelen :term:`file object` 'i döndürür. Eğer dosya açılamazsa, :exc:`OSError` hatası ortaya çıkar. Bu fonksiyonun nasıl kullanıldığına dair daha fazla örnek için :ref:`tut-files` bkz.

source: *file* is a :term:`path-like object` giving the pathname (absolute or relative to the current working directory) of the file to be opened or an integer file descriptor of the file to be wrapped. (If a file descriptor is given, it is closed when the returned I/O object is closed unless *closefd* is set to ``False``.)
tr: *file*, açılan dosyanın açılması veya dosyanın bir tam sayı dosya tanımlayıcısının paketlenmesi için bir yol adını (mutlak veya geçerli çalışma dizinine göre) veren :term:`path-like object` 'dir. (Eğer bir dosya açıklayıcısı veirldiyse, *closefd*, ``False`` 'a ayarlanmadığı sürece I/O nesnesi kapatıldığında kapatılır.

source: *mode* is an optional string that specifies the mode in which the file is opened. It defaults to ``'r'`` which means open for reading in text mode. Other common values are ``'w'`` for writing (truncating the file if it already exists), ``'x'`` for exclusive creation, and ``'a'`` for appending (which on *some* Unix systems, means that *all* writes append to the end of the file regardless of the current seek position). In text mode, if *encoding* is not specified the encoding used is platform-dependent: :func:`locale.getencoding()` is called to get the current locale encoding. (For reading and writing raw bytes use binary mode and leave *encoding* unspecified.) The available modes are:
tr: *mode* dosyanın açılacağı modu belirten opsiyonel bir dizedir. Varsayılan olarak metin modunda okuma anlamına gelen ``'r'`` değerini alır. Diğer sıradan değerler yazmak için (dosya zaten varsa kesilir) ``'w'``, ayrıcalıklı oluşturma için ``'x'`` ve dosyaya ekleme yapmak için (*bazı* Unix sistemlerinde, *hepsi* o anki imleç pozisyonundan bağımsız dosyanın sonuna ekleme anlamına gelir). Metin modunda, *encoding* belirtilmemiş ise kullanılan kodlayıcı platforma bağlıdır: :func:`locale.getpreferredencoding(False)` geçerli kodlayıcıyı getirmek için çağırılır. (İşlenmemiş baytlar okumak veya yazmak için ikili modu kullanın ve *encoding* 'i boş bırakın. Geçerli modlar:

source: Character
tr: Karakter

source: Meaning
tr: Anlam

source: open for reading (default)
tr: okumaya açık (varsayılan)

source: open for writing, truncating the file first
tr: yazmaya açık, önce dosyayı keser

source: open for exclusive creation, failing if the file already exists
tr: ayrıcalıklı oluşturma için açık, dosya varsa hata verir

source: open for writing, appending to the end of file if it exists
tr: yazmaya açık, eğer dosya bulunuyorsa dosyaya ekleme yapar

source: binary mode
tr: ikili mod

source: text mode (default)
tr: metin modu (varsayılan)

source: open for updating (reading and writing)
tr: güncellemeye açık (okuma ve yazma)

source: The default mode is ``'r'`` (open for reading text, a synonym of ``'rt'``). Modes ``'w+'`` and ``'w+b'`` open and truncate the file. Modes ``'r+'`` and ``'r+b'`` open the file with no truncation.
tr: Varsayılan mod ``'r'`` (okumaya açık, ``'rt'`` 'nin eşanlamlısı.) 'dir. ``'w+'`` ve ``'w+b'`` modları dosyayı açar ve temizlerler. ``'r+'`` ve ``'r+b'`` modları dosyayı temizlemeden açarlar.

source: As mentioned in the :ref:`io-overview`, Python distinguishes between binary and text I/O. Files opened in binary mode (including ``'b'`` in the *mode* argument) return contents as :class:`bytes` objects without any decoding. In text mode (the default, or when ``'t'`` is included in the *mode* argument), the contents of the file are returned as :class:`str`, the bytes having been first decoded using a platform-dependent encoding or using the specified *encoding* if given.
tr: :ref:`io-overview` 'de bahsedildiği gibi, Python ikili ve metin I/O arasında ayrım yapar. İkili modda (*mode* parametresinde ``'b'`` 'yi içererek) açılan dosyalar, içerikleri :class:`bytes` nesneleri halinde deşifre etmeden döndürür. Metin modunda (varsayılan, veya *mode* parametresinde ``'t'`` içerildiğinde), dosyanın içeriği :class:`str` olarak döndürülür, baytlar platforma bağlı bir kodlayıcı veya belirtilen *encoding* 'i kullanarak deşifre edilir.

source: Python doesn't depend on the underlying operating system's notion of text files; all the processing is done by Python itself, and is therefore platform-independent.
tr: Python, temel alınan işletim sisteminin metin dosyaları kavramına bağlı değildir. Tüm işlemler Python'un kendisi tarafından yapılır ve bu yüzden de platformdan bağımsızdır.

source: *buffering* is an optional integer used to set the buffering policy. Pass 0 to switch buffering off (only allowed in binary mode), 1 to select line buffering (only usable in text mode), and an integer > 1 to indicate the size in bytes of a fixed-size chunk buffer. Note that specifying a buffer size this way applies for binary buffered I/O, but ``TextIOWrapper`` (i.e., files opened with ``mode='r+'``) would have another buffering. To disable buffering in ``TextIOWrapper``, consider using the ``write_through`` flag for :func:`io.TextIOWrapper.reconfigure`. When no *buffering* argument is given, the default buffering policy works as follows:
tr: *buffering*, arabelleğe alma ilkesini ayarlamak için kullanılan isteğe bağlı bir tamsayıdır. Arabelleğe almayı kapatmak için 0 (yalnızca ikili modda izin verilir), satır arabelleğini seçmek için 1 (yalnızca metin modunda kullanılabilir) ve sabit boyutlu yığın arabelleğinin bayt cinsinden boyutunu belirtmek için birden büyük bir tam sayı iletin. Bir arabellek boyutunu bu şekilde belirtmenin ikili arabelleğe alınmış G/Ç için geçerli olduğunu unutmayın, ancak ``TextIOWrapper`` (yani, ``mode='r+'`` ile açılan dosyalar) başka bir arabelleğe alır. ``TextIOWrapper`` arabelleğe almayı devre dışı bırakmak için, :func:`io.TextIOWrapper.reconfigure` için ``write_through`` bayrağını kullanmayı düşünün. *arabelleğe alma* bağımsız değişkeni verilmediğinde, varsayılan arabelleğe alma ilkesi şu şekilde çalışır:

source: Binary files are buffered in fixed-size chunks; the size of the buffer is chosen using a heuristic trying to determine the underlying device's "block size" and falling back on :attr:`io.DEFAULT_BUFFER_SIZE`. On many systems, the buffer will typically be 4096 or 8192 bytes long.
tr: İkili dosyalar sabit boyutlu yığınlarda arabelleğe alınır; arabelleğin boyutu temel cihazın "blok boyutu"'nu belirlemek için buluşsal bir deney kullanılarak seçilir ve :attr:`io.DEFAULT_BUFFER_SIZE` değerine düşer. Çoğu sistemde, arabellek 4096 veya 8192 bayt uzunluğunda olacaktır.

source: "Interactive" text files (files for which :meth:`~io.IOBase.isatty` returns ``True``) use line buffering. Other text files use the policy described above for binary files.
tr: "İnteraktif" metin dosyaları (:meth:`~io.IOBase.isatty` 'nın ``True`` döndürdüğü dosyalar) satır arabelleğe almayı kullanır. Diğer metin dosyaları yukarıda ikili dosyalar için açıklanan poliçeyi kullanırlar.

source: *encoding* is the name of the encoding used to decode or encode the file. This should only be used in text mode. The default encoding is platform dependent (whatever :func:`locale.getencoding` returns), but any :term:`text encoding` supported by Python can be used. See the :mod:`codecs` module for the list of supported encodings.
tr: *encoding* dosyayı kodlamak veya deşifre etmek için kullanılan kodlayıcının ismidir. Bu sadece metin modunda kullanılmalıdır. Varsayılan kodlayıcı platforma bağımlıdır (:func:`locale.getpreferredencoding` ne döndürüyorsa), ama Python tarafından desteklenen herhangi bir :term:`text encoding` kullanılabilir. Desteklenen kodlayıcıların listesi için :mod:`codecs` modülüne bkz.

source: *errors* is an optional string that specifies how encoding and decoding errors are to be handled—this cannot be used in binary mode. A variety of standard error handlers are available (listed under :ref:`error-handlers`), though any error handling name that has been registered with :func:`codecs.register_error` is also valid. The standard names include:
tr: *errors* şifreleme ve deşifreleme hatalarının nasıl işleneceğini belirten opsiyonel bir dizedir—bu ikili modda kullanılamaz. Bazı standart hata işleyecileri mevcuttur (:ref:`error-handlers` 'da listelendi), ayrıca :func:`codecs.register_error` ile kaydedilen herhangi bir hata işleyici ismi de geçerlidir. Standart isimler bunları içerir:

source: ``'strict'`` to raise a :exc:`ValueError` exception if there is an encoding error. The default value of ``None`` has the same effect.
tr: ``'strict'``, bir kodlama hatası varsa bir :exc:`ValueError` istisnasını yükseltmek için kullanılır. Varsayılan değer ``None`` ile aynı etkiyi gösterir.

source: ``'ignore'`` ignores errors. Note that ignoring encoding errors can lead to data loss.
tr: ``'ignore'`` hataları görmezden gelir. Kodlayıcı hatalarını görmezden gelmenin veri kaybı ile sonuçlanabileceğini unutmayın.

source: ``'replace'`` causes a replacement marker (such as ``'?'``) to be inserted where there is malformed data.
tr: ``'replace'`` hatalı biçimlendirilmiş veri olduğunda bir yedek işaretleyici (``'?'`` gibi) 'nin hatalı biçimlendirilmiş verinin yerine geçmesine neden olur.

source: ``'surrogateescape'`` will represent any incorrect bytes as low surrogate code units ranging from U+DC80 to U+DCFF. These surrogate code units will then be turned back into the same bytes when the ``surrogateescape`` error handler is used when writing data. This is useful for processing files in an unknown encoding.
tr: ``'surrogateescape'``, hatalı baytları U+DC80'den U+DCFF'ye kadar değişen vekil kod birimleri olarak sunacaktır. Bu vekil kod birimleri sonradan ``surrogateescape`` hata işleyicisi veri yazmak için kullanıldığında aynı baytlara geri döndürülecektir. Bu dosyaları bilinmeyen bir kodlayıcıyla işlerken kullanışlıdır.

source: ``'xmlcharrefreplace'`` is only supported when writing to a file. Characters not supported by the encoding are replaced with the appropriate XML character reference ``&#nnn;``.
tr: ``'xmlcharrefreplace'`` sadece bir dosyaya veri yazarken desteklenir. Kodlayıcı tarafından desteklenmeyen karakterler uygun XML karakter örneği ile değiştirilir.

source: ``'backslashreplace'`` replaces malformed data by Python's backslashed escape sequences.
tr: ``'backslashreplace'`` Python'un ters slash kaçış karakterleri yüzünden oluşan hatalı veriyi değiştirir.

source: ``'namereplace'`` (also only supported when writing) replaces unsupported characters with ``\N{...}`` escape sequences.
tr: ``'namereplace'`` (sadece yazarken desteklenir) desteklenmeyen karakterleri ``\N{...}`` kaçış karakterleriyle değiştirir.

source: *newline* determines how to parse newline characters from the stream. It can be ``None``, ``''``, ``'\n'``, ``'\r'``, and ``'\r\n'``. It works as follows:
tr: *newline* akıştan yeni satır karakterlerinin nasıl ayrıştırılacağını belirler. ``None``, ``''``, ``'\n'``, ``'\r'`` ve ``'\r\n'`` olabilir. Aşağıdaki gibi çalışır:

source: When reading input from the stream, if *newline* is ``None``, universal newlines mode is enabled. Lines in the input can end in ``'\n'``, ``'\r'``, or ``'\r\n'``, and these are translated into ``'\n'`` before being returned to the caller. If it is ``''``, universal newlines mode is enabled, but line endings are returned to the caller untranslated. If it has any of the other legal values, input lines are only terminated by the given string, and the line ending is returned to the caller untranslated.
tr: Akıştan veri okurken eğer *newline* ``None`` ise, evrensel *newlines* aktif hale getirilir. Girdideki satırlar ``'\n'``, ``'\r'``, veya ``'\r\n'`` ile bitebilirler ve bunlar çağrıcıya döndürülmeden önce ``'\n'`` 'e çevrilirler. Eğer ``''`` ise, evrensel *newlines* aktif hale getirilir ama satır sonları çağrıcıya çevrilmeden döndürülürler. Eğer başka bir geçerli değer verildiyse, girdi satırları sadece verilen dize ile sonlanır ve satır sonu çağrıcıya çevrilmeden döndürülür.

source: When writing output to the stream, if *newline* is ``None``, any ``'\n'`` characters written are translated to the system default line separator, :data:`os.linesep`. If *newline* is ``''`` or ``'\n'``, no translation takes place. If *newline* is any of the other legal values, any ``'\n'`` characters written are translated to the given string.
tr: Çıktıyı akışa yazarkeni eğer *newline* ``None`` ise, tüm ``'\n'`` karakterleri sistemin varsayılan satır ayırıcısına, :data:`os.linesep` 'e dönüştürülür. Eğer *newline* ``''`` veya ``'\n'`` ise, bir dönüştürme yapılmaz. Eğer *newline* diğer uygun değerlerden biri ise, tüm ``'\n'`` karakterleri verilen dizeye dönüştürülür.

source: If *closefd* is ``False`` and a file descriptor rather than a filename was given, the underlying file descriptor will be kept open when the file is closed. If a filename is given *closefd* must be ``True`` (the default); otherwise, an error will be raised.
tr: Eğer *closefd*, ``False`` ise ve dosya adı yerine bir dosya tanımlayıcısı verildiyse, dosya kapatıldığında temel dosya tanımlayıcısı açık kalacaktır. Eğer bir dosya adı verildiyse, *closefd* ``True`` olmalıdır (varsayılan); aksi takdirde, bir hata ortaya çıkar.

source: A custom opener can be used by passing a callable as *opener*. The underlying file descriptor for the file object is then obtained by calling *opener* with (*file*, *flags*). *opener* must return an open file descriptor (passing :mod:`os.open` as *opener* results in functionality similar to passing ``None``).
tr: *opener* yerine bir çağrılabilir nesne verilerek özel bir açıcı kullanabilirsiniz. Dosya nesnesi için temel dosya tanımlayıcısı sonradan *opener* 'ı (*file*, *flags*) ile çağırarak elde edilir. *opener* bir açık dosya tanımlayıcısı döndürmelidir (*opener* yerine :mod:`os.open` göndermek fonksiyonel olarak ``None`` göndermek ile benzer sonuçlanır).

source: The newly created file is :ref:`non-inheritable <fd_inheritance>`.
tr: Yeni oluşturulan dosya :ref:`non-inheritable <fd_inheritance>` 'dir.

source: The following example uses the :ref:`dir_fd <dir_fd>` parameter of the :func:`os.open` function to open a file relative to a given directory::
tr: Aşağıdaki örnek verilen bir dizine ait bir dosyayı açmak için :func:`os.open` fonksiyonunun :ref:`dir_fd <dir_fd>` parametresini kullanır:

source: The type of :term:`file object` returned by the :func:`open` function depends on the mode. When :func:`open` is used to open a file in a text mode (``'w'``, ``'r'``, ``'wt'``, ``'rt'``, etc.), it returns a subclass of :class:`io.TextIOBase` (specifically :class:`io.TextIOWrapper`). When used to open a file in a binary mode with buffering, the returned class is a subclass of :class:`io.BufferedIOBase`. The exact class varies: in read binary mode, it returns an :class:`io.BufferedReader`; in write binary and append binary modes, it returns an :class:`io.BufferedWriter`, and in read/write mode, it returns an :class:`io.BufferedRandom`. When buffering is disabled, the raw stream, a subclass of :class:`io.RawIOBase`, :class:`io.FileIO`, is returned.
tr: :func:`open` metodu tarafından döndürülen :term:`file object` 'in tipi moda bağlıdır. :func:`open` bir dosyayı metin modunda (``'w'``, ``'r'``, ``'wt'``, ``'rt'`` vb.) açmak için kullanıldığında, :class:`io.TextIOBase` 'in bir alt sınıfını döndürür (özellikle :class:`io.TextIOWrapper`). Bir dosyayı ikili modda arabellek ile açmak için kullanıldığında, döndürülen sınıf :class:`io.BufferedIOBase` 'ın alt sınıfıdır. Kesin sınıf değişkendir: ikili okuma modunda, bir :class:`io.BufferedReader` döndürür; ikili yazma ve ikili ekleme modunda, :class:`io.BufferedWriter` döndürür, ve okuma/yazma modunda :class:`io.BufferedRandom` döndürür. Arabelleğe alma devre dışı olduğunda, ham akış, :class:`io.RawIOBase` 'in alt sınıfı, :class:`io.FileIO` döndürülür.

source: See also the file handling modules, such as :mod:`fileinput`, :mod:`io` (where :func:`open` is declared), :mod:`os`, :mod:`os.path`, :mod:`tempfile`, and :mod:`shutil`.
tr: Ayrıca :mod:`fileinput`, :mod:`io` (:func:`open` 'ın tanımlandığı yer), :mod:`os`, :mod:`os.path`, :mod:`tempfile`, ve :mod:`shutil` gibi dosya işleme modüllerine de bkz.

source: Raises an :ref:`auditing event <auditing>` ``open`` with arguments ``file``, ``mode``, ``flags``.
tr: ``file``, ``mode``, ``flags`` parametreleriyle bir :ref:`audition event <auditing>` ``open`` ortaya çıkartır.

source: The ``mode`` and ``flags`` arguments may have been modified or inferred from the original call.
tr: ``mode`` ve ``flags`` parametreleri orijinal çağrı tarafından modifiye edilmiş veya çıkartılmış olabilir.

source: The *opener* parameter was added.
tr: *opener* parametresi eklendi.

source: The ``'x'`` mode was added.
tr: ``'x'`` modu eklendi.

source: :exc:`IOError` used to be raised, it is now an alias of :exc:`OSError`.
tr: Eskiden :exc:`IOError` hatası ortaya çıkardı, şimdi :exc:`OSError` 'un takma adıdır.

source: :exc:`FileExistsError` is now raised if the file opened in exclusive creation mode (``'x'``) already exists.
tr: Artık eğer özel oluşturma modunda (``'x'``) açılmış dosyalar zaten bulunuyorsa :exc:`FileExistsError` hatası ortaya çıkar.

source: The file is now non-inheritable.
tr: Dosya artık miras alınamaz.

source: If the system call is interrupted and the signal handler does not raise an exception, the function now retries the system call instead of raising an :exc:`InterruptedError` exception (see :pep:`475` for the rationale).
tr: Eğer sistem çağrısı bölündüyse ve sinyal işleyicisi bir hata ortaya çıkartmazsa, artık fonksiyon :exc:`InterruptedError` hatası ortaya çıkartmak yerine sistem çağrısını yeniden dener (açıklama için :pep:`475` bkz).

source: The ``'namereplace'`` error handler was added.
tr: ``'namereplace'`` hata işleyicisi eklendi.

source: Support added to accept objects implementing :class:`os.PathLike`.
tr: :class:`os.PathLike` uygulayan nesneleri kabul etme desteği eklendi.

source: On Windows, opening a console buffer may return a subclass of :class:`io.RawIOBase` other than :class:`io.FileIO`.
tr: Windows'da, bir konsol arabelleğinin açılması :class:`io.FileIO` dışında bir :class:`io.RawIOBase` alt sınıfını döndürebilir.

source: The ``'U'`` mode has been removed.
tr: ``'U'`` modu kaldırıldı.

source: Given a string representing one Unicode character, return an integer representing the Unicode code point of that character. For example, ``ord('a')`` returns the integer ``97`` and ``ord('€')`` (Euro sign) returns ``8364``. This is the inverse of :func:`chr`.
tr: Bir Unicode karakterini temsil eden dize verilir ve o karakterin Unicode kod noktasını temsil eden bir tamsayı döndürür. Örneğin, ``ord('a')`` ``97`` tamsayısını döndürür ve ``ord('€')`` (Euro simgesi) ``8364`` tamsayısını döndürür. Bu :func:`chr` 'nin tersidir.

source: Return *base* to the power *exp*; if *mod* is present, return *base* to the power *exp*, modulo *mod* (computed more efficiently than ``pow(base, exp) % mod``). The two-argument form ``pow(base, exp)`` is equivalent to using the power operator: ``base**exp``.
tr: *base* 'in *exp* kuvvetini döndürür; *mod* verildiyse, aynı sayı % *mod* sonucunu döndürür (``pow(base,exp) % mod`` 'dan daha verimli işlenir). İki parametreli formu ``pow(base, exp)``, üs operatörü ``base**exp`` kullanmaya eş değerdir.

source: The arguments must have numeric types. With mixed operand types, the coercion rules for binary arithmetic operators apply. For :class:`int` operands, the result has the same type as the operands (after coercion) unless the second argument is negative; in that case, all arguments are converted to float and a float result is delivered. For example, ``pow(10, 2)`` returns ``100``, but ``pow(10, -2)`` returns ``0.01``. For a negative base of type :class:`int` or :class:`float` and a non-integral exponent, a complex result is delivered. For example, ``pow(-9, 0.5)`` returns a value close to ``3j``.
tr: Parametreler nümerik olmak zorundadır. Karışık işlenen türleriyle, ikili aritmetik operatörler için baskı kuralları geçerlidir. :class:`int` işlemleri için, ikinci parametre negatif olmadığı sürece sonuç işlenen ile aynı türe sahip olmalıdır (baskıdan sonra); bu durumda, tüm parametreler gerçel sayıya çevrilir ve bir gerçel sayı sonucu teslim edilir. Örneğin ``pow(10, 2)``, ``100`` değerini döndürür, ama ``pow(10, -2)``, ``0.01`` değerini döndürür. integral olmayan bir üs ile :class:`int` veya :class:`float` tipinin negatif tabanı için, karmaşık bir sayı çıktı verilir. Örneğin, ``pow(-9, 0.5)``, ``3j`` 'ye yakın bir değer döndürür.

source: For :class:`int` operands *base* and *exp*, if *mod* is present, *mod* must also be of integer type and *mod* must be nonzero. If *mod* is present and *exp* is negative, *base* must be relatively prime to *mod*. In that case, ``pow(inv_base, -exp, mod)`` is returned, where *inv_base* is an inverse to *base* modulo *mod*.
tr: :class:`int` işlemleri için *mod* verilmişse, *base* ve *exp* bir tam sayı olmalıdır, aynı zamanda *mod* sıfır olamaz. Eğer *mod* verilmişse ve *exp* negatifse, *base*, *mod* için görece asal olmalıdır. Bu durumda, ``pow(inv_base,-exp,mod)`` döndürülüri *inv_base, *base* mod *mod* 'un tersidir.

source: Here's an example of computing an inverse for ``38`` modulo ``97``::
tr: Burada ``38`` mod ``97`` 'nin tersini işlemek için bir örnek var::

source: For :class:`int` operands, the three-argument form of ``pow`` now allows the second argument to be negative, permitting computation of modular inverses.
tr: :class:`int` işlenenleri için, ``pow`` 'un üç parametreli formu artık ikinci parametrenin negatif olmasına, modüler terslerin hesaplanmasına izin verir.

source: Allow keyword arguments. Formerly, only positional arguments were supported.
tr: Anahtar kelime parametrelerine izin ver, önceden sadece pozisyonel parametreler desteklenirdi.
