Repository: python/python-docs-tr
Catalog: library/math.po
Languages: tr

source: :meth:`int.bit_length` returns the number of bits necessary to represent an integer in binary, excluding the sign and leading zeros.
tr: :meth:`int.bit_length`, işaret ve baştaki sıfırlar hariç olmak üzere, bir tamsayıyı ikili olarak temsil etmek için gerekli bit sayısını döndürür.

source: Return the base-10 logarithm of *x*. This is usually more accurate than ``log(x, 10)``.
tr: *x* 'in 10 tabanında logaritmasını döndürür. Bu genellikle ``log(x, 10)`` 'dan daha doğrudur.

source: Return ``x`` raised to the power ``y``. Exceptional cases follow the IEEE 754 standard as far as possible. In particular, ``pow(1.0, x)`` and ``pow(x, 0.0)`` always return ``1.0``, even when ``x`` is a zero or a NaN. If both ``x`` and ``y`` are finite, ``x`` is negative, and ``y`` is not an integer then ``pow(x, y)`` is undefined, and raises :exc:`ValueError`.
tr: x`in ``y`` kuvvetine yükseltilmiş halini döndürür. İstisnai durumlar mümkün olduğunca IEEE 754 standardını takip eder. Özellikle, ``pow(1.0, x)`` ve ``pow(x, 0.0)``, ``x`` sıfır veya NaN olsa bile her zaman ``1.0`` döndürür. Eğer hem ``x`` hem de ``y`` sonlu ise, ``x`` negatif ise ve ``y`` bir tamsayı değilse, ``pow(x, y)`` tanımsızdır ve :exc:`ValueError` yükseltir.

source: Unlike the built-in ``**`` operator, :func:`math.pow` converts both its arguments to type :class:`float`. Use ``**`` or the built-in :func:`pow` function for computing exact integer powers.
tr: Yerleşik ``**`` operatörünün aksine, :func:`math.pow` her iki argümanını da :class:`float` türüne dönüştürür. Tam sayı kuvvetlerini hesaplamak için ``**`` veya yerleşik :func:`pow` fonksiyonunu kullanın.

source: The special cases ``pow(0.0, -inf)`` and ``pow(-0.0, -inf)`` were changed to return ``inf`` instead of raising :exc:`ValueError`, for consistency with IEEE 754.
tr: Özel durumlar ``pow(0.0, -inf)`` ve ``pow(-0.0, -inf)``, IEEE 754 ile tutarlılık için :exc:`ValueError`` yükseltmek yerine ``inf`` döndürmek üzere değiştirildi.

source: Return the square root of *x*.
tr: *x*'in karekökünü döndürür.

source: Trigonometric functions
tr: Trigonometrik fonksiyonlar

source: Return the arc cosine of *x*, in radians. The result is between ``0`` and ``pi``.
tr: Radyan cinsinden *x*'in yay kosinüsünü döndürür. Sonuç ``0`` ile ``pi`` arasındadır.

source: Return the arc sine of *x*, in radians. The result is between ``-pi/2`` and ``pi/2``.
tr: Radyan cinsinden *x*'in yay sinüsünü döndürür. Sonuç ``-pi/2`` ile ``pi/2`` arasındadır.

source: Return the arc tangent of *x*, in radians. The result is between ``-pi/2`` and ``pi/2``.
tr: Radyan cinsinden *x*'in yay tanjantını döndürür. Sonuç ``-pi/2`` ile ``pi/2`` arasındadır.

source: Return ``atan(y / x)``, in radians. The result is between ``-pi`` and ``pi``. The vector in the plane from the origin to point ``(x, y)`` makes this angle with the positive X axis. The point of :func:`atan2` is that the signs of both inputs are known to it, so it can compute the correct quadrant for the angle. For example, ``atan(1)`` and ``atan2(1, 1)`` are both ``pi/4``, but ``atan2(-1, -1)`` is ``-3*pi/4``.
tr: Radyan cinsinden ``atan(y / x)`` döndürür. Sonuç ``-pi`` ile ``pi`` arasındadır. Düzlemde orijinden ``(x, y)`` noktasına kadar olan vektör, pozitif X ekseni ile bu açıyı yapar. :func:`atan2` 'nin amacı, her iki girdinin de işaretlerinin bilinmesidir, böylece açı için doğru kadranı hesaplayabilir. Örneğin, ``atan(1)`` ve ``atan2(1, 1)`` her ikisi de ``pi/4`` 'tür, ancak ``atan2(-1, -1)`` ise ``-3*pi/4`` 'tür.

source: Return the cosine of *x* radians.
tr: *x* radyanın kosinüsünü döndürür.

source: Return the Euclidean distance between two points *p* and *q*, each given as a sequence (or iterable) of coordinates. The two points must have the same dimension.
tr: Her biri bir koordinat dizisi (veya yinelenebilir) olarak verilen iki *p* ve *q* noktası arasındaki Öklid mesafesini döndürür. İki nokta aynı boyuta sahip olmalıdır.

source: Roughly equivalent to::
tr: Kabaca şuna eşdeğerdir::

source: Return the Euclidean norm, ``sqrt(sum(x**2 for x in coordinates))``. This is the length of the vector from the origin to the point given by the coordinates.
tr: Öklid normunu döndürür, ``sqrt(sum(x**2 for x in coordinates))``. Bu, vektörün orijinden koordinatlar tarafından verilen noktaya olan uzunluğudur.

source: For a two dimensional point ``(x, y)``, this is equivalent to computing the hypotenuse of a right triangle using the Pythagorean theorem, ``sqrt(x*x + y*y)``.
tr: İki boyutlu bir ``(x, y)`` noktası için bu, Pisagor teoremi ``sqrt(x*x + y*y)`` kullanılarak bir dik üçgenin hipotenüsünün hesaplanmasına eşdeğerdir.

source: Added support for n-dimensional points. Formerly, only the two dimensional case was supported.
tr: n boyutlu noktalar için destek eklendi. Önceden sadece iki boyutlu durum destekleniyordu.

source: Improved the algorithm's accuracy so that the maximum error is under 1 ulp (unit in the last place). More typically, the result is almost always correctly rounded to within 1/2 ulp.
tr: Algoritmanın doğruluğu, maksimum hata 1 ulp'nin (son sıradaki birim) altında olacak şekilde geliştirildi. Daha tipik olarak, sonuç neredeyse her zaman 1/2 ulp içinde doğru şekilde yuvarlanır.

source: Return the sine of *x* radians.
tr: *x* radyanın sinüsünü döndürür.

source: Return the tangent of *x* radians.
tr: *x* radyanın tanjantını döndürür.

source: Angular conversion
tr: Açısal dönüşüm

source: Convert angle *x* from radians to degrees.
tr: Açıyı *x* radyandan dereceye dönüştürür.

source: Convert angle *x* from degrees to radians.
tr: Açıyı *x* dereceden radyana dönüştürür.

source: Hyperbolic functions
tr: Hiberbolik fonksiyonlar

source: `Hyperbolic functions <https://en.wikipedia.org/wiki/Hyperbolic_function>`_ are analogs of trigonometric functions that are based on hyperbolas instead of circles.
tr: `Hiperbolik fonksiyonlar <https://en.wikipedia.org/wiki/Hyperbolic_function>`_ trigonometrik fonksiyonların çemberler yerine hiperbollere dayanan analoglarıdır.

source: Return the inverse hyperbolic cosine of *x*.
tr: *x*'in ters hiperbolik kosinüsünü döndürür.

source: Return the inverse hyperbolic sine of *x*.
tr: *x*'in ters hiperbolik sinüsünü döndürür.

source: Return the inverse hyperbolic tangent of *x*.
tr: *x*'in ters hiperbolik tanjantını döndürür.

source: Return the hyperbolic cosine of *x*.
tr: *x*'in hiperbolik kosinüsünü döndürür.

source: Return the hyperbolic sine of *x*.
tr: *x*'in hiperbolik sinüsünü döndürür.

source: Return the hyperbolic tangent of *x*.
tr: *x*'in hiperbolik tanjantını döndürür.

source: Special functions
tr: Özel fonksiyonlar

source: Return the `error function <https://en.wikipedia.org/wiki/Error_function>`_ at *x*.
tr: *x* adresindeki `hata fonksiyonunu <https://en.wikipedia.org/wiki/Error_function>`_ döndürür.

source: The :func:`erf` function can be used to compute traditional statistical functions such as the `cumulative standard normal distribution <https://en.wikipedia.org/wiki/Normal_distribution#Cumulative_distribution_functions>`_::
tr: :func:`erf` fonksiyonu, `kümülatif standart normal dağılım <https://en.wikipedia.org/wiki/Normal_distribution#Cumulative_distribution_functions>`_: gibi geleneksel istatistiksel fonksiyonları hesaplamak için kullanılabilir:

source: Return the complementary error function at *x*. The `complementary error function <https://en.wikipedia.org/wiki/Error_function>`_ is defined as ``1.0 - erf(x)``. It is used for large values of *x* where a subtraction from one would cause a `loss of significance <https://en.wikipedia.org/wiki/Loss_of_significance>`_\.
tr: *x* 'de tamamlayıcı hata fonksiyonunu döndürür. `Tamamlayıcı hata fonksiyonu <https://en.wikipedia.org/wiki/Error_function>`_ ``1.0 - erf(x)`` olarak tanımlanır. Birbirinden çıkarmanın `anlamlılık kaybına <https://en.wikipedia.org/wiki/Loss_of_significance>`_ neden olacağı büyük *x* değerleri için kullanılır.\

source: Return the `Gamma function <https://en.wikipedia.org/wiki/Gamma_function>`_ at *x*.
tr: *x* adresindeki `Gamma fonksiyonunu <https://en.wikipedia.org/wiki/Gamma_function>`_ döndürür.

source: Return the natural logarithm of the absolute value of the Gamma function at *x*.
tr: Gama fonksiyonunun *x*'deki mutlak değerinin doğal logaritmasını döndürür.

source: Constants
tr: Sabitler

source: The mathematical constant *π* = 3.141592..., to available precision.
tr: Matematiksel sabit *π* = 3.141592..., mevcut hassasiyete göre.

source: The mathematical constant *e* = 2.718281..., to available precision.
tr: Matematiksel sabit *e* = 2,718281..., mevcut hassasiyete göre.

source: The mathematical constant *τ* = 6.283185..., to available precision. Tau is a circle constant equal to 2\ *π*, the ratio of a circle's circumference to its radius. To learn more about Tau, check out Vi Hart's video `Pi is (still) Wrong <https://www.youtube.com/watch?v=jG7vhMMXagQ>`_, and start celebrating `Tau day <https://tauday.com/>`_ by eating twice as much pie!
tr: Matematiksel sabit *τ* = 6.283185..., mevcut hassasiyete göre. Tau, bir dairenin çevresinin yarıçapına oranı olan 2\ *π*'ye eşit bir daire sabitidir. Tau hakkında daha fazla bilgi edinmek için Vi Hart'ın `Pi (hala) Yanlış <https://www.youtube.com/watch?v=jG7vhMMXagQ>`_ videosuna göz atın ve `Tau gününü <https://tauday.com/>`_ iki kat daha fazla turta yiyerek kutlamaya başlayın!

source: A floating-point positive infinity. (For negative infinity, use ``-math.inf``.) Equivalent to the output of ``float('inf')``.
tr: Bir kayan noktalı pozitif sonsuzluk. (Negatif sonsuzluk için ``-math.inf`` kullanın.) ``float('inf')`` çıktısına eşdeğerdir.

source: A floating-point "not a number" (NaN) value. Equivalent to the output of ``float('nan')``. Due to the requirements of the `IEEE-754 standard <https://en.wikipedia.org/wiki/IEEE_754>`_, ``math.nan`` and ``float('nan')`` are not considered to equal to any other numeric value, including themselves. To check whether a number is a NaN, use the :func:`isnan` function to test for NaNs instead of ``is`` or ``==``. Example::
tr: Bir kayan noktalı "sayı değil" (NaN) değeri. ``float('nan')`` çıktısına eşdeğerdir. `IEEE-754 standardının <https://en.wikipedia.org/wiki/IEEE_754>`_ gereklilikleri nedeniyle, ``math.nan`` ve ``float('nan')`` kendileri de dahil olmak üzere başka hiçbir sayısal değere eşit kabul edilmez. Bir sayının NaN olup olmadığını kontrol etmek için, ``is`` veya ``==`` yerine NaN'leri test etmek için :func:`isnan` fonksiyonunu kullanın. Örnek::

source: It is now always available.
tr: Artık her zaman kullanılabilir.

source: The :mod:`math` module consists mostly of thin wrappers around the platform C math library functions. Behavior in exceptional cases follows Annex F of the C99 standard where appropriate. The current implementation will raise :exc:`ValueError` for invalid operations like ``sqrt(-1.0)`` or ``log(0.0)`` (where C99 Annex F recommends signaling invalid operation or divide-by-zero), and :exc:`OverflowError` for results that overflow (for example, ``exp(1000.0)``). A NaN will not be returned from any of the functions above unless one or more of the input arguments was a NaN; in that case, most functions will return a NaN, but (again following C99 Annex F) there are some exceptions to this rule, for example ``pow(float('nan'), 0.0)`` or ``hypot(float('nan'), float('inf'))``.
tr: :mod:`math` modülü çoğunlukla platform C matematik kütüphanesi fonksiyonları etrafındaki ince sarmalayıcılardan oluşur. İstisnai durumlarda davranış, uygun olan yerlerde C99 standardının Ek F'sini takip eder. Mevcut uygulama, ``sqrt(-1.0)`` veya ``log(0.0)`` gibi geçersiz işlemler için :exc::exc:`ValueError` (C99 Annex F geçersiz işlem veya sıfıra bölme sinyalini önerir) ve taşan sonuçlar için :exc:`OverflowError` (örneğin, ``exp(1000.0)``) yükseltir. Girdi argümanlarından biri veya daha fazlası NaN olmadığı sürece yukarıdaki fonksiyonların hiçbirinden NaN döndürülmeyecektir; bu durumda, çoğu fonksiyon bir NaN döndürecektir, ancak (yine C99 Ek F'yi takip ederek) bu kuralın bazı istisnaları vardır, örneğin ``pow(float('nan'), 0.0)`` veya ``hypot(float('nan'), float('inf'))``.

source: Note that Python makes no effort to distinguish signaling NaNs from quiet NaNs, and behavior for signaling NaNs remains unspecified. Typical behavior is to treat all NaNs as though they were quiet.
tr: Python'un sinyal veren NaN'ları sessiz NaN'lardan ayırt etmek için hiçbir çaba göstermediğini ve sinyal veren NaN'lar için davranışın belirtilmediğini unutmayın. Tipik davranış, tüm NaN'lara sessizmiş gibi davranmaktır.

source: Module :mod:`cmath`
tr: Modül :mod:`cmath`

source: Complex number versions of many of these functions.
tr: Bu fonksiyonların çoğunun karmaşık sayı versiyonları.
