Repository: python/python-docs-tr
Catalog: library/math.po
Languages: tr

source: :mod:`math` --- Mathematical functions
tr: :mod:`math` --- Matematiksel fonksiyonlar

source: This module provides access to the mathematical functions defined by the C standard.
tr: Bu modül, C standardı tarafından tanımlanan matematiksel fonksiyonlara erişim sağlar.

source: These functions cannot be used with complex numbers; use the functions of the same name from the :mod:`cmath` module if you require support for complex numbers. The distinction between functions which support complex numbers and those which don't is made since most users do not want to learn quite as much mathematics as required to understand complex numbers. Receiving an exception instead of a complex result allows earlier detection of the unexpected complex number used as a parameter, so that the programmer can determine how and why it was generated in the first place.
tr: Bu fonksiyonlar karmaşık sayılarla kullanılamaz; karmaşık sayılar için desteğe ihtiyacınız varsa :mod:`cmath` modülündeki aynı isimli fonksiyonları kullanın. Karmaşık sayıları destekleyen ve desteklemeyen fonksiyonlar arasındaki ayrım, çoğu kullanıcının karmaşık sayıları anlamak için gereken kadar matematik öğrenmek istememesi nedeniyle yapılmıştır. Karmaşık bir sonuç yerine bir istisna almak, parametre olarak kullanılan beklenmedik karmaşık sayının daha erken tespit edilmesini sağlar, böylece programcı ilk etapta nasıl ve neden üretildiğini belirleyebilir.

source: The following functions are provided by this module. Except when explicitly noted otherwise, all return values are floats.
tr: Aşağıdaki fonksiyonlar bu modül tarafından sağlanır. Aksi açıkça belirtilmedikçe, tüm dönüş değerleri floattır.

source: Number-theoretic and representation functions
tr: Sayı teorisi ve temsil fonksiyonları

source: Return the ceiling of *x*, the smallest integer greater than or equal to *x*. If *x* is not a float, delegates to :meth:`x.__ceil__ <object.__ceil__>`, which should return an :class:`~numbers.Integral` value.
tr: *x*'in tavanını, yani *x*'ten büyük veya ona eşit en küçük tamsayıyı döndürür. Eğer *x* bir float değilse, bir :class:`~numbers.Integral` değeri döndürmesi gereken :meth:`x.__ceil__ <object.__ceil__>`'e delege eder.

source: Return the number of ways to choose *k* items from *n* items without repetition and without order.
tr: Tekrarlama ve sıralama olmaksızın *n* öğe arasından *k* öğeyi seçmenin yollarının sayısını döndürür.

source: Evaluates to ``n! / (k! * (n - k)!)`` when ``k <= n`` and evaluates to zero when ``k > n``.
tr: ``n! / (k! * (n - k)!)`` değerini ``k <= n`` olduğunda verir ve ``k > n`` olduğunda sıfır olarak değerlendirir.

source: Also called the binomial coefficient because it is equivalent to the coefficient of k-th term in polynomial expansion of ``(1 + x)ⁿ``.
tr: Binom katsayısı olarak da adlandırılır. Çünkü ``(1 + x)ⁿ`` polinom açılımındaki k. terimin katsayısına eşittir.

source: Raises :exc:`TypeError` if either of the arguments are not integers. Raises :exc:`ValueError` if either of the arguments are negative.
tr: Herhangi bir argümanın tamsayı olmaması durumunda :exc:`TypeError` fırlatır. Herhangi bir argümanın negatif olması durumunda :exc:`ValueError` fırlatır.

source: Return a float with the magnitude (absolute value) of *x* but the sign of *y*. On platforms that support signed zeros, ``copysign(1.0, -0.0)`` returns *-1.0*.
tr: Büyüklüğü (mutlak değeri) *x* olan ancak işareti *y* olan bir ondalıklı sayı döndürür. İşaretli sıfırları destekleyen platformlarda, ``copysign(1.0, -0.0)`` *-1.0* döndürür.

source: Return the absolute value of *x*.
tr: *x*'in mutlak değerini döndürür.

source: Return *n* factorial as an integer. Raises :exc:`ValueError` if *n* is not integral or is negative.
tr: *n* faktöriyeli tamsayı olarak döndürür. *n* tamsayı değil veya negatifse :exc:`ValueError` fırlatır.

source: Accepting floats with integral values (like ``5.0``) is deprecated.
tr: Tam sayı değerlere sahip ondalıklı değerlerin kabul edilmesi (``5.0`` gibi) kullanımdan kaldırılmıştır.

source: Return the floor of *x*, the largest integer less than or equal to *x*. If *x* is not a float, delegates to :meth:`x.__floor__ <object.__floor__>`, which should return an :class:`~numbers.Integral` value.
tr: x*'ten küçük veya ona eşit en büyük tamsayı olan *x*'in tabanını döndürür. Eğer *x* bir ondalıklı sayı değilse, bir :class:`~numbers.Integral` değeri döndürmesi gereken :meth:`x.__floor__ <object.__floor__>` değerini vermelidir.

source: Return ``fmod(x, y)``, as defined by the platform C library. Note that the Python expression ``x % y`` may not return the same result. The intent of the C standard is that ``fmod(x, y)`` be exactly (mathematically; to infinite precision) equal to ``x - n*y`` for some integer *n* such that the result has the same sign as *x* and magnitude less than ``abs(y)``. Python's ``x % y`` returns a result with the sign of *y* instead, and may not be exactly computable for float arguments. For example, ``fmod(-1e-100, 1e100)`` is ``-1e-100``, but the result of Python's ``-1e-100 % 1e100`` is ``1e100-1e-100``, which cannot be represented exactly as a float, and rounds to the surprising ``1e100``. For this reason, function :func:`fmod` is generally preferred when working with floats, while Python's ``x % y`` is preferred when working with integers.
tr: Platform C kütüphanesi tarafından tanımlandığı gibi ``fmod(x, y)`` döndürür. Python ifadesinin ``x % y`` aynı sonucu döndürmeyebileceğini unutmayın. C standardının amacı, ``fmod(x, y)`` ifadesinin tam olarak (matematiksel olarak; sonsuz hassasiyette) *n* tamsayısı için ``x - n*y`` değerine eşit olmasıdır, böylece sonuç *x* ile aynı işarete ve ``abs(y)`` değerinden daha küçük bir büyüklüğe sahip olur. Python'un ``x % y`` değeri bunun yerine *y* işaretine sahip bir sonuç döndürür ve ondalıklı sayı bağımsız değişkenler için tam olarak hesaplanabilir olmayabilir. Örneğin, ``fmod(-1e-100, 1e100)`` sonucu ``-1e-100`` 'dür, ancak Python`un ``-1e-100 % 1e100`` sonucu ``1e100-1e-100`` 'dür, bu da tam olarak bir ondalıklı sayı olarak gösterilemez ve şaşırtıcı ``1e100`` değerine yuvarlanır. Bu nedenle, floatlarla çalışırken genellikle :func:`fmod` fonksiyonu tercih edilirken, tamsayılarla çalışırken Python'un ``x % y`` fonksiyonu tercih edilir.

source: Return the mantissa and exponent of *x* as the pair ``(m, e)``. *m* is a float and *e* is an integer such that ``x == m * 2**e`` exactly. If *x* is zero, returns ``(0.0, 0)``, otherwise ``0.5 <= abs(m) < 1``. This is used to "pick apart" the internal representation of a float in a portable way.
tr: x*'in mantissa ve üssünü ``(m, e)`` çifti olarak döndürür. *m* bir ondalıklı sayı ve *e* bir tamsayıdır, bu yüzden ``x == m * 2**e`` doğru olarak eşittir. Eğer *x* sıfır ise ``(0.0, 0)``, aksi takdirde ``0.5 <= abs(m) < 1`` döndürür. Bu, bir ondalıklı sayının iç temsilini taşınabilir bir şekilde "ayırmak" için kullanılır.

source: Return an accurate floating point sum of values in the iterable. Avoids loss of precision by tracking multiple intermediate partial sums::
tr: Iterable içindeki değerlerin doğru bir kayan noktalı toplamını döndür. Birden fazla ara toplamı takip ederek hassasiyet kaybını önler:

source: The algorithm's accuracy depends on IEEE-754 arithmetic guarantees and the typical case where the rounding mode is half-even. On some non-Windows builds, the underlying C library uses extended precision addition and may occasionally double-round an intermediate sum causing it to be off in its least significant bit.
tr: Algoritmanın doğruluğu IEEE-754 aritmetik garantilerine ve yuvarlama modunun yarı-çift olduğu tipik duruma bağlıdır. Bazı Windows dışı yapılarda, temel C kütüphanesi genişletilmiş hassasiyetli toplama kullanır ve bazen bir ara toplamı çift yuvarlayarak en az anlamlı bitinde eksik olmasına neden olabilir.

source: For further discussion and two alternative approaches, see the `ASPN cookbook recipes for accurate floating point summation <https://code.activestate.com/recipes/393090/>`_\.
tr: Daha fazla tartışma ve iki alternatif yaklaşım için, `ASPN cookbook recipes for accurate floating point summation <https://code.activestate.com/recipes/393090/>`_ sayfasına bakın.

source: Return the greatest common divisor of the specified integer arguments. If any of the arguments is nonzero, then the returned value is the largest positive integer that is a divisor of all arguments. If all arguments are zero, then the returned value is ``0``. ``gcd()`` without arguments returns ``0``.
tr: Belirtilen tamsayı bağımsız değişkenlerinin en büyük ortak bölenini döndürür. Bağımsız değişkenlerden herhangi biri sıfır değilse, döndürülen değer tüm bağımsız değişkenlerin bölenleri olan en büyük pozitif tamsayıdır. Tüm bağımsız değişkenler sıfırsa, döndürülen değer ``0`` olur. bağımsız değişkenler olmadan ``gcd()`` fonksiyonu ``0`` değerini döndürür.

source: Added support for an arbitrary number of arguments. Formerly, only two arguments were supported.
tr: İsteğe bağlı sayıda bağımsız değişken için destek eklendi. Önceden sadece iki argüman destekleniyordu.

source: Return ``True`` if the values *a* and *b* are close to each other and ``False`` otherwise.
tr: Eğer *a* ve *b* değerleri birbirine yakınsa ``True``, değilse ``False`` döndürür.

source: Whether or not two values are considered close is determined according to given absolute and relative tolerances.
tr: İki değerin yakın kabul edilip edilmeyeceği, verilen mutlak ve göreceli toleranslara göre belirlenir.

source: *rel_tol* is the relative tolerance -- it is the maximum allowed difference between *a* and *b*, relative to the larger absolute value of *a* or *b*. For example, to set a tolerance of 5%, pass ``rel_tol=0.05``. The default tolerance is ``1e-09``, which assures that the two values are the same within about 9 decimal digits. *rel_tol* must be greater than zero.
tr: *rel_tol* göreli toleranstır - *a* veya *b*'nin daha büyük mutlak değerine göre *a* ve *b* arasında izin verilen maksimum farktır. Örneğin, %5'lik bir tolerans ayarlamak için ``rel_tol=0.05`` değerini girin. Varsayılan tolerans, iki değerin yaklaşık 9 ondalık basamak içinde aynı olmasını sağlayan ``1e-09`` değeridir. *rel_tol* sıfırdan büyük olmalıdır.

source: *abs_tol* is the minimum absolute tolerance -- useful for comparisons near zero. *abs_tol* must be at least zero.
tr: *abs_tol* minimum mutlak toleranstır -- sıfıra yakın karşılaştırmalar için kullanışlıdır. *abs_tol* en az sıfır olmalıdır.

source: If no errors occur, the result will be: ``abs(a-b) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.
tr: Herhangi bir hata oluşmazsa, sonuç şöyle olacaktır: ``abs(a-b) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.

source: The IEEE 754 special values of ``NaN``, ``inf``, and ``-inf`` will be handled according to IEEE rules. Specifically, ``NaN`` is not considered close to any other value, including ``NaN``. ``inf`` and ``-inf`` are only considered close to themselves.
tr: IEEE 754 özel değerleri olan ``NaN``, ``inf`` ve ``-inf`` IEEE kurallarına göre ele alınacaktır. Özellikle, ``NaN``, ``NaN`` dahil olmak üzere başka hiçbir değere yakın kabul edilmez. ``inf`` ve ``-inf`` yalnızca kendilerine yakın kabul edilir.

source: :pep:`485` -- A function for testing approximate equality
tr: :pep:`485` -- Yaklaşık eşitliği test etmek için bir fonksiyon

source: Return ``True`` if *x* is neither an infinity nor a NaN, and ``False`` otherwise. (Note that ``0.0`` *is* considered finite.)
tr: Eğer *x* sonsuz bir değer ya da NaN ise ``True``, aksi takdirde ``False`` döndürür. (``0.0`` *sonlu* olarak kabul edilir.)

source: Return ``True`` if *x* is a positive or negative infinity, and ``False`` otherwise.
tr: Eğer *x* pozitif veya negatif bir sonsuz ise ``True``, aksi takdirde ``False`` döndürür.

source: Return ``True`` if *x* is a NaN (not a number), and ``False`` otherwise.
tr: Eğer *x* bir NaN (sayı değil) ise ``True``, aksi takdirde ``False`` döndürür.

source: Return the integer square root of the nonnegative integer *n*. This is the floor of the exact square root of *n*, or equivalently the greatest integer *a* such that *a*\ ² |nbsp| ≤ |nbsp| *n*.
tr: Negatif olmayan *n* tamsayısının tamsayı karekökünü döndürür. Bu, *n* tam karekökünün tabanıdır veya eşdeğer olarak *a*\ ² |nbsp| ≤ |nbsp| *n* olacak şekilde en büyük *a* tamsayısıdır.

source: For some applications, it may be more convenient to have the least integer *a* such that *n* |nbsp| ≤ |nbsp| *a*\ ², or in other words the ceiling of the exact square root of *n*. For positive *n*, this can be computed using ``a = 1 + isqrt(n - 1)``.
tr: Bazı uygulamalar için, *n* |nbsp| ≤ |nbsp| *a*\ ² olacak şekilde en küçük *a* tamsayısına veya başka bir deyişle *n*'nin tam karekökünün tavanına sahip olmak daha uygun olabilir. Pozitif *n* için bu, ``a = 1 + isqrt(n - 1)`` kullanılarak hesaplanabilir.

source: Return the least common multiple of the specified integer arguments. If all arguments are nonzero, then the returned value is the smallest positive integer that is a multiple of all arguments. If any of the arguments is zero, then the returned value is ``0``. ``lcm()`` without arguments returns ``1``.
tr: Belirtilen tamsayı bağımsız değişkenlerinin en küçük ortak katını döndürür. Tüm bağımsız değişkenler sıfır değilse, döndürülen değer tüm bağımsız değişkenlerin katı olan en küçük pozitif tamsayıdır. Bağımsız değişkenlerden herhangi biri sıfırsa, döndürülen değer ``0`` olur. Bağımsız değişkenler olmadan ``lcm()`` işlevi ``1`` değerini döndürür.

source: Return ``x * (2**i)``. This is essentially the inverse of function :func:`frexp`.
tr: ``x * (2**i)`` döndürür. Bu aslında :func:`frexp` fonksiyonunun tersidir.

source: Return the fractional and integer parts of *x*. Both results carry the sign of *x* and are floats.
tr: x*'in kesirli ve tamsayı kısımlarını döndürür. Her iki sonuç da *x* işaretini taşır ve kayan değerdir.

source: Return the next floating-point value after *x* towards *y*.
tr: x* değerinden sonra *y* değerine doğru bir sonraki kayan noktalı değeri döndürür.

source: If *x* is equal to *y*, return *y*.
tr: Eğer *x*, *y*'ye eşitse, *y* değerini döndürür.

source: Examples:
tr: Örnekler:

source: ``math.nextafter(x, math.inf)`` goes up: towards positive infinity.
tr: ``math.nextafter(x, math.inf)`` yukarı gider: pozitif sonsuza doğru.

source: ``math.nextafter(x, -math.inf)`` goes down: towards minus infinity.
tr: ``math.nextafter(x, -math.inf)`` aşağı iner: eksi sonsuza doğru.

source: ``math.nextafter(x, 0.0)`` goes towards zero.
tr: ``math.nextafter(x, 0.0)`` sıfıra doğru gider.

source: ``math.nextafter(x, math.copysign(math.inf, x))`` goes away from zero.
tr: ``math.nextafter(x, math.copysign(math.inf, x))`` sıfırdan uzaklaşır.

source: See also :func:`math.ulp`.
tr: Ayrıca bakınız :func:`math.ulp`.

source: Return the number of ways to choose *k* items from *n* items without repetition and with order.
tr: Tekrarlama olmadan ve sırayla *n* öğe arasından *k* öğeyi seçmenin yollarının sayısını döndürür.

source: Evaluates to ``n! / (n - k)!`` when ``k <= n`` and evaluates to zero when ``k > n``.
tr: ``n! / (k! * (n - k)!)`` değerini ``k <= n`` olduğunda verir ve ``k > n`` olduğunda sıfır olarak değerlendirir.

source: If *k* is not specified or is None, then *k* defaults to *n* and the function returns ``n!``.
tr: Eğer *k* belirtilmemişse veya None ise, *k* varsayılan olarak *n* değerini alır ve fonksiyon ``n!`` döndürür.

source: Calculate the product of all the elements in the input *iterable*. The default *start* value for the product is ``1``.
tr: Girdi *iterable* içindeki tüm elemanların çarpımını hesaplar. Çarpım için varsayılan *başlangıç* değeri ``1`` 'dir.

source: When the iterable is empty, return the start value. This function is intended specifically for use with numeric values and may reject non-numeric types.
tr: Yinelenebilir boş olduğunda, başlangıç değerini döndürür. Bu fonksiyon özellikle sayısal değerlerle kullanılmak üzere tasarlanmıştır ve sayısal olmayan türleri reddedebilir.

source: Return the IEEE 754-style remainder of *x* with respect to *y*. For finite *x* and finite nonzero *y*, this is the difference ``x - n*y``, where ``n`` is the closest integer to the exact value of the quotient ``x / y``. If ``x / y`` is exactly halfway between two consecutive integers, the nearest *even* integer is used for ``n``. The remainder ``r = remainder(x, y)`` thus always satisfies ``abs(r) <= 0.5 * abs(y)``.
tr: x*'in *y*'ye göre IEEE 754 tarzı kalanını döndürür. Sonlu *x* ve sonlu sıfır olmayan *y* için bu, ``x - n*y`` farkıdır; burada ``n``, ``x / y`` bölümünün tam değerine en yakın tamsayıdır. Eğer ``x / y`` ardışık iki tamsayının tam ortası ise, ``n`` için en yakın *çift* tamsayı kullanılır. Kalan ``r = remainder(x, y)`` böylece her zaman ``abs(r) <= 0.5 * abs(y)`` sağlar.

source: Special cases follow IEEE 754: in particular, ``remainder(x, math.inf)`` is *x* for any finite *x*, and ``remainder(x, 0)`` and ``remainder(math.inf, x)`` raise :exc:`ValueError` for any non-NaN *x*. If the result of the remainder operation is zero, that zero will have the same sign as *x*.
tr: Özel durumlar IEEE 754'ü takip eder: özellikle, ``remainder(x, math.inf)`` herhangi bir sonlu *x* için *x*'dir ve ``remainder(x, 0)`` ve ``remainder(math.inf, x)`` NaN olmayan herhangi bir *x* için :exc:`ValueError` yükseltir. Eğer kalan işleminin sonucu sıfır ise, bu sıfır *x* ile aynı işarete sahip olacaktır.

source: On platforms using IEEE 754 binary floating-point, the result of this operation is always exactly representable: no rounding error is introduced.
tr: IEEE 754 ikili kayan nokta kullanan platformlarda, bu işlemin sonucu her zaman tam olarak gösterilebilir: yuvarlama hatası oluşmaz.

source: Return *x* with the fractional part removed, leaving the integer part. This rounds toward 0: ``trunc()`` is equivalent to :func:`floor` for positive *x*, and equivalent to :func:`ceil` for negative *x*. If *x* is not a float, delegates to :meth:`x.__trunc__ <object.__trunc__>`, which should return an :class:`~numbers.Integral` value.
tr: Kesirli kısmı çıkarılmış ve tamsayı kısmı bırakılmış *x* döndürür. Bu 0'a yuvarlanır: ``trunc()`` pozitif *x* için :func:`floor` ve negatif *x* için :func:`ceil` ile eşdeğerdir. Eğer *x* bir float değilse, bir :class:`~numbers.Integral` değeri döndürmesi gereken :meth:`x.__trunc__ <object.__trunc__>`'a delege eder.

source: Return the value of the least significant bit of the float *x*:
tr: float *x* öğesinin en az anlamlı bitinin değerini döndürür:

source: If *x* is a NaN (not a number), return *x*.
tr: Eğer *x* bir NaN (sayı değil) ise ``True``, aksi takdirde ``False`` döndürür.

source: If *x* is negative, return ``ulp(-x)``.
tr: Eğer *x* negatif ise, ``ulp(-x)`` döndürür.

source: If *x* is a positive infinity, return *x*.
tr: Eğer *x* pozitif bir sonsuzluk ise, *x* değerini döndürür.

source: If *x* is equal to zero, return the smallest positive *denormalized* representable float (smaller than the minimum positive *normalized* float, :data:`sys.float_info.min <sys.float_info>`).
tr: Eğer *x* sıfıra eşitse, temsil edilebilir en küçük pozitif *normalize* floatı döndürür (minimum pozitif *normalize* floattan daha küçük, :data:`sys.float_info.min <sys.float_info>`).

source: If *x* is equal to the largest positive representable float, return the value of the least significant bit of *x*, such that the first float smaller than *x* is ``x - ulp(x)``.
tr: Eğer *x* pozitif olarak temsil edilebilen en büyük float değerine eşitse, *x* değerinden küçük olan ilk float değeri ``x - ulp(x)`` olacak şekilde *x* değerinin en küçük anlamlı bitinin değerini döndürür.

source: Otherwise (*x* is a positive finite number), return the value of the least significant bit of *x*, such that the first float bigger than *x* is ``x + ulp(x)``.
tr: Aksi takdirde (*x* pozitif bir sonlu sayıdır), *x*'in en az anlamlı bitinin değerini döndürür, öyle ki *x*'ten büyük ilk float ``x + ulp(x)`` olur.

source: ULP stands for "Unit in the Last Place".
tr: ULP, "Son Yerdeki Birim" anlamına gelmektedir.

source: See also :func:`math.nextafter` and :data:`sys.float_info.epsilon <sys.float_info>`.
tr: Ayrıca bakınız :func:`math.nextafter` ve :data:`sys.float_info.epsilon <sys.float_info>`.

source: Note that :func:`frexp` and :func:`modf` have a different call/return pattern than their C equivalents: they take a single argument and return a pair of values, rather than returning their second return value through an 'output parameter' (there is no such thing in Python).
tr: :func:`frexp` ve :func:`modf`'un C'deki eşdeğerlerinden farklı bir çağrı/çağrı modeline sahip olduğuna dikkat edin: tek bir argüman alırlar ve ikinci dönüş değerlerini bir 'çıktı parametresi' aracılığıyla döndürmek yerine bir çift değer döndürürler (Python'da böyle bir şey yoktur).

source: For the :func:`ceil`, :func:`floor`, and :func:`modf` functions, note that *all* floating-point numbers of sufficiently large magnitude are exact integers. Python floats typically carry no more than 53 bits of precision (the same as the platform C double type), in which case any float *x* with ``abs(x) >= 2**52`` necessarily has no fractional bits.
tr: :func:`ceil`, :func:`floor` ve :func:`modf` fonksiyonları için, yeterince büyük büyüklükteki *tüm* kayan noktalı sayıların tam tamsayı olduğunu unutmayın. Python kayan noktalı sayıları tipik olarak 53 bitten fazla hassasiyet taşımaz (C platformundaki double tipiyle aynıdır), bu durumda ``abs(x) >= 2**52`` olan herhangi bir *x* kayan noktalı sayısı zorunlu olarak kesirli bitlere sahip değildir.

source: Power and logarithmic functions
tr: Güç ve logaritmik fonksiyonlar

source: Return the cube root of *x*.
tr: x*'in küp kökünü döndürür.

source: Return *e* raised to the power *x*, where *e* = 2.718281... is the base of natural logarithms. This is usually more accurate than ``math.e ** x`` or ``pow(math.e, x)``.
tr: *e*'yi *x* kuvvetine yükseltilmiş olarak döndürür, burada *e* = 2.718281... doğal logaritma tabanıdır. Bu genellikle ``math.e ** x`` veya ``pow(math.e, x)`` değerinden daha doğrudur.

source: Return *2* raised to the power *x*.
tr: *2*'nin *x* kuvvetine yükseltilmiş halini döndürür.

source: Return *e* raised to the power *x*, minus 1. Here *e* is the base of natural logarithms. For small floats *x*, the subtraction in ``exp(x) - 1`` can result in a `significant loss of precision <https://en.wikipedia.org/wiki/Loss_of_significance>`_\; the :func:`expm1` function provides a way to compute this quantity to full precision::
tr: x* kuvvetine yükseltilmiş *e* döndürür, eksi 1. Burada *e* doğal logaritma tabanıdır. Küçük kayan değerler *x* için, ``exp(x) - 1`` çıkarma işlemi `önemli bir hassasiyet kaybına <https://en.wikipedia.org/wiki/Loss_of_significance>`_\ neden olabilir; :func:`expm1` fonksiyonu bu miktarı tam hassasiyetle hesaplamak için bir yol sağlar::

source: With one argument, return the natural logarithm of *x* (to base *e*).
tr: Bir bağımsız değişkenle, *x*'in doğal logaritmasını döndürür (*e* tabanına göre).

source: With two arguments, return the logarithm of *x* to the given *base*, calculated as ``log(x)/log(base)``.
tr: İki bağımsız değişkenle, ``log(x)/log(taban)`` şeklinde hesaplanan *x* değerinin verilen *taban* değerine göre logaritmasını döndürür.

source: Return the natural logarithm of *1+x* (base *e*). The result is calculated in a way which is accurate for *x* near zero.
tr: *1+x*'in (*e* tabanı) doğal logaritmasını döndürür. Sonuç, sıfıra yakın *x* için doğru olacak şekilde hesaplanır.

source: Return the base-2 logarithm of *x*. This is usually more accurate than ``log(x, 2)``.
tr: x*'in 2 taban logaritmasını döndürür. Bu genellikle ``log(x, 2)`` değerinden daha doğrudur.
