Repository: python/python-docs-tr
Catalog: library/stdtypes.po
Languages: tr

source: :meth:`bytes.hex` now supports optional *sep* and *bytes_per_sep* parameters to insert separators between bytes in the hex output.
tr: :meth:`bytes.hex` artık isteğe bağlı *sep* ve *bytes_per_sep* parametrelerini onaltılık çıktıda baytlar arasına ayırıcılar eklemek için destekliyor.

source: Since bytes objects are sequences of integers (akin to a tuple), for a bytes object *b*, ``b[0]`` will be an integer, while ``b[0:1]`` will be a bytes object of length 1. (This contrasts with text strings, where both indexing and slicing will produce a string of length 1)
tr: Bayt nesneleri tamsayı dizileri olduğundan (bir demete benzer), bir bayt nesnesi için *b*, "b[0]" bir tamsayı, "b[0:1]"" ise bir bayt olacaktır. 1 uzunluğunda nesne. (Bu, hem indekslemenin hem de dilimlemenin 1 uzunluğunda bir dizi üreteceği metin dizeleriyle çelişir)

source: The representation of bytes objects uses the literal format (``b'...'``) since it is often more useful than e.g. ``bytes([46, 46, 46])``. You can always convert a bytes object into a list of integers using ``list(b)``.
tr: Bayt nesnelerinin temsili, genellikle örn. ``bayt([46, 46, 46])``. ``list(b)`` kullanarak bir bayt nesnesini her zaman bir tamsayılar listesine dönüştürebilirsiniz.

source: Bytearray Objects
tr: Bytearray Nesneleri

source: :class:`bytearray` objects are a mutable counterpart to :class:`bytes` objects.
tr: :class:`bytearray` nesneleri, :class:`bytes` nesnelerinin değişken karşılığıdır.

source: There is no dedicated literal syntax for bytearray objects, instead they are always created by calling the constructor:
tr: Bytearray nesneleri için özel bir sözdizimi yoktur, bunun yerine her zaman yapıcı çağrılarak oluşturulurlar:

source: Creating an empty instance: ``bytearray()``
tr: Boş bir örnek oluşturuluyor: ``bytearray()``

source: Creating a zero-filled instance with a given length: ``bytearray(10)``
tr: Belirli bir uzunlukta sıfır dolgulu bir örnek oluşturma: ``bytearray(10)``

source: From an iterable of integers: ``bytearray(range(20))``
tr: Yinelenen tamsayılardan: ``bytearray(range(20))``

source: Copying existing binary data via the buffer protocol: ``bytearray(b'Hi!')``
tr: Mevcut ikili verileri arabellek protokolü aracılığıyla kopyalama: ``bytearray(b'Hi!')``

source: As bytearray objects are mutable, they support the :ref:`mutable <typesseq-mutable>` sequence operations in addition to the common bytes and bytearray operations described in :ref:`bytes-methods`.
tr: Bytearray nesneleri değiştirilebilir olduğundan, :ref:`bytes-methods`da açıklanan ortak bayt ve bytearray işlemlerine ek olarak :ref:`mutable <typesseq-mutable>` dizi işlemlerini desteklerler.

source: Also see the :ref:`bytearray <func-bytearray>` built-in.
tr: Ayrıca :ref:`bytearray <func-bytearray>` yerleşikine de bakın.

source: Since 2 hexadecimal digits correspond precisely to a single byte, hexadecimal numbers are a commonly used format for describing binary data. Accordingly, the bytearray type has an additional class method to read data in that format:
tr: 2 onaltılık basamak tam olarak tek bir bayta karşılık geldiğinden, onaltılık sayılar ikili verileri tanımlamak için yaygın olarak kullanılan bir formattır. Buna göre bytearray türü, bu formattaki verileri okumak için ek bir sınıf yöntemine sahiptir:

source: This :class:`bytearray` class method returns bytearray object, decoding the given string object. The string must contain two hexadecimal digits per byte, with ASCII whitespace being ignored.
tr: Bu :class:`bytearray` sınıf yöntemi, verilen string nesnesinin kodunu çözerek bytearray nesnesini döndürür. Dize, bayt başına iki onaltılık basamak içermelidir ve ASCII boşluk yok sayılır.

source: A reverse conversion function exists to transform a bytearray object into its hexadecimal representation.
tr: Bir bytearray nesnesini onaltılık gösterimine dönüştürmek için bir ters dönüştürme işlevi mevcuttur.

source: Similar to :meth:`bytes.hex`, :meth:`bytearray.hex` now supports optional *sep* and *bytes_per_sep* parameters to insert separators between bytes in the hex output.
tr: :meth:`bytes.hex`e benzer şekilde, :meth:`bytearray.hex` artık onaltılık çıktıda baytlar arasına ayırıcılar eklemek için isteğe bağlı *sep* ve *bytes_per_sep* parametrelerini destekliyor.

source: Since bytearray objects are sequences of integers (akin to a list), for a bytearray object *b*, ``b[0]`` will be an integer, while ``b[0:1]`` will be a bytearray object of length 1. (This contrasts with text strings, where both indexing and slicing will produce a string of length 1)
tr: :meth:`bytes.hex`e benzer şekilde, :meth:`bytearray.hex` artık onaltılık çıktıda baytlar ayıranlar ayırmak için yatay bağlı *sep* ve *bytes_per_sep* paylaşımını yapabilir.

source: The representation of bytearray objects uses the bytes literal format (``bytearray(b'...')``) since it is often more useful than e.g. ``bytearray([46, 46, 46])``. You can always convert a bytearray object into a list of integers using ``list(b)``.
tr: Bytearray nesnelerinin temsili bytes değişmez formatını kullanır (``bytearray(b'...')``), çünkü bu genellikle ör. "bytearray([46, 46, 46])". Bir bytearray nesnesini her zaman ``list(b)`` kullanarak bir tamsayı listesine dönüştürebilirsiniz.

source: Bytes and Bytearray Operations
tr: Bayt ve Bytearray İşlemleri

source: Both bytes and bytearray objects support the :ref:`common <typesseq-common>` sequence operations. They interoperate not just with operands of the same type, but with any :term:`bytes-like object`. Due to this flexibility, they can be freely mixed in operations without causing errors. However, the return type of the result may depend on the order of operands.
tr: Hem bayt hem de bytearray nesneleri :ref:`common <typesseq-common>` dizi işlemlerini destekler. Yalnızca aynı türden işlenenlerle değil, herhangi bir :term:`bayt benzeri nesneyle' birlikte çalışırlar. Bu esneklik nedeniyle, operasyonlarda hataya neden olmadan serbestçe karıştırılabilirler. Ancak, sonucun dönüş tipi, işlenenlerin sırasına bağlı olabilir.

source: The methods on bytes and bytearray objects don't accept strings as their arguments, just as the methods on strings don't accept bytes as their arguments. For example, you have to write::
tr: Baytlar ve bayt dizisi nesneleri üzerindeki yöntemler, bağımsız değişkenleri olarak dizeleri kabul etmez, tıpkı dizelerdeki yöntemlerin bağımsız değişkenleri olarak baytları kabul etmemesi gibi. Örneğin, şunu yazmalısınız::

source: and::
tr: ve::

source: Some bytes and bytearray operations assume the use of ASCII compatible binary formats, and hence should be avoided when working with arbitrary binary data. These restrictions are covered below.
tr: Bazı baytlar ve bayt dizisi işlemleri, ASCII uyumlu ikili biçimlerin kullanıldığını varsayar ve bu nedenle rastgele ikili verilerle çalışırken kaçınılmalıdır. Bu kısıtlamalar aşağıda ele alınmıştır.

source: Using these ASCII based operations to manipulate binary data that is not stored in an ASCII based format may lead to data corruption.
tr: ASCII tabanlı bir biçimde depolanmayan ikili verileri işlemek için bu ASCII tabanlı işlemleri kullanmak, verilerin bozulmasına neden olabilir.

source: The following methods on bytes and bytearray objects can be used with arbitrary binary data.
tr: Bayt ve bytearray nesneleri üzerindeki aşağıdaki yöntemler rastgele ikili verilerle kullanılabilir.

source: Return the number of non-overlapping occurrences of subsequence *sub* in the range [*start*, *end*]. Optional arguments *start* and *end* are interpreted as in slice notation.
tr: [*start*, *end*] aralığında *sub* alt dizesinin örtüşmeyen oluşumlarının sayısını döndürür. İsteğe bağlı bağımsız değişkenler *start* ve *end*, dilim notasyonunda olduğu gibi yorumlanır.

source: The subsequence to search for may be any :term:`bytes-like object` or an integer in the range 0 to 255.
tr: Aranacak alt dizi herhangi bir :term:`bytes-like object` veya 0 ila 255 aralığında bir tamsayı olabilir.

source: If *sub* is empty, returns the number of empty slices between characters which is the length of the bytes object plus one.
tr: Sub* boşsa, bytes nesnesinin uzunluğu artı bir olan karakterler arasındaki boş dilimlerin sayısını döndürür.

source: Also accept an integer in the range 0 to 255 as the subsequence.
tr: Ayrıca alt dizi olarak 0 ila 255 aralığında bir tamsayı kabul edin.

source: If the binary data starts with the *prefix* string, return ``bytes[len(prefix):]``. Otherwise, return a copy of the original binary data::
tr: İkili veri *önek* dizesiyle başlıyorsa, ``bytes[len(prefix):]`` döndürün. Aksi takdirde, orijinal ikili verilerin bir kopyasını döndürün::

source: The *prefix* may be any :term:`bytes-like object`.
tr: *Önek* herhangi bir :term:`bayt benzeri nesne` olabilir.

source: The bytearray version of this method does *not* operate in place - it always produces a new object, even if no changes were made.
tr: Bu yöntemin bytearray versiyonu yerinde *çalışmaz* - hiçbir değişiklik yapılmamış olsa bile her zaman yeni bir nesne üretir.

source: If the binary data ends with the *suffix* string and that *suffix* is not empty, return ``bytes[:-len(suffix)]``. Otherwise, return a copy of the original binary data::
tr: İkili veri *sonek* dizesiyle bitiyorsa ve bu *sonek* boş değilse, ``bytes[:-len(suffix)]`` döndürün. Aksi takdirde, orijinal ikili verilerin bir kopyasını döndürün::

source: The *suffix* may be any :term:`bytes-like object`.
tr: *Sonek* herhangi bir :term:`bayt benzeri nesne` olabilir.

source: Return the bytes decoded to a :class:`str`.
tr: :class:`bytes` olarak kodlanmış dizeyi döndürün.

source: *errors* controls how decoding errors are handled. If ``'strict'`` (the default), a :exc:`UnicodeError` exception is raised. Other possible values are ``'ignore'``, ``'replace'``, and any other name registered via :func:`codecs.register_error`. See :ref:`error-handlers` for details.
tr: *hatalar* kod çözme hatalarının nasıl ele alınacağını kontrol eder. ``'strict'`` (varsayılan), bir :exc:`UnicodeError` istisnası oluşturulur. Diğer olası değerler ``'ignore'``, ``'replace'`` ve :func:`codecs.register_error` aracılığıyla kaydedilen diğer adlardır. Ayrıntılar için :ref:`error-handlers` bölümüne bakın.

source: For performance reasons, the value of *errors* is not checked for validity unless a decoding error actually occurs, :ref:`devmode` is enabled or a :ref:`debug build <debug-build>` is used.
tr: Performans nedenleriyle, gerçekten bir kodlama hatası oluşmadıkça, :ref:`devmode` etkinleştirilmedikçe veya :ref:`debug build <debug-build>` kullanılmadıkça *errors* değeri geçerlilik açısından kontrol edilmez.

source: Passing the *encoding* argument to :class:`str` allows decoding any :term:`bytes-like object` directly, without needing to make a temporary :class:`!bytes` or :class:`!bytearray` object.
tr: *kodlama* bağımsız değişkeninin :class:`str` öğesine iletilmesi, herhangi bir :term:`bytes benzeri nesnenin' kodunun, geçici bir bayt veya bytearray nesnesi oluşturmaya gerek kalmadan doğrudan çözülmesini sağlar.

source: Return ``True`` if the binary data ends with the specified *suffix*, otherwise return ``False``. *suffix* can also be a tuple of suffixes to look for. With optional *start*, test beginning at that position. With optional *end*, stop comparing at that position.
tr: İkili veri belirtilen *sonek* ile bitiyorsa "True", aksi halde "False" döndürün. *sonek* ayrıca aranacak bir dizi sonek olabilir. İsteğe bağlı *başlangıç* ile, o konumdan başlayarak test edin. İsteğe bağlı *uç* ile, o konumda karşılaştırmayı bırakın.

source: The suffix(es) to search for may be any :term:`bytes-like object`.
tr: Aranacak sonek(ler) herhangi bir :term:`bayt benzeri nesne` olabilir.

source: Return the lowest index in the data where the subsequence *sub* is found, such that *sub* is contained in the slice ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` if *sub* is not found.
tr: *sub* alt dizisinin bulunduğu verideki en düşük dizini döndürün, öyle ki *sub* ``s[start:end]`` diliminde yer alıyor. İsteğe bağlı bağımsız değişkenler *start* ve *end*, dilim notasyonundaki gibi yorumlanır. *alt* bulunmazsa ``-1`` döndürün.

source: The :meth:`~bytes.find` method should be used only if you need to know the position of *sub*. To check if *sub* is a substring or not, use the :keyword:`in` operator::
tr: :meth:`~bytes.find` yöntemi yalnızca *sub* konumunu bilmeniz gerekiyorsa kullanılmalıdır. *sub*'nun bir alt dize olup olmadığını kontrol etmek için :keyword:`in` operatörünü kullanın::

source: Like :meth:`~bytes.find`, but raise :exc:`ValueError` when the subsequence is not found.
tr: :meth:`~bytes.find` gibi, ancak alt dizi bulunamadığında :exc:`ValueError` yükseltin.

source: Return a bytes or bytearray object which is the concatenation of the binary data sequences in *iterable*. A :exc:`TypeError` will be raised if there are any values in *iterable* that are not :term:`bytes-like objects <bytes-like object>`, including :class:`str` objects. The separator between elements is the contents of the bytes or bytearray object providing this method.
tr: *yinelenebilir*'deki ikili veri dizilerinin birleştirilmesi olan bir bayt veya bytearray nesnesi döndürün. :class:`str` nesneleri dahil olmak üzere *yinelenebilir* içinde :term:`bytes benzeri nesneler <bytes benzeri nesne>` olmayan herhangi bir değer varsa :exc:`TypeError` yükseltilir. Öğeler arasındaki ayırıcı, bu yöntemi sağlayan byte veya bytearray nesnesinin içeriğidir.

source: This static method returns a translation table usable for :meth:`bytes.translate` that will map each character in *from* into the character at the same position in *to*; *from* and *to* must both be :term:`bytes-like objects <bytes-like object>` and have the same length.
tr: Bu statik yöntem :meth:`bytes.translate` için kullanılabilen, *from* içindeki her karakteri *to* içindeki aynı konumdaki karaktere eşleyecek bir çeviri tablosu döndürür; *from* ve *to* :term:`bayt benzeri nesneler <bayt benzeri nesne>` olmalı ve aynı uzunluğa sahip olmalıdır.

source: Split the sequence at the first occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself or its bytearray copy, and the part after the separator. If the separator is not found, return a 3-tuple containing a copy of the original sequence, followed by two empty bytes or bytearray objects.
tr: Diziyi *sep*'in ilk geçtiği yerde bölün ve ayırıcıdan önceki kısmı, ayırıcının kendisini veya bytearray kopyasını ve ayırıcıdan sonraki kısmı içeren 3'lü bir demet döndürün. Ayırıcı bulunamazsa, orijinal dizinin bir kopyasını içeren 3'lü bir demet ve ardından iki boş bayt veya bytearray nesnesi döndürün.

source: The separator to search for may be any :term:`bytes-like object`.
tr: Aranacak ayırıcı herhangi bir :term:`bayt benzeri nesne` olabilir.

source: Return a copy of the sequence with all occurrences of subsequence *old* replaced by *new*. If the optional argument *count* is given, only the first *count* occurrences are replaced.
tr: *eski* alt dizisinin tüm oluşumları *yeni* ile değiştirilerek dizinin bir kopyasını döndürür. İsteğe bağlı *count* bağımsız değişkeni verilirse, yalnızca ilk *count* oluşumları değiştirilir.

source: The subsequence to search for and its replacement may be any :term:`bytes-like object`.
tr: Aranacak alt dizi ve bunun değiştirilmesi herhangi bir :term:`bayt benzeri nesne' olabilir.

source: Return the highest index in the sequence where the subsequence *sub* is found, such that *sub* is contained within ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` on failure.
tr: *sub* alt dizisinin bulunduğu dizideki en yüksek dizini, *sub* ``s[start:end]`` içinde yer alacak şekilde döndürün. İsteğe bağlı bağımsız değişkenler *start* ve *end*, dilim notasyonundaki gibi yorumlanır. Başarısızlık durumunda ``-1`` döndürün.

source: Like :meth:`~bytes.rfind` but raises :exc:`ValueError` when the subsequence *sub* is not found.
tr: :meth:`~bytes.rfind` gibi, ancak *sub* alt dizisi bulunamadığında :exc:`ValueError` yükseltir.

source: Split the sequence at the last occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself or its bytearray copy, and the part after the separator. If the separator is not found, return a 3-tuple containing two empty bytes or bytearray objects, followed by a copy of the original sequence.
tr: Diziyi *sep*'in son geçtiği yerde bölün ve ayırıcıdan önceki kısmı, ayırıcının kendisini veya bytearray kopyasını ve ayırıcıdan sonraki kısmı içeren 3'lü bir demet döndürün. Ayırıcı bulunamazsa, iki boş bayt veya bytearray nesnesi içeren 3'lü bir demet ve ardından orijinal dizinin bir kopyasını döndürün.

source: Return ``True`` if the binary data starts with the specified *prefix*, otherwise return ``False``. *prefix* can also be a tuple of prefixes to look for. With optional *start*, test beginning at that position. With optional *end*, stop comparing at that position.
tr: İkili veri belirtilen * önek* ile başlıyorsa "True" döndürün, aksi takdirde "False" döndürün. *önek* aranacak bir dizi önek de olabilir. İsteğe bağlı *başlangıç* ile, o konumdan başlayarak test edin. İsteğe bağlı *uç* ile, o konumda karşılaştırmayı bırakın.

source: The prefix(es) to search for may be any :term:`bytes-like object`.
tr: Aranacak önek(ler) herhangi bir :term:`bayt benzeri nesne` olabilir.

source: Return a copy of the bytes or bytearray object where all bytes occurring in the optional argument *delete* are removed, and the remaining bytes have been mapped through the given translation table, which must be a bytes object of length 256.
tr: İsteğe bağlı *delete* bağımsız değişkeninde bulunan tüm baytların kaldırıldığı ve kalan baytların, 256 uzunluğunda bir bayt nesnesi olması gereken, verilen çeviri tablosu aracılığıyla eşlendiği bayt veya bytearray nesnesinin bir kopyasını döndürün.

source: You can use the :func:`bytes.maketrans` method to create a translation table.
tr: Çeviri tablosu oluşturmak için :func:`bytes.maketrans` yöntemini kullanabilirsiniz.

source: Set the *table* argument to ``None`` for translations that only delete characters::
tr: Yalnızca karakterleri silen çeviriler için *tablo* bağımsız değişkenini ``Yok`` olarak ayarlayın::

source: *delete* is now supported as a keyword argument.
tr: *delete* artık bir anahtar kelime bağımsız değişkeni olarak desteklenmektedir.

source: The following methods on bytes and bytearray objects have default behaviours that assume the use of ASCII compatible binary formats, but can still be used with arbitrary binary data by passing appropriate arguments. Note that all of the bytearray methods in this section do *not* operate in place, and instead produce new objects.
tr: Baytlar ve bayt dizisi nesneleri üzerindeki aşağıdaki yöntemler, ASCII uyumlu ikili biçimlerin kullanıldığını varsayan varsayılan davranışlara sahiptir, ancak yine de uygun bağımsız değişkenler iletilerek rasgele ikili verilerle kullanılabilir. Bu bölümdeki tüm bytearray yöntemlerinin yerinde *çalışmadığını* ve bunun yerine yeni nesneler ürettiğini unutmayın.

source: Return a copy of the object centered in a sequence of length *width*. Padding is done using the specified *fillbyte* (default is an ASCII space). For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(s)``.
tr: Uzunluk *genişlik* dizisinde ortalanmış nesnenin bir kopyasını döndürün. Dolgu, belirtilen *fillbyte* kullanılarak yapılır (varsayılan, bir ASCII alanıdır). :class:`bytes` nesneleri için, *width* ``len(s)``den küçük veya ona eşitse orijinal sıra döndürülür.

source: Return a copy of the object left justified in a sequence of length *width*. Padding is done using the specified *fillbyte* (default is an ASCII space). For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(s)``.
tr: Nesnenin uzunluk *genişlik* dizisinde sola yaslanmış bir kopyasını döndürün. Doldurma, belirtilen *fillbyte* kullanılarak yapılır (varsayılan, bir ASCII alanıdır). :class:`bytes` nesneleri için, *width* ``len(s)``den küçük veya ona eşitse orijinal sıra döndürülür.

source: Return a copy of the sequence with specified leading bytes removed. The *chars* argument is a binary sequence specifying the set of byte values to be removed - the name refers to the fact this method is usually used with ASCII characters. If omitted or ``None``, the *chars* argument defaults to removing ASCII whitespace. The *chars* argument is not a prefix; rather, all combinations of its values are stripped::
tr: Belirtilen baştaki baytlar kaldırılmış olarak dizinin bir kopyasını döndürün. *chars* bağımsız değişkeni, kaldırılacak bayt değerleri kümesini belirten ikili bir dizidir - ad, bu yöntemin genellikle ASCII karakterleriyle kullanıldığı gerçeğini ifade eder. Atlanırsa veya "Yok" ise, *karakterler* bağımsız değişkeni varsayılan olarak ASCII boşluklarını kaldırır. *chars* bağımsız değişkeni bir önek değildir; bunun yerine, değerlerinin tüm kombinasyonları çıkarılır:

source: The binary sequence of byte values to remove may be any :term:`bytes-like object`. See :meth:`~bytes.removeprefix` for a method that will remove a single prefix string rather than all of a set of characters. For example::
tr: Kaldırılacak bayt değerlerinin ikili dizisi, herhangi bir :term:`bayt benzeri nesne' olabilir. Tüm karakter kümesi yerine tek bir önek dizesini kaldıracak bir yöntem için :meth:`~bytes.removeprefix` konusuna bakın. Örneğin::

source: Return a copy of the object right justified in a sequence of length *width*. Padding is done using the specified *fillbyte* (default is an ASCII space). For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(s)``.
tr: Nesnenin bir kopyasını uzunluk *genişlik* dizisinde sağa dayalı olarak döndürün. Dolgu, belirtilen *fillbyte* kullanılarak yapılır (varsayılan, bir ASCII alanıdır). :class:`bytes` nesneleri için, *width* ``len(s)``den küçük veya ona eşitse orijinal sıra döndürülür.

source: Split the binary sequence into subsequences of the same type, using *sep* as the delimiter string. If *maxsplit* is given, at most *maxsplit* splits are done, the *rightmost* ones. If *sep* is not specified or ``None``, any subsequence consisting solely of ASCII whitespace is a separator. Except for splitting from the right, :meth:`rsplit` behaves like :meth:`split` which is described in detail below.
tr: Ayırıcı dize olarak *sep* kullanarak ikili diziyi aynı türden alt dizilere bölün. *maxsplit* verilirse en çok *maxsplit* split yapılır, *en sağdaki* olanlardan. *bölme* belirtilmezse veya "Yok" ise, yalnızca ASCII boşluktan oluşan herhangi bir alt dizi bir ayırıcıdır. Sağdan ayırma dışında :meth:`rsplit`, aşağıda ayrıntılı olarak açıklanan :meth:`split` gibi davranır.
