Repository: python/python-docs-tr
Catalog: library/stdtypes.po
Languages: tr

source: The exception passed in should never be reraised explicitly - instead, this method should return a false value to indicate that the method completed successfully and does not want to suppress the raised exception. This allows context management code to easily detect whether or not an :meth:`__exit__` method has actually failed.
tr: Geçirilen istisna asla açıkça yeniden yükseltilmemelidir - bunun yerine, bu yöntem, yöntemin başarıyla tamamlandığını ve ortaya çıkan istisnayı bastırmak istemediğini belirtmek için yanlış bir değer döndürmelidir. Bu, bağlam yönetimi kodunun bir :meth:`__exit__` yönteminin gerçekten başarısız olup olmadığını kolayca algılamasını sağlar.

source: Python defines several context managers to support easy thread synchronisation, prompt closure of files or other objects, and simpler manipulation of the active decimal arithmetic context. The specific types are not treated specially beyond their implementation of the context management protocol. See the :mod:`contextlib` module for some examples.
tr: Python, kolay iş parçacığı senkronizasyonunu, dosyaların veya diğer nesnelerin hızlı kapatılmasını ve etkin ondalık aritmetik bağlamın daha basit şekilde değiştirilmesini desteklemek için çeşitli bağlam yöneticileri tanımlar. Belirli türler, bağlam yönetimi protokolünün uygulanmasının ötesinde özel olarak ele alınmaz. Bazı örnekler için :mod:`contextlib` modülüne bakın.

source: Python's :term:`generator`\s and the :class:`contextlib.contextmanager` decorator provide a convenient way to implement these protocols. If a generator function is decorated with the :class:`contextlib.contextmanager` decorator, it will return a context manager implementing the necessary :meth:`~contextmanager.__enter__` and :meth:`~contextmanager.__exit__` methods, rather than the iterator produced by an undecorated generator function.
tr: Python'un :term:`generator`\s ve :class:`contextlib.contextmanager` dekoratörü, bu protokolleri uygulamak için uygun bir yol sağlar. Bir oluşturucu işlevi :class:`contextlib.contextmanager` dekoratörü ile dekore edilmişse, gerekli :meth:`~contextmanager.__enter__` ve :meth:`~contextmanager.__exit__` yöntemlerini yerine uygulayan bir bağlam yöneticisi döndürür. süslenmemiş bir oluşturucu işlevi tarafından üretilen yineleyici.

source: Note that there is no specific slot for any of these methods in the type structure for Python objects in the Python/C API. Extension types wanting to define these methods must provide them as a normal Python accessible method. Compared to the overhead of setting up the runtime context, the overhead of a single class dictionary lookup is negligible.
tr: Python/C API'sindeki Python nesnelerinin tür yapısında bu yöntemlerden herhangi biri için belirli bir yuva bulunmadığına dikkat edin. Bu yöntemleri tanımlamak isteyen uzantı türleri, onları normal bir Python erişilebilir yöntemi olarak sağlamalıdır. Çalışma zamanı bağlamını ayarlama ek yüküyle karşılaştırıldığında, tek bir sınıf sözlüğü aramasının ek yükü ihmal edilebilir düzeydedir.

source: Type Annotation Types --- :ref:`Generic Alias <types-genericalias>`, :ref:`Union <types-union>`
tr: Tür Ek Açıklama Türleri --- :ref:`Genel Diğer Ad <türler-genericalias>`, :ref:`Union <türler-birliği>`

source: The core built-in types for :term:`type annotations <annotation>` are :ref:`Generic Alias <types-genericalias>` and :ref:`Union <types-union>`.
tr: :term:`tür açıklamaları <annotation>` için temel yerleşik tipler :ref:`Generic Alias ​​<types-genericalias>` ve :ref:`Union <types-union>`dır.

source: Generic Alias Type
tr: Genel Takma Ad Türü

source: ``GenericAlias`` objects are generally created by :ref:`subscripting <subscriptions>` a class. They are most often used with :ref:`container classes <sequence-types>`, such as :class:`list` or :class:`dict`. For example, ``list[int]`` is a ``GenericAlias`` object created by subscripting the ``list`` class with the argument :class:`int`. ``GenericAlias`` objects are intended primarily for use with :term:`type annotations <annotation>`.
tr: ``GenericAlias`` nesneleri genellikle :ref:`bir sınıfa abone olarak <subscriptions>` tarafından oluşturulur. Genellikle :ref:`container classs <sequence-types>` ile birlikte kullanılırlar, örneğin :class:`list` veya :class:`dict`. Örneğin, "list[int]", "list" sınıfına :class:"int" argümanıyla abone olunarak oluşturulan bir "GenericAlias" nesnesidir. ``GenericAlias`` nesnelerinin birincil olarak :term:`tür açıklamaları <annotation>` ile kullanılması amaçlanmıştır.

source: It is generally only possible to subscript a class if the class implements the special method :meth:`~object.__class_getitem__`.
tr: Bir sınıfa abone olmak genellikle yalnızca, sınıf :meth:`~object.__class_getitem__` özel yöntemini uygularsa mümkündür.

source: A ``GenericAlias`` object acts as a proxy for a :term:`generic type`, implementing *parameterized generics*.
tr: Bir ``GenericAlias`` nesnesi, :term:`generic type` için bir vekil olarak hareket eder ve *parameterized generics* uygular.

source: For a container class, the argument(s) supplied to a :ref:`subscription <subscriptions>` of the class may indicate the type(s) of the elements an object contains. For example, ``set[bytes]`` can be used in type annotations to signify a :class:`set` in which all the elements are of type :class:`bytes`.
tr: Bir taşıyıcı sınıf için, sınıfın bir :ref:`subscription <subscriptions>` öğesine sağlanan argüman(lar), bir nesnenin içerdiği öğelerin tip(ler)ini gösterebilir. Örneğin, "set[bytes]", tür ek açıklamalarında, içindeki tüm öğelerin :class:"bytes" türünde olduğu bir :class:"set"i belirtmek için kullanılabilir.

source: For a class which defines :meth:`~object.__class_getitem__` but is not a container, the argument(s) supplied to a subscription of the class will often indicate the return type(s) of one or more methods defined on an object. For example, :mod:`regular expressions <re>` can be used on both the :class:`str` data type and the :class:`bytes` data type:
tr: :meth:`~object.__class_getitem__` tanımlayan ancak kapsayıcı olmayan bir sınıf için, sınıfın aboneliğine sağlanan bağımsız değişken(ler) genellikle bir nesne üzerinde tanımlanan bir veya daha fazla yöntemin dönüş tipini/türlerini gösterir. . Örneğin, :mod:`normal ifadeler <re>` hem :class:`str` veri tipinde hem de :class:`bytes` veri tipinde kullanılabilir:

source: If ``x = re.search('foo', 'foo')``, ``x`` will be a :ref:`re.Match <match-objects>` object where the return values of ``x.group(0)`` and ``x[0]`` will both be of type :class:`str`. We can represent this kind of object in type annotations with the ``GenericAlias`` ``re.Match[str]``.
tr: ``x = re.search('foo', 'foo')`` ise, `x` bir :ref:`re.Match <match-objects>` nesnesi olacaktır; burada ``x'in dönüş değerleri .group(0)`` ve ``x[0]`` her ikisi de :class:`str` türünde olacaktır. Bu tür nesneleri tip ek açıklamalarında ``GenericAlias`` ``re.Match[str]`` ile temsil edebiliriz.

source: If ``y = re.search(b'bar', b'bar')``, (note the ``b`` for :class:`bytes`), ``y`` will also be an instance of ``re.Match``, but the return values of ``y.group(0)`` and ``y[0]`` will both be of type :class:`bytes`. In type annotations, we would represent this variety of :ref:`re.Match <match-objects>` objects with ``re.Match[bytes]``.
tr: ``y = re.search(b'bar', b'bar')`` ise ( :class:`bytes` için ''b``ye dikkat edin), ``y`` aynı zamanda "re.Match", ancak "y.group(0)" ve "y[0]" dönüş değerlerinin her ikisi de :class:"bytes" türünde olacaktır. Tip ek açıklamalarında, bu çeşitli :ref:`re.Match <match-objects>` nesneleri ``re.Match[bytes]`` ile temsil ederiz.

source: ``GenericAlias`` objects are instances of the class :class:`types.GenericAlias`, which can also be used to create ``GenericAlias`` objects directly.
tr: ``GenericAlias`` nesneleri, doğrudan ``GenericAlias`` nesneleri oluşturmak için de kullanılabilen :class:`types.GenericAlias` sınıfının örnekleridir.

source: Creates a ``GenericAlias`` representing a type ``T`` parameterized by types *X*, *Y*, and more depending on the ``T`` used. For example, a function expecting a :class:`list` containing :class:`float` elements::
tr: Kullanılan ``T`` türüne bağlı olarak *X*, *Y* ve daha fazla tür tarafından parametrelenen bir ``T`` türünü temsil eden bir ``GenericAlias`` oluşturur. Örneğin, :class:`float` elemanları içeren bir :class:`list` bekleyen bir fonksiyon::

source: Another example for :term:`mapping` objects, using a :class:`dict`, which is a generic type expecting two type parameters representing the key type and the value type. In this example, the function expects a ``dict`` with keys of type :class:`str` and values of type :class:`int`::
tr: Anahtar türünü ve değer türünü temsil eden iki tür parametresi bekleyen genel bir tür olan :class:`dict` kullanarak :term:`mapping` nesneleri için başka bir örnek. Bu örnekte, fonksiyon :class:`str` türünde anahtarları ve :class:`int` türünde değerleri olan bir ``dict`` bekler::

source: The builtin functions :func:`isinstance` and :func:`issubclass` do not accept ``GenericAlias`` types for their second argument::
tr: Yerleşik :func:`isinstance` ve :func:`issubclass` işlevleri ikinci argümanları için ``GenericAlias`` türlerini kabul etmez::

source: The Python runtime does not enforce :term:`type annotations <annotation>`. This extends to generic types and their type parameters. When creating a container object from a ``GenericAlias``, the elements in the container are not checked against their type. For example, the following code is discouraged, but will run without errors::
tr: Python çalışma zamanı :term:`tip anotasyonları <annotation>` 'nı zorlamaz. Bu, genel türleri ve bunların tür parametrelerini de kapsar. Bir ``GenericAlias`` türünden bir konteyner nesnesi oluştururken, konteynerdeki elemanlar türlerine göre kontrol edilmez. Örneğin, aşağıdaki kod tavsiye edilmez, ancak hatasız çalışacaktır::

source: Furthermore, parameterized generics erase type parameters during object creation::
tr: Ayrıca, parametrelendirilmiş jenerikler nesne oluşturma sırasında tip parametrelerini siler::

source: Calling :func:`repr` or :func:`str` on a generic shows the parameterized type::
tr: Bir jenerik üzerinde :func:`repr` veya :func:`str` çağrısı parametrelendirilmiş türü gösterir::

source: The :meth:`~object.__getitem__` method of generic containers will raise an exception to disallow mistakes like ``dict[str][str]``::
tr: Genel kapsayıcıların :meth:`~object.__getitem__` metodu, ``dict[str][str]`` gibi hatalara izin vermemek için bir istisna oluşturacaktır::

source: However, such expressions are valid when :ref:`type variables <generics>` are used. The index must have as many elements as there are type variable items in the ``GenericAlias`` object's :attr:`~genericalias.__args__`. ::
tr: Ancak, bu tür ifadeler :ref:`type variables <generics>` kullanıldığında geçerlidir. Dizin, ``GenericAlias`` nesnesinin :attr:`~genericalias.__args__` öğesindeki tür değişkeni öğeleri kadar öğeye sahip olmalıdır::

source: Standard Generic Classes
tr: Standart Jenerik Sınıflar

source: The following standard library classes support parameterized generics. This list is non-exhaustive.
tr: Bu standart kütüphane sınıfları parametrelendirilmiş jenerikleri destekler. Bu liste kapsamlı değildir.

source: :class:`queue.SimpleQueue`
tr: :class:`tuple`

source: Special Attributes of ``GenericAlias`` objects
tr: ``GenericAlias`` objesinin Özel Öznitelikleri

source: All parameterized generics implement special read-only attributes.
tr: Tüm parametreli jenerikler özel salt okunur öznitelikler uygular.

source: This attribute points at the non-parameterized generic class::
tr: Bu öznitelik, parametrelendirilmemiş genel sınıfa işaret eder::

source: This attribute is a :class:`tuple` (possibly of length 1) of generic types passed to the original :meth:`~object.__class_getitem__` of the generic class::
tr: Bu öznitelik, jenerik sınıfın orijinal :meth:`~object.__class_getitem__` öğesine iletilen jenerik tiplerinden bir :class:`tuple` 'dır (muhtemelen 1 uzunluğunda)::

source: This attribute is a lazily computed tuple (possibly empty) of unique type variables found in ``__args__``::
tr: Bu öznitelik, ''__args__'' içinde bulunan benzersiz tür değişkenlerin tembel bir şekilde hesaplanmış bir demetidir (muhtemelen boş):

source: A ``GenericAlias`` object with :class:`typing.ParamSpec` parameters may not have correct ``__parameters__`` after substitution because :class:`typing.ParamSpec` is intended primarily for static type checking.
tr: ``GenericAlias`` nesnesi ile :class:`typing.ParamSpec` parametreleri değiştirildikten sonra doğru ``__parameters__`` olmayabilir çünkü :class:`typing.ParamSpec` öncelikle statik tip kontrolü için tasarlanmıştır.

source: A boolean that is true if the alias has been unpacked using the ``*`` operator (see :data:`~typing.TypeVarTuple`).
tr: Takma ad ``*`` işleci kullanılarak açıldıysa doğru olan bir boolean (bkz. :data:`~typing.TypeVarTuple`).

source: :pep:`484` - Type Hints
tr: :pep:`484` - Tip İpuçları

source: Introducing Python's framework for type annotations.
tr: Tip ek açıklamaları için Python çerçevesiyle tanışın.

source: :pep:`585` - Type Hinting Generics In Standard Collections
tr: :pep:`585` - Standart Koleksiyonlarda Tip İma Etme (Type Hinting) Jenerikleri

source: Introducing the ability to natively parameterize standard-library classes, provided they implement the special class method :meth:`~object.__class_getitem__`.
tr: :meth:`~object.__class_getitem__` özel sınıf yöntemini uygulamaları koşuluyla, standart kitaplık sınıflarını yerel olarak parametreleştirme yeteneğiyle tanışın.

source: :ref:`Generics`, :ref:`user-defined generics <user-defined-generics>` and :class:`typing.Generic`
tr: :ref:`Jenerics`, :ref:`kullanıcı tanımlı jenerikler <user-defined-generics>` ve :class:`typing.Generic`

source: Documentation on how to implement generic classes that can be parameterized at runtime and understood by static type-checkers.
tr: Çalışma zamanında parametrelendirilebilen ve statik tür denetleyiciler tarafından anlaşılabilen genel sınıfların nasıl uygulanacağına ilişkin belgeler.

source: Union Type
tr: Sendika Türü

source: A union object holds the value of the ``|`` (bitwise or) operation on multiple :ref:`type objects <bltin-type-objects>`. These types are intended primarily for :term:`type annotations <annotation>`. The union type expression enables cleaner type hinting syntax compared to :data:`typing.Union`.
tr: Bir birleşim nesnesi, birden çok :ref:`type objects <bltin-type-objects>` üzerinde ``|`` (bitsel veya) işleminin değerini tutar. Bu türler öncelikle aşağıdakiler için tasarlanmıştır :term:`type annotations <annotation>`. Birleşim türü ifadesi, aşağıdakilere kıyasla daha temiz tür ipucu sözdizimi sağlar :data:`typing.Union`.

source: Defines a union object which holds types *X*, *Y*, and so forth. ``X | Y`` means either X or Y. It is equivalent to ``typing.Union[X, Y]``. For example, the following function expects an argument of type :class:`int` or :class:`float`::
tr: *X*, *Y* vb. türleri tutan bir birleşim nesnesi tanımlar. ``X | Y`` X veya Y anlamına gelir. Bu, ``typing.Union[X, Y]`` ile eş değerdir. Örneğin, aşağıdaki işlev :class:`int` veya :class:`float`::

source: The ``|`` operand cannot be used at runtime to define unions where one or more members is a forward reference. For example, ``int | "Foo"``, where ``"Foo"`` is a reference to a class not yet defined, will fail at runtime. For unions which include forward references, present the whole expression as a string, e.g. ``"int | Foo"``.
tr: ``|`` işleneni çalışma zamanında bir veya daha fazla üyenin ileri başvuru olduğu birleşimleri tanımlamak için kullanılamaz. Örneğin, ``int | Henüz tanımlanmamış bir sınıfa referans olan "Foo"``, burada ``"Foo"`` çalışma zamanında başarısız olur. İleriye doğru referanslar içeren birleşimler için ifadenin tamamını bir dize olarak sunun; ``"int | Foo"``.

source: Union objects can be tested for equality with other union objects. Details:
tr: Birlik nesneleri, diğer birlik nesneleriyle eşitlik açısından test edilebilir. Detaylar:

source: Unions of unions are flattened::
tr: Birliklerin birlikleri düzleştirimiştir::

source: Redundant types are removed::
tr: Gereksiz türler kaldırılır::

source: When comparing unions, the order is ignored::
tr: Birlikleri karşılaştırırken, sipariş göz ardı edilir::

source: It is compatible with :data:`typing.Union`::
tr: :data:`typing.Union`:: ile uyumludur:

source: Optional types can be spelled as a union with ``None``::
tr: İsteğe bağlı türler ``None``:: ile bir birlik olarak yazılabilir:

source: Calls to :func:`isinstance` and :func:`issubclass` are also supported with a union object::
tr: :func:`isinstance` ve :func:`issubclass` çağrıları da bir birlik nesnesiyle desteklenir::

source: However, :ref:`parameterized generics <types-genericalias>` in union objects cannot be checked::
tr: -Ancak, birleşim nesnelerindeki :ref:`parametreli jenerikler <types-genericalias>` kontrol edilemez::

source: The user-exposed type for the union object can be accessed from :data:`types.UnionType` and used for :func:`isinstance` checks. An object cannot be instantiated from the type::
tr: Union nesnesinin kullanıcıya açık türüne :data:`types.UnionType` adresinden erişilebilir ve :func:`isinstance` kontrolleri için kullanılabilir. Bir nesne şu türden örneklenemez::

source: The :meth:`__or__` method for type objects was added to support the syntax ``X | Y``. If a metaclass implements :meth:`__or__`, the Union may override it::
tr: Tür nesneleri için :meth:`__or__` yöntemi, ``X | Y`` sözdizimini desteklemek için eklendi. Eğer bir metaclass :meth:`__or__` metodunu uygularsa, Union bunu geçersiz kılabilir::

source: :pep:`604` -- PEP proposing the ``X | Y`` syntax and the Union type.
tr: :pep:`604` -- ``X | Y`` sözdizimini ve Birlik türünü öneren PEP.

source: Other Built-in Types
tr: Diğer Yerleşik Tipler

source: The interpreter supports several other kinds of objects. Most of these support only one or two operations.
tr: Yorumlayıcı başka nesne türlerini de destekler. Bunların çoğu yalnızca bir veya iki işlemi destekler.

source: Modules
tr: Modüller

source: The only special operation on a module is attribute access: ``m.name``, where *m* is a module and *name* accesses a name defined in *m*'s symbol table. Module attributes can be assigned to. (Note that the :keyword:`import` statement is not, strictly speaking, an operation on a module object; ``import foo`` does not require a module object named *foo* to exist, rather it requires an (external) *definition* for a module named *foo* somewhere.)
tr: Bir modül üzerindeki tek özel işlem öznitelik erişimidir: ``m.name``, burada *m* bir modüldür ve *name*, *m*'nin sembol tablosunda tanımlanan bir isme erişir. Modül nitelikleri atanabilir. (:keyword:`import` deyiminin kesinlikle bir modül nesnesi üzerinde bir işlem olmadığına dikkat edin; ``import foo`` *foo* adında bir modül nesnesinin var olmasını gerektirmez, bunun yerine bir yerlerde *foo* adında bir modül için (harici) bir *tanımlama* gerektirir)

source: A special attribute of every module is :attr:`~object.__dict__`. This is the dictionary containing the module's symbol table. Modifying this dictionary will actually change the module's symbol table, but direct assignment to the :attr:`~object.__dict__` attribute is not possible (you can write ``m.__dict__['a'] = 1``, which defines ``m.a`` to be ``1``, but you can't write ``m.__dict__ = {}``). Modifying :attr:`~object.__dict__` directly is not recommended.
tr: Her modülün özel bir niteliği :attr:`~object.__dict__` 'dir. Bu, modülün sembol tablosunu içeren sözlüktür. Bu sözlüğü değiştirmek aslında modülün sembol tablosunu değiştirecektir, ancak :attr:`~object.__dict__` niteliğine doğrudan atama yapmak mümkün değildir (``m.__dict__['a'] = 1`` yazabilirsiniz, bu ``m.a`` yı ``1`` olarak tanımlar, ancak ``m.__dict__ = {}`` yazamazsınız). :attr:`~object.__dict__` öğesinin doğrudan değiştirilmesi önerilmez.

source: Modules built into the interpreter are written like this: ``<module 'sys' (built-in)>``. If loaded from a file, they are written as ``<module 'os' from '/usr/local/lib/pythonX.Y/os.pyc'>``.
tr: Yorumlayıcıda yerleşik olarak bulunan modüller şu şekilde yazılır: ``<module 'sys' (built-in)>``. Eğer bir dosyadan yüklenmişlerse, ``<module 'os' from '/usr/local/lib/pythonX.Y/os.pyc'>`` şeklinde yazılırlar.

source: Classes and Class Instances
tr: Sınıflar ve Sınıf Örnekleri

source: See :ref:`objects` and :ref:`class` for these.
tr: Bunlar için :ref:`class` ve :ref:`objects` bakın.

source: Functions
tr: Fonksiyonlar

source: Function objects are created by function definitions. The only operation on a function object is to call it: ``func(argument-list)``.
tr: Fonksiyon nesneleri fonksiyon tanımları tarafından oluşturulur. Bir fonksiyon nesnesi üzerindeki tek işlem onu çağırmaktır: ``func(argument-list)``.

source: There are really two flavors of function objects: built-in functions and user-defined functions. Both support the same operation (to call the function), but the implementation is different, hence the different object types.
tr: Fonksiyon nesnelerinin gerçekten iki çeşidi vardır: yerleşik fonksiyonlar ve kullanıcı tanımlı fonksiyonlar. Her ikisi de aynı işlemi destekler (işlevi çağırmak için), ancak uygulama farklıdır, dolayısıyla farklı nesne türleri vardır.

source: See :ref:`function` for more information.
tr: Daha fazla bilgi için :ref:`function` bölümüne bakınız.

source: Methods
tr: Yöntemler

source: Methods are functions that are called using the attribute notation. There are two flavors: built-in methods (such as :meth:`append` on lists) and class instance methods. Built-in methods are described with the types that support them.
tr: Yöntemler, nitelik gösterimi kullanılarak çağrılan işlevlerdir. İki çeşidi vardır: yerleşik yöntemler (listelerde :meth:`append` gibi) ve sınıf örneği yöntemleri. Yerleşik yöntemler, onları destekleyen türlerle birlikte tanımlanır.

source: If you access a method (a function defined in a class namespace) through an instance, you get a special object: a :dfn:`bound method` (also called :dfn:`instance method`) object. When called, it will add the ``self`` argument to the argument list. Bound methods have two special read-only attributes: ``m.__self__`` is the object on which the method operates, and ``m.__func__`` is the function implementing the method. Calling ``m(arg-1, arg-2, ..., arg-n)`` is completely equivalent to calling ``m.__func__(m.__self__, arg-1, arg-2, ..., arg-n)``.
tr: Bir yönteme (bir sınıf ad alanında tanımlanmış bir fonksiyon) bir örnek üzerinden erişirseniz, özel bir nesne elde edersiniz: bir :dfn:`bound method` (ayrıca :dfn:`instance method` olarak da adlandırılır) nesnesi. Çağrıldığında, ``self`` argümanını argüman listesine ekleyecektir. Bağlı metotların iki özel salt okunur niteliği vardır: ``m.__self__`` metodun üzerinde çalıştığı nesne ve ``m.__func__`` metodu uygulayan fonksiyondur. ``m(arg-1, arg-2, ..., arg-n)`` çağrısı tamamen ``m.__func__(m.__self__, arg-1, arg-2, ..., arg-n)`` çağrısına eş değerdir.
