Repository: python/python-docs-tr
Catalog: library/stdtypes.po
Languages: tr

source: A :term:`mapping` object maps :term:`hashable` values to arbitrary objects. Mappings are mutable objects. There is currently only one standard mapping type, the :dfn:`dictionary`. (For other containers see the built-in :class:`list`, :class:`set`, and :class:`tuple` classes, and the :mod:`collections` module.)
tr: Bir :term:`mapping` nesnesi :term:`hashable` değerlerini rastgele nesnelere eşler. Eşlemeler değiştirilebilir nesnelerdir. Şu anda sadece bir standart eşleme türü vardır, :dfn:`dictionary`. (Diğer kapsayıcılar için yerleşik :class:`list`, :class:`set` ve :class:`tuple` sınıflarına ve :mod:`collections` modülüne bakın).

source: A dictionary's keys are *almost* arbitrary values. Values that are not :term:`hashable`, that is, values containing lists, dictionaries or other mutable types (that are compared by value rather than by object identity) may not be used as keys. Values that compare equal (such as ``1``, ``1.0``, and ``True``) can be used interchangeably to index the same dictionary entry.
tr: Bir sözlüğün anahtarları *neredeyse* rastgele değerlerdir. :term:`hashable` olmayan değerler, yani listeler, sözlükler veya diğer değişken türleri içeren değerler (nesne kimliği yerine değere göre karşılaştırılan) anahtar olarak kullanılamaz. Eşit karşılaştırılan değerler (``1``, ``1.0`` ve ``True`` gibi) aynı sözlük girdisini indekslemek için birbirinin yerine kullanılabilir.

source: Return a new dictionary initialized from an optional positional argument and a possibly empty set of keyword arguments.
tr: İsteğe bağlı bir konumsal bağımsız değişken ve muhtemelen boş bir anahtar sözcük bağımsız değişken kümesinden başlatılan yeni bir sözlük döndürür.

source: Dictionaries can be created by several means:
tr: Sözlükler çeşitli yollarla oluşturulabilir:

source: Use a comma-separated list of ``key: value`` pairs within braces: ``{'jack': 4098, 'sjoerd': 4127}`` or ``{4098: 'jack', 4127: 'sjoerd'}``
tr: Parantez içinde ``anahtar: değer`` çiftlerinin virgülle ayrılmış bir listesini kullanın: ``{'jack': 4098, 'sjoerd': 4127}`` veya ``{4098: 'jack', 4127: 'sjoerd'}``

source: Use a dict comprehension: ``{}``, ``{x: x ** 2 for x in range(10)}``
tr: Bir dict anlayışı kullanın: ``{}``, ``{x: x ** 2 for x in range(10)}``

source: Use the type constructor: ``dict()``, ``dict([('foo', 100), ('bar', 200)])``, ``dict(foo=100, bar=200)``
tr: Tür oluşturucusunu kullanın: ``dict()``, ``dict([('foo', 100), ('bar', 200)])``, ``dict(foo=100, bar=200)``

source: If no positional argument is given, an empty dictionary is created. If a positional argument is given and it is a mapping object, a dictionary is created with the same key-value pairs as the mapping object. Otherwise, the positional argument must be an :term:`iterable` object. Each item in the iterable must itself be an iterable with exactly two objects. The first object of each item becomes a key in the new dictionary, and the second object the corresponding value. If a key occurs more than once, the last value for that key becomes the corresponding value in the new dictionary.
tr: Konumsal bağımsız değişken verilmezse, boş bir sözlük oluşturulur. Konumsal bir bağımsız değişken verilmişse ve bu bir eşleme nesnesiyse, eşleme nesnesiyle aynı anahtar-değer çiftlerine sahip bir sözlük oluşturulur. Aksi takdirde, konumsal argüman bir :term:`iterable` nesnesi olmalıdır. Yinelenebilirdeki her öğenin kendisi tam olarak iki nesneli bir yinelenebilir olmalıdır. Her öğenin ilk nesnesi yeni sözlükte bir anahtar, ikinci nesnesi ise karşılık gelen değer olur. Bir anahtar birden fazla kez geçerse, bu anahtar için son değer yeni sözlükte karşılık gelen değer olur.

source: If keyword arguments are given, the keyword arguments and their values are added to the dictionary created from the positional argument. If a key being added is already present, the value from the keyword argument replaces the value from the positional argument.
tr: Anahtar sözcük bağımsız değişkenleri verilirse, anahtar sözcük bağımsız değişkenleri ve değerleri, konumsal bağımsız değişkenden oluşturulan sözlüğe eklenir. Eklenen bir anahtar zaten mevcutsa, anahtar sözcük bağımsız değişkenindeki değer, konumsal bağımsız değişkendeki değerin yerini alır.

source: To illustrate, the following examples all return a dictionary equal to ``{"one": 1, "two": 2, "three": 3}``::
tr: Örnek olarak, aşağıdaki örneklerin tümü ``{"one") eşit bir sözlük döndürür: 1, "iki": 2, "üç": 3}``::

source: Providing keyword arguments as in the first example only works for keys that are valid Python identifiers. Otherwise, any valid keys can be used.
tr: İlk örnekteki gibi anahtar kelime argümanları sağlamak yalnızca geçerli Python tanımlayıcıları olan anahtarlar için çalışır. Aksi takdirde, herhangi bir geçerli anahtar kullanılabilir.

source: These are the operations that dictionaries support (and therefore, custom mapping types should support too):
tr: Bunlar sözlüklerin desteklediği işlemlerdir (ve bu nedenle özel eşleme türlerinin de desteklemesi gerekir):

source: Return a list of all the keys used in the dictionary *d*.
tr: D* sözlüğünde kullanılan tüm anahtarların bir listesini döndürür.

source: Return the number of items in the dictionary *d*.
tr: Sözlükteki öğelerin sayısını döndürür *d*.

source: Return the item of *d* with key *key*. Raises a :exc:`KeyError` if *key* is not in the map.
tr: *d* öğesinin öğesini *key* tuşuyla döndürün. *key* haritada yoksa bir :exc:`KeyError` oluşturur.

source: If a subclass of dict defines a method :meth:`__missing__` and *key* is not present, the ``d[key]`` operation calls that method with the key *key* as argument. The ``d[key]`` operation then returns or raises whatever is returned or raised by the ``__missing__(key)`` call. No other operations or methods invoke :meth:`__missing__`. If :meth:`__missing__` is not defined, :exc:`KeyError` is raised. :meth:`__missing__` must be a method; it cannot be an instance variable::
tr: Bir dict alt sınıfı, bir yöntemi :meth:`__missing__` ve *key* tanımlıyorsa, ``d[key]`` işlemi, argüman olarak *key* anahtarıyla bu yöntemi çağırır. Ardından "d[key]" işlemi, "__missing__(key)" çağrısı tarafından döndürülen veya yükseltilen her şeyi döndürür veya yükseltir. Başka hiçbir işlem veya yöntem :meth:`__missing__` çağırmaz. :meth:`__missing__` tanımlı değilse, :exc:`KeyError` yükseltilir. :meth:`__missing__` bir yöntem olmalıdır; bir örnek değişken olamaz::

source: The example above shows part of the implementation of :class:`collections.Counter`. A different ``__missing__`` method is used by :class:`collections.defaultdict`.
tr: Yukarıdaki örnek, :class:`collections.Counter` uygulamasının bir bölümünü göstermektedir. :class:`collections.defaultdict` tarafından farklı bir ''__missing__'' yöntemi kullanılıyor.

source: Set ``d[key]`` to *value*.
tr: ``d[key]`` değerini *değer* olarak ayarlayın.

source: Remove ``d[key]`` from *d*. Raises a :exc:`KeyError` if *key* is not in the map.
tr: *d*'den ``d[key]`` ifadesini kaldırın. *key* haritada yoksa bir :exc:`KeyError` oluşturur.

source: Return ``True`` if *d* has a key *key*, else ``False``.
tr: *d* bir *key* anahtarına sahipse ``True``, aksi takdirde ``False`` döndürün.

source: Equivalent to ``not key in d``.
tr: ``not key in d`` ile eşdeğerdir.

source: Return an iterator over the keys of the dictionary. This is a shortcut for ``iter(d.keys())``.
tr: Sözlüğün anahtarları üzerinden bir yineleyici döndürün. Bu, ``iter(d.keys())`` için bir kısayoldur.

source: Remove all items from the dictionary.
tr: Sözlükten tüm öğeleri kaldırın.

source: Return a shallow copy of the dictionary.
tr: Sözlüğün sığ bir kopyasını döndürün.

source: Create a new dictionary with keys from *iterable* and values set to *value*.
tr: *iterable* anahtarları ve *value* olarak ayarlanmış değerlerle yeni bir sözlük oluşturun.

source: :meth:`fromkeys` is a class method that returns a new dictionary. *value* defaults to ``None``. All of the values refer to just a single instance, so it generally doesn't make sense for *value* to be a mutable object such as an empty list. To get distinct values, use a :ref:`dict comprehension <dict>` instead.
tr: :meth:`fromkeys`, yeni bir sözlük döndüren bir sınıf yöntemidir. *değer* varsayılan olarak "Yok" şeklindedir. Tüm değerler yalnızca tek bir örneğe atıfta bulunur, bu nedenle *değerin* boş bir liste gibi değişken bir nesne olması genellikle mantıklı değildir. Farklı değerler elde etmek için bunun yerine bir :ref:`dict anlayışı <dict>` kullanın.

source: Return the value for *key* if *key* is in the dictionary, else *default*. If *default* is not given, it defaults to ``None``, so that this method never raises a :exc:`KeyError`.
tr: *key* sözlükteyse *key* için değer döndürür, aksi takdirde *varsayılan*. *varsayılan* belirtilmezse, varsayılan olarak "Yok" olur, böylece bu yöntem hiçbir zaman bir :exc:"KeyError" oluşturmaz.

source: Return a new view of the dictionary's items (``(key, value)`` pairs). See the :ref:`documentation of view objects <dict-views>`.
tr: Sözlüğün öğelerinin (``(anahtar, değer)`` çiftleri) yeni bir görünümünü döndürür. :ref:`görünüm nesnelerinin <dict-views> belgelerine bakın.

source: Return a new view of the dictionary's keys. See the :ref:`documentation of view objects <dict-views>`.
tr: Sözlük anahtarlarının yeni bir görünümünü döndürür. :ref:`görünüm nesnelerinin <dict-views> belgelerine bakın.

source: If *key* is in the dictionary, remove it and return its value, else return *default*. If *default* is not given and *key* is not in the dictionary, a :exc:`KeyError` is raised.
tr: *anahtar* sözlükteyse, kaldırın ve değerini döndürün, aksi takdirde *varsayılanı* döndürün. *varsayılan* verilmemişse ve *key* sözlükte yoksa :exc:`KeyError` ortaya çıkar.

source: Remove and return a ``(key, value)`` pair from the dictionary. Pairs are returned in :abbr:`LIFO (last-in, first-out)` order.
tr: Sözlükten bir ``(anahtar, değer)`` çiftini kaldırın ve döndürün. Çiftler :abbr:`LIFO (son giren ilk çıkar)` sırasına göre döndürülür.

source: :meth:`popitem` is useful to destructively iterate over a dictionary, as often used in set algorithms. If the dictionary is empty, calling :meth:`popitem` raises a :exc:`KeyError`.
tr: :meth:`popitem`, küme algoritmalarında sıklıkla kullanıldığı gibi, bir sözlük üzerinde yıkıcı bir şekilde yineleme yapmak için kullanışlıdır. Sözlük boşsa, :meth:`popitem` çağrısı bir :exc:`KeyError` oluşturur.

source: LIFO order is now guaranteed. In prior versions, :meth:`popitem` would return an arbitrary key/value pair.
tr: LIFO siparişi artık garantilidir. Önceki sürümlerde :meth:`popitem` rastgele bir anahtar/değer çifti döndürürdü.

source: Return a reverse iterator over the keys of the dictionary. This is a shortcut for ``reversed(d.keys())``.
tr: Sözlüğün anahtarları üzerinde bir ters yineleyici döndürün. Bu, ``reversed(d.keys())`` için bir kısayoldur.

source: If *key* is in the dictionary, return its value. If not, insert *key* with a value of *default* and return *default*. *default* defaults to ``None``.
tr: *key* sözlükteyse, değerini döndürün. Değilse, *default* değeriyle *key* girin ve *default* değerini döndürün. *varsayılan* varsayılan değer "Yok" şeklindedir.

source: Update the dictionary with the key/value pairs from *other*, overwriting existing keys. Return ``None``.
tr: Mevcut anahtarların üzerine yazarak sözlüğü *diğer* öğesinden anahtar/değer çiftleriyle güncelleyin. ``Yok`` döndürün.

source: :meth:`update` accepts either another dictionary object or an iterable of key/value pairs (as tuples or other iterables of length two). If keyword arguments are specified, the dictionary is then updated with those key/value pairs: ``d.update(red=1, blue=2)``.
tr: :meth:`update`, başka bir sözlük nesnesini veya bir yinelemeli anahtar/değer çiftlerini (demetler veya iki uzunluktaki diğer yinelemeler olarak) kabul eder. Anahtar kelime bağımsız değişkenleri belirtilirse, sözlük şu anahtar/değer çiftleriyle güncellenir: ``d.update(red=1, blue=2)``.

source: Return a new view of the dictionary's values. See the :ref:`documentation of view objects <dict-views>`.
tr: Sözlüğün değerlerinin yeni bir görünümünü döndürür. :ref:`görünüm nesnelerinin <dict-views> belgelerine bakın.

source: An equality comparison between one ``dict.values()`` view and another will always return ``False``. This also applies when comparing ``dict.values()`` to itself::
tr: Bir "dict.values()" görünümü ile diğeri arasındaki eşitlik karşılaştırması her zaman "False" döndürür. Bu, ``dict.values()`` kendisiyle karşılaştırılırken de geçerlidir::

source: Create a new dictionary with the merged keys and values of *d* and *other*, which must both be dictionaries. The values of *other* take priority when *d* and *other* share keys.
tr: Her ikisi de sözlük olması gereken birleştirilmiş *d* ve *other* anahtarları ve değerleriyle yeni bir sözlük oluşturun. *d* ve *other* anahtarları paylaştığında *other* değerleri önceliklidir.

source: Update the dictionary *d* with keys and values from *other*, which may be either a :term:`mapping` or an :term:`iterable` of key/value pairs. The values of *other* take priority when *d* and *other* share keys.
tr: *d* sözlüğünü, bir :term:'mapping' veya :term:'iterable' anahtar/değer çiftleri olabilen *other*'dan gelen anahtarlar ve değerlerle güncelleyin. *d* ve *other* anahtarları paylaştığında *other* değerleri önceliklidir.

source: Dictionaries compare equal if and only if they have the same ``(key, value)`` pairs (regardless of ordering). Order comparisons ('<', '<=', '>=', '>') raise :exc:`TypeError`.
tr: Sözlükler, ancak ve ancak aynı ``(anahtar, değer)`` çiftlerine sahiplerse (sıralamadan bağımsız olarak) eşit karşılaştırırlar. Sipariş karşılaştırmaları ('<', '<=', '>=', '>') :exc:`TypeError` yükseltir.

source: Dictionaries preserve insertion order. Note that updating a key does not affect the order. Keys added after deletion are inserted at the end. ::
tr: Sözlükler ekleme sırasını korur. Bir anahtarı güncellemenin sırayı etkilemediğini unutmayın. Silme işleminden sonra eklenen anahtarlar en sona eklenir. ::

source: Dictionary order is guaranteed to be insertion order. This behavior was an implementation detail of CPython from 3.6.
tr: Sözlük siparişinin kampanya siparişi olması garanti edilir. Bu davranış, 3.6'dan CPython'un bir uygulama detayıydı.

source: Dictionaries and dictionary views are reversible. ::
tr: Sözlükler ve sözlük görünümleri tersine çevrilebilir. ::

source: Dictionaries are now reversible.
tr: Sözlükler artık tersine çevrilebilir.

source: :class:`types.MappingProxyType` can be used to create a read-only view of a :class:`dict`.
tr: :class:`types.MappingProxyType`, bir :class:`dict` öğesinin salt okunur bir görünümünü oluşturmak için kullanılabilir.

source: Dictionary view objects
tr: Sözlük görünümü nesneleri

source: The objects returned by :meth:`dict.keys`, :meth:`dict.values` and :meth:`dict.items` are *view objects*. They provide a dynamic view on the dictionary's entries, which means that when the dictionary changes, the view reflects these changes.
tr: :meth:`dict.keys`, :meth:`dict.values` ve :meth:`dict.items` tarafından döndürülen nesneler *görünüm nesneleridir*. Sözlüğün girişleri üzerinde dinamik bir görünüm sağlarlar; bu, sözlük değiştiğinde görünümün bu değişiklikleri yansıttığı anlamına gelir.

source: Dictionary views can be iterated over to yield their respective data, and support membership tests:
tr: Sözlük görünümleri, ilgili verilerini elde etmek ve üyelik testlerini desteklemek için yinelenebilir:

source: Return the number of entries in the dictionary.
tr: Sözlükteki girişlerin sayısını döndürür.

source: Return an iterator over the keys, values or items (represented as tuples of ``(key, value)``) in the dictionary.
tr: Sözlükteki anahtarlar, değerler veya öğeler ("(anahtar, değer)" demetleri olarak temsil edilir) üzerinde bir yineleyici döndürün.

source: Keys and values are iterated over in insertion order. This allows the creation of ``(value, key)`` pairs using :func:`zip`: ``pairs = zip(d.values(), d.keys())``. Another way to create the same list is ``pairs = [(v, k) for (k, v) in d.items()]``.
tr: Anahtarlar ve değerler, ekleme sırasına göre yinelenir. Bu, :func:`zip`: ``pairs = zip(d.values(), d.keys())`` kullanılarak ''(değer, anahtar)`` çiftlerinin oluşturulmasına izin verir. Aynı listeyi oluşturmanın başka bir yolu da "çiftler = [(v, k) for (k, v) in d.items()]" şeklindedir.

source: Iterating views while adding or deleting entries in the dictionary may raise a :exc:`RuntimeError` or fail to iterate over all entries.
tr: Sözlüğe girdi eklerken veya silerken görünümleri yinelemek, bir :exc:`RuntimeError` oluşmasına neden olabilir veya tüm girdileri yinelemede başarısız olabilir.

source: Dictionary order is guaranteed to be insertion order.
tr: Sözlük siparişinin kampanya siparişi olması garanti edilir.

source: Return ``True`` if *x* is in the underlying dictionary's keys, values or items (in the latter case, *x* should be a ``(key, value)`` tuple).
tr: *x* temel alınan sözlüğün anahtarlarında, değerlerinde veya öğelerindeyse ``True'' döndürün (ikinci durumda, *x* bir ``(key, value)`` demet olmalıdır).

source: Return a reverse iterator over the keys, values or items of the dictionary. The view will be iterated in reverse order of the insertion.
tr: Sözlüğün anahtarları, değerleri veya öğeleri üzerinde bir ters yineleyici döndürün. Görünüm, eklemenin tersi sırayla yinelenir.

source: Dictionary views are now reversible.
tr: Sözlük görünümleri artık tersine çevrilebilir.

source: Return a :class:`types.MappingProxyType` that wraps the original dictionary to which the view refers.
tr: Görünümün başvurduğu orijinal sözlüğü saran bir :class:`types.MappingProxyType` döndürür.

source: Keys views are set-like since their entries are unique and :term:`hashable`. If all values are hashable, so that ``(key, value)`` pairs are unique and hashable, then the items view is also set-like. (Values views are not treated as set-like since the entries are generally not unique.) For set-like views, all of the operations defined for the abstract base class :class:`collections.abc.Set` are available (for example, ``==``, ``<``, or ``^``). While using set operators, set-like views accept any iterable as the other operand, unlike sets which only accept sets as the input.
tr: Anahtar görünümleri, girişleri benzersiz olduğundan ve :term:`hashable` olduğundan set benzeridir. Tüm değerler karıştırılabilirse, yani ``(anahtar, değer)`` çiftleri benzersiz ve karıştırılabilirse, o zaman öğeler görünümü de küme benzeri olur. (Değer görünümleri, girişler genellikle benzersiz olmadığından küme benzeri olarak değerlendirilmez.) Küme benzeri görünümler için, soyut temel sınıf :class:`collections.abc.Set` için tanımlanan tüm işlemler mevcuttur (örneğin, , ``==``, ``<`` veya ``^``). Küme işleçlerini kullanırken, küme benzeri görünümler, yalnızca kümeleri girdi olarak kabul eden kümelerin aksine, yinelenebilir herhangi bir öğeyi diğer işlenen olarak kabul eder.

source: An example of dictionary view usage::
tr: Sözlük görünümü kullanımına bir örnek::

source: Context Manager Types
tr: Bağlam Yöneticisi Türleri

source: Python's :keyword:`with` statement supports the concept of a runtime context defined by a context manager. This is implemented using a pair of methods that allow user-defined classes to define a runtime context that is entered before the statement body is executed and exited when the statement ends:
tr: Python'un :keyword:`with` deyimi, bir bağlam yöneticisi tarafından tanımlanan çalışma zamanı bağlamı kavramını destekler. Bu, kullanıcı tanımlı sınıfların deyim gövdesi yürütülmeden önce girilen ve deyim sona erdiğinde çıkılan bir çalışma zamanı bağlamı tanımlamasına olanak tanıyan bir çift yöntem kullanılarak uygulanır:

source: Enter the runtime context and return either this object or another object related to the runtime context. The value returned by this method is bound to the identifier in the :keyword:`!as` clause of :keyword:`with` statements using this context manager.
tr: Çalışma zamanı bağlamını girin ve ya bu nesneyi ya da çalışma zamanı bağlamıyla ilgili başka bir nesneyi döndürün. Bu yöntem tarafından döndürülen değer, bu bağlam yöneticisini kullanan :keyword:`with` deyimlerinin :keyword:`!as` cümlesindeki tanımlayıcıya bağlanır.

source: An example of a context manager that returns itself is a :term:`file object`. File objects return themselves from __enter__() to allow :func:`open` to be used as the context expression in a :keyword:`with` statement.
tr: Kendisini döndüren bir bağlam yöneticisine örnek olarak :term:`file nesnesi` verilebilir. Dosya nesneleri, :func:`open` ifadesinin bir :keyword:`with` ifadesinde bağlam ifadesi olarak kullanılmasına izin vermek için __enter__() işlevinden kendilerini döndürürler.

source: An example of a context manager that returns a related object is the one returned by :func:`decimal.localcontext`. These managers set the active decimal context to a copy of the original decimal context and then return the copy. This allows changes to be made to the current decimal context in the body of the :keyword:`with` statement without affecting code outside the :keyword:`!with` statement.
tr: İlgili bir nesne döndüren bir bağlam yöneticisi örneği :func:`decimal.localcontext` tarafından döndürülendir. Bu yöneticiler etkin ondalık bağlamı orijinal ondalık bağlamın bir kopyasına ayarlar ve ardından kopyayı döndürür. Bu, :keyword:`with` deyiminin gövdesinde, :keyword:`!with` deyiminin dışındaki kodu etkilemeden geçerli ondalık bağlamda değişiklik yapılmasına olanak tanır.

source: Exit the runtime context and return a Boolean flag indicating if any exception that occurred should be suppressed. If an exception occurred while executing the body of the :keyword:`with` statement, the arguments contain the exception type, value and traceback information. Otherwise, all three arguments are ``None``.
tr: Çalışma zamanı bağlamından çıkın ve meydana gelen herhangi bir istisnanın bastırılması gerekip gerekmediğini belirten bir Boole bayrağı döndürün. :keyword:`with` ifadesinin gövdesi yürütülürken bir istisna meydana gelirse, argümanlar istisna tipini, değeri ve geri izleme bilgilerini içerir. Aksi takdirde, üç bağımsız değişken de ``Yok`` olur.

source: Returning a true value from this method will cause the :keyword:`with` statement to suppress the exception and continue execution with the statement immediately following the :keyword:`!with` statement. Otherwise the exception continues propagating after this method has finished executing. Exceptions that occur during execution of this method will replace any exception that occurred in the body of the :keyword:`!with` statement.
tr: Bu yöntemden gerçek bir değer döndürmek, :keyword:`with` deyiminin istisnayı bastırmasına ve :keyword:`!with` deyiminin hemen ardından gelen deyimle yürütmeye devam etmesine neden olur. Aksi takdirde, bu yöntemin yürütülmesi tamamlandıktan sonra istisna yayılmaya devam eder. Bu yöntemin yürütülmesi sırasında ortaya çıkan istisnalar, :keyword:`!with` ifadesinin gövdesinde meydana gelen herhangi bir istisnanın yerini alacaktır.
