Repository: python/python-docs-tr
Catalog: library/stdtypes.po
Languages: tr

source: When formatting a number (:class:`int`, :class:`float`, :class:`complex`, :class:`decimal.Decimal` and subclasses) with the ``n`` type (ex: ``'{:n}'.format(1234)``), the function temporarily sets the ``LC_CTYPE`` locale to the ``LC_NUMERIC`` locale to decode ``decimal_point`` and ``thousands_sep`` fields of :c:func:`localeconv` if they are non-ASCII or longer than 1 byte, and the ``LC_NUMERIC`` locale is different than the ``LC_CTYPE`` locale. This temporary change affects other threads.
tr: Bir sayıyı (:class:`int`, :class:`float`, :class:`complex`, :class:`decimal.Decimal` ve alt sınıfları) ``n`` türüyle biçimlendirirken (örn: ``'{:n}'. format(1234)``), işlev :c:func:`localeconv` öğesinin ``decimal_point`` ve ``thousands_sep`` alanlarını ASCII değilse veya 1 bayttan uzunsa ve ``LC_NUMERIC`` yerel ayarı ``LC_CTYPE`` yerel ayarından farklıysa kod çözmek için ``LC_CTYPE`` yerel ayarını geçici olarak ``LC_NUMERIC`` yerel ayarına ayarlar. Bu geçici değişiklik diğer iş parçacıklarını etkiler.

source: When formatting a number with the ``n`` type, the function sets temporarily the ``LC_CTYPE`` locale to the ``LC_NUMERIC`` locale in some cases.
tr: Bir sayıyı ``n`` türüyle biçimlendirirken, fonksiyon bazı durumlarda ``LC_CTYPE`` yerel ayarını geçici olarak ``LC_NUMERIC`` yerel ayarına ayarlar.

source: Similar to ``str.format(**mapping)``, except that ``mapping`` is used directly and not copied to a :class:`dict`. This is useful if for example ``mapping`` is a dict subclass:
tr: ``str.format(**mapping)`` ile benzerdir, ancak ``mapping`` doğrudan kullanılır ve bir :class:`dict` 'e kopyalanmaz. Örneğin, ``mapping`` bir dict alt sınıfı ise bu kullanışlıdır:

source: Like :meth:`~str.find`, but raise :exc:`ValueError` when the substring is not found.
tr: :meth:`~str.find` gibi, ancak alt dize bulunamadığında :exc:`ValueError` yükseltir.

source: Return ``True`` if all characters in the string are alphanumeric and there is at least one character, ``False`` otherwise. A character ``c`` is alphanumeric if one of the following returns ``True``: ``c.isalpha()``, ``c.isdecimal()``, ``c.isdigit()``, or ``c.isnumeric()``.
tr: Dizedeki tüm karakterler alfanümerikse ve en az bir karakter varsa ``True``, aksi takdirde ``False`` döndürür. Bir ``c`` karakteri, aşağıdakilerden biri ``True`` döndürüyorsa alfasayısaldır: ``c.isalpha()``, ``c.isdecimal()``, ``c.isdigit()`` veya ``c.isnumeric()``.

source: Return ``True`` if all characters in the string are alphabetic and there is at least one character, ``False`` otherwise. Alphabetic characters are those characters defined in the Unicode character database as "Letter", i.e., those with general category property being one of "Lm", "Lt", "Lu", "Ll", or "Lo". Note that this is different from the `Alphabetic property defined in the section 4.10 'Letters, Alphabetic, and Ideographic' of the Unicode Standard <https://www.unicode.org/versions/Unicode15.0.0/ch04.pdf>`_.
tr: Dizedeki tüm karakterler alfabetikse ve en az bir karakter varsa ``True``, aksi takdirde ``False`` döndürür. Alfabetik karakterler, Unicode karakter veritabanında "Harf" olarak tanımlanan karakterlerdir, yani genel kategori özelliği "Lm", "Lt", "Lu", "Ll" veya "Lo "dan biri olan karakterlerdir. Bunun Unicode Standardında tanımlanan "Alfabetik" özelliğinden farklı olduğunu unutmayın.

source: Return ``True`` if the string is empty or all characters in the string are ASCII, ``False`` otherwise. ASCII characters have code points in the range U+0000-U+007F.
tr: Dize boşsa veya dizedeki tüm karakterler ASCII ise ``True``, aksi takdirde ``False`` döndürür. ASCII karakterleri U+0000-U+007F aralığında kod noktalarına sahiptir.

source: Return ``True`` if all characters in the string are decimal characters and there is at least one character, ``False`` otherwise. Decimal characters are those that can be used to form numbers in base 10, e.g. U+0660, ARABIC-INDIC DIGIT ZERO. Formally a decimal character is a character in the Unicode General Category "Nd".
tr: Dizedeki tüm karakterler ondalık karakter ise ve en az bir karakter varsa ``True``, aksi takdirde ``False`` döndürür. Ondalık karakterler 10 tabanında sayılar oluşturmak için kullanılabilen karakterlerdir, örneğin U+0660, ARAPÇA-HİNTÇE RAKAM SIFIR. Resmi olarak bir ondalık karakter Unicode Genel Kategorisi "Nd" içerisindeki bir karakterdir.

source: Return ``True`` if all characters in the string are digits and there is at least one character, ``False`` otherwise. Digits include decimal characters and digits that need special handling, such as the compatibility superscript digits. This covers digits which cannot be used to form numbers in base 10, like the Kharosthi numbers. Formally, a digit is a character that has the property value Numeric_Type=Digit or Numeric_Type=Decimal.
tr: Dizedeki tüm karakterler rakamsa ve en az bir karakter varsa ``True``, aksi takdirde ``False`` döndürür. Rakamlar ondalık karakterleri ve özel işlem gerektiren rakamları (uyumluluk üst simge rakamları gibi) içerir. Bu, Kharosthi sayıları gibi 10 tabanında sayı oluşturmak için kullanılamayan rakamları kapsar. Resmi olarak rakam, Numeric_Type=Digit veya Numeric_Type=Decimal özellik değerine sahip bir karakterdir.

source: Return ``True`` if the string is a valid identifier according to the language definition, section :ref:`identifiers`.
tr: :ref:`identifiers` bölümüne göre dizge dil tanımına göre geçerli bir tanımlayıcı ise ``True`` döndürür.

source: :func:`keyword.iskeyword` can be used to test whether string ``s`` is a reserved identifier, such as :keyword:`def` and :keyword:`class`.
tr: :func:`keyword.iskeyword`, ``s`` dizesinin :keyword:`def` ve :keyword:`class` gibi ayrılmış bir tanımlayıcı olup olmadığını test etmek için kullanılabilir.

source: Example: ::
tr: Örnek: ::

source: Return ``True`` if all cased characters [4]_ in the string are lowercase and there is at least one cased character, ``False`` otherwise.
tr: Dizedeki tüm büyük harfli karakterler [4]_ küçük harfli ise ve en az bir büyük harfli karakter varsa ``True``, aksi takdirde ``False`` döndürür.

source: Return ``True`` if all characters in the string are numeric characters, and there is at least one character, ``False`` otherwise. Numeric characters include digit characters, and all characters that have the Unicode numeric value property, e.g. U+2155, VULGAR FRACTION ONE FIFTH. Formally, numeric characters are those with the property value Numeric_Type=Digit, Numeric_Type=Decimal or Numeric_Type=Numeric.
tr: Dizedeki tüm karakterler sayısal karakterlerse ve en az bir karakter varsa ``True``, aksi takdirde ``False`` döndürür. Sayısal karakterler rakam karakterlerini ve Unicode sayısal değer özelliğine sahip tüm karakterleri içerir, örneğin U+2155, VULGAR FRAKSİYONU BEŞİNCİ. Resmi olarak, sayısal karakterler Numeric_Type=Digit, Numeric_Type=Decimal veya Numeric_Type=Numeric özellik değerine sahip karakterlerdir.

source: Return ``True`` if all characters in the string are printable or the string is empty, ``False`` otherwise. Nonprintable characters are those characters defined in the Unicode character database as "Other" or "Separator", excepting the ASCII space (0x20) which is considered printable. (Note that printable characters in this context are those which should not be escaped when :func:`repr` is invoked on a string. It has no bearing on the handling of strings written to :data:`sys.stdout` or :data:`sys.stderr`.)
tr: Dizedeki tüm karakterler yazdırılabilirse veya dize boşsa ``True``, aksi takdirde ``False`` döndürür. Yazdırılamayan karakterler, yazdırılabilir olarak kabul edilen ASCII boşluğu (0x20) dışında, Unicode karakter veritabanında "Diğer" veya "Ayırıcı" olarak tanımlanan karakterlerdir. (Bu bağlamda, yazdırılabilir karakterlerin :func:`repr` bir dize üzerinde çağrıldığında kaçılmaması gereken karakterler olduğunu unutmayın. Bunun :data:`sys.stdout` veya :data:`sys.stderr` dosyalarına yazılan dizelerin işlenmesiyle bir ilgisi yoktur)

source: Return ``True`` if there are only whitespace characters in the string and there is at least one character, ``False`` otherwise.
tr: Dizede yalnızca boşluk karakterleri varsa ve en az bir karakter varsa ``True``, aksi takdirde ``False`` döndürür.

source: A character is *whitespace* if in the Unicode character database (see :mod:`unicodedata`), either its general category is ``Zs`` ("Separator, space"), or its bidirectional class is one of ``WS``, ``B``, or ``S``.
tr: Bir karakter, genel kategorisi ``Zs`` (“Ayırıcı, boşluk”) ya da çift yönlü sınıfı ``WS``, ``B`` veya ``S``’den biri ise Unicode karakter veritabanında (bkz. :mod:`unicodedata`) *beyaz boşluk karakteri*’dir.

source: Return ``True`` if the string is a titlecased string and there is at least one character, for example uppercase characters may only follow uncased characters and lowercase characters only cased ones. Return ``False`` otherwise.
tr: Eğer dizenin yalnızca ilk harfi büyük ise ve en az bir karakter varsa ``True`` döndürür. Örneğin, büyük harfli karakterler sadece küçük harfli karakterleri ve küçük harfli karakterler sadece büyük harfli karakterleri takip edebilir. Aksi takdirde ``False`` döndürür.

source: Return ``True`` if all cased characters [4]_ in the string are uppercase and there is at least one cased character, ``False`` otherwise.
tr: Dizedeki tüm karakterler [4]_ büyük harfli ise ve en az bir büyük harfli karakter varsa ``True``, aksi takdirde ``False`` döndürür.

source: Return a string which is the concatenation of the strings in *iterable*. A :exc:`TypeError` will be raised if there are any non-string values in *iterable*, including :class:`bytes` objects. The separator between elements is the string providing this method.
tr: *iterable* içindeki dizgelerin birleşiminden oluşan bir dizge döndürür. Eğer *iterable* içinde :class:`bytes` nesneleri de dahil olmak üzere string olmayan değerler varsa bir :exc:`TypeError` oluşacaktır. Öğeler arasındaki ayırıcı, bu yöntemi sağlayan dizedir.

source: Return the string left justified in a string of length *width*. Padding is done using the specified *fillchar* (default is an ASCII space). The original string is returned if *width* is less than or equal to ``len(s)``.
tr: *width* uzunluğundaki bir dizeyi sola hizalanmış olarak döndürür. Doldurma, belirtilen *fillchar* kullanılarak yapılır (varsayılanı bir ASCII boşluğudur). *width*, ``len(s)`` değerinden küçük veya ona eşitse orijinal dize döndürülür.

source: Return a copy of the string with all the cased characters [4]_ converted to lowercase.
tr: Dizenin tüm büyük harfli karakterlerini [4]_ küçük harfe dönüştürerek bir kopyasını döndürür.

source: The lowercasing algorithm used is `described in section 3.13 'Default Case Folding' of the Unicode Standard <https://www.unicode.org/versions/Unicode15.0.0/ch03.pdf>`__.
tr: Kullanılan küçük harf algoritması 'Unicode Standardı'nın <https://www.unicode.org/versions/Unicode15.0.0/ch03.pdf> 3.13 'Varsayılan Harf Katlaması' bölümünde açıklanmıştır.

source: Return a copy of the string with leading characters removed. The *chars* argument is a string specifying the set of characters to be removed. If omitted or ``None``, the *chars* argument defaults to removing whitespace. The *chars* argument is not a prefix; rather, all combinations of its values are stripped::
tr: Dizenin baştaki karakterleri çıkarılmış bir kopyasını döndürür. *chars* bağımsız değişkeni, kaldırılacak karakter kümesini belirten bir dizedir. Atlanırsa veya ``None`` olursa, *chars* bağımsız değişkeni varsayılan olarak boşlukları kaldırır. *chars* bağımsız değişkeni bir ön ek değildir; bunun yerine, değerlerinin tüm kombinasyonları çıkarılır::

source: See :meth:`str.removeprefix` for a method that will remove a single prefix string rather than all of a set of characters. For example::
tr: Bir karakter kümesinin tüm ön ekleri yerine tek bir ön ek dizesini kaldıracak bir yöntem için :meth:`str.removeprefix` bölümüne bakın. Örneğin::

source: This static method returns a translation table usable for :meth:`str.translate`.
tr: Bu statik yöntem :meth:`str.translate` için kullanılabilecek bir çeviri tablosu döndürür.

source: If there is only one argument, it must be a dictionary mapping Unicode ordinals (integers) or characters (strings of length 1) to Unicode ordinals, strings (of arbitrary lengths) or ``None``. Character keys will then be converted to ordinals.
tr: Yalnızca bir bağımsız değişken varsa, Unicode sıradanlarını (tamsayılar) veya karakterlerini (1 uzunluğundaki dizeler) Unicode sıradanlarına, dizelere (isteğe bağlı uzunluklarda) veya ``None`` değerine eşleyen bir sözlük olmalıdır. Karakter anahtarları daha sonra sıradanlara dönüştürülecektir.

source: If there are two arguments, they must be strings of equal length, and in the resulting dictionary, each character in x will be mapped to the character at the same position in y. If there is a third argument, it must be a string, whose characters will be mapped to ``None`` in the result.
tr: İki bağımsız değişken varsa, bunlar eşit uzunlukta dizgeler olmalıdır. Sözlüğün son halinde x'teki her karakter y'de aynı konumdaki karakterle eşlenecektir. Üçüncü bir bağımsız değişken varsa, karakterleri sonuçta ``None`` ile eşlenecek bir dizge olmalıdır.

source: Split the string at the first occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself, and the part after the separator. If the separator is not found, return a 3-tuple containing the string itself, followed by two empty strings.
tr: Dizeyi *sep* öğesinin ilk geçtiği yerden böler ve ayırıcıdan önceki kısmı, ayırıcının kendisini ve ayırıcıdan sonraki kısmı içeren bir 3'lü döndürür. Ayırıcı bulunamazsa, dizenin kendisini ve ardından iki boş dizeyi içeren bir 3'lü döndürür.

source: If the string starts with the *prefix* string, return ``string[len(prefix):]``. Otherwise, return a copy of the original string::
tr: Eğer dize *prefix* dizesi ile başlıyorsa, ``dize[len(prefix):]`` döndürür. Aksi takdirde, orijinal dizgenin bir kopyasını döndürür::

source: If the string ends with the *suffix* string and that *suffix* is not empty, return ``string[:-len(suffix)]``. Otherwise, return a copy of the original string::
tr: Dize *suffix* (son ek) dizesiyle bitiyorsa ve bu *suffix* boş değilse, ``dize[:-len(suffix)]`` döndürür. Aksi takdirde, orijinal dizenin bir kopyasını döndürür::

source: Return a copy of the string with all occurrences of substring *old* replaced by *new*. If the optional argument *count* is given, only the first *count* occurrences are replaced.
tr: Dizenin, *eski* alt dizesinin tüm oluşumları *yeni* ile değiştirilmiş bir kopyasını döndürür. İsteğe bağlı olarak *count* bağımsız değişkeni verilirse, yalnızca ilk *count* oluşumu değiştirilir.

source: Return the highest index in the string where substring *sub* is found, such that *sub* is contained within ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` on failure.
tr: Dizede *sub* alt dizesinin bulunduğu en yüksek dizini döndürür, öyle ki *sub* ``s[start:end]`` içinde yer alır. İsteğe bağlı argümanlar *start* ve *end* dilim gösterimindeki gibi yorumlanır. Başarısızlık durumunda ``-1`` döndürür.

source: Like :meth:`rfind` but raises :exc:`ValueError` when the substring *sub* is not found.
tr: :meth:`rfind` gibi, ancak *sub* alt dizesi bulunamadığında :exc:`ValueError` yükseltir.

source: Return the string right justified in a string of length *width*. Padding is done using the specified *fillchar* (default is an ASCII space). The original string is returned if *width* is less than or equal to ``len(s)``.
tr: *width* uzunluğundaki bir dizeyi sağa hizalanmış olarak döndürür. Doldurma, belirtilen *fillchar* kullanılarak yapılır (varsayılanı bir ASCII boşluğudur). *width*, ``len(s)`` değerinden küçük veya ona eşitse orijinal dize döndürülür.

source: Split the string at the last occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself, and the part after the separator. If the separator is not found, return a 3-tuple containing two empty strings, followed by the string itself.
tr: Dizeyi *sep* öğesinin ilk geçtiği yerden böler ve ayırıcıdan önceki kısmı, ayırıcının kendisini ve ayırıcıdan sonraki kısmı içeren bir 3'lü döndürür. Ayırıcı bulunamazsa, dizenin kendisini ve ardından iki boş dizeyi içeren bir 3'lü döndürür.

source: Return a list of the words in the string, using *sep* as the delimiter string. If *maxsplit* is given, at most *maxsplit* splits are done, the *rightmost* ones. If *sep* is not specified or ``None``, any whitespace string is a separator. Except for splitting from the right, :meth:`rsplit` behaves like :meth:`split` which is described in detail below.
tr: Ayırıcı dizge olarak *sep* kullanarak dizgedeki sözcüklerin bir listesini döndürür. Eğer *maxsplit* belirtilmişse, *rightmost* olmak üzere en fazla *maxsplit* bölme yapılır. Eğer *sep* belirtilmemişse veya ``None`` ise, herhangi bir boşluk dizesi ayırıcıdır. Sağdan bölme dışında, :meth:`rsplit` aşağıda ayrıntılı olarak açıklanan :meth:`split` gibi davranır.

source: Return a copy of the string with trailing characters removed. The *chars* argument is a string specifying the set of characters to be removed. If omitted or ``None``, the *chars* argument defaults to removing whitespace. The *chars* argument is not a suffix; rather, all combinations of its values are stripped::
tr: Dizenin en sondaki karakterleri çıkarılmış bir kopyasını döndürür. *chars* bağımsız değişkeni, kaldırılacak karakter kümesini belirten bir dizedir. Atlanırsa veya ``None`` olursa, *chars* bağımsız değişkeni varsayılan olarak boşlukları kaldırır. *chars* bağımsız değişkeni bir ön ek değildir; bunun yerine, değerlerinin tüm kombinasyonları çıkarılır::

source: See :meth:`str.removesuffix` for a method that will remove a single suffix string rather than all of a set of characters. For example::
tr: Bir karakter kümesinin tüm son ekleri yerine tek bir son ek dizesini kaldıracak bir yöntem için :meth:`str.removeprefix` bölümüne bakın. Örneğin::

source: Return a list of the words in the string, using *sep* as the delimiter string. If *maxsplit* is given, at most *maxsplit* splits are done (thus, the list will have at most ``maxsplit+1`` elements). If *maxsplit* is not specified or ``-1``, then there is no limit on the number of splits (all possible splits are made).
tr: Ayırıcı dizge olarak *sep* kullanarak dizgedeki sözcüklerin bir listesini döndürür. Eğer *maxsplit* belirtilmişse, en fazla *maxsplit* bölme işlemi yapılır (dolayısıyla, liste en fazla ``maxsplit+1`` elemana sahip olur). Eğer *maxsplit* belirtilmemişse veya ``-1`` ise, bölme sayısında bir sınırlama yoktur (tüm olası bölmeler yapılır).

source: If *sep* is given, consecutive delimiters are not grouped together and are deemed to delimit empty strings (for example, ``'1,,2'.split(',')`` returns ``['1', '', '2']``). The *sep* argument may consist of multiple characters (for example, ``'1<>2<>3'.split('<>')`` returns ``['1', '2', '3']``). Splitting an empty string with a specified separator returns ``['']``.
tr: *sep* verilirse, ardışık sınırlayıcılar birlikte gruplanmaz ve boş dizeleri sınırladıkları kabul edilir (örneğin, ``'1,,2'.split(',')``, ``['1', '', '2']`` döndürür). *sep* bağımsız değişkeni birden çok karakterden oluşabilir (örneğin, ``'1<>2<>3'.split('<>')``, ``['1', '2', '3']`` döndürür). Boş bir dizeyi belirtilen bir ayırıcıyla bölmek ``['']`` döndürür.

source: For example::
tr: Örneğin: ::

source: If *sep* is not specified or is ``None``, a different splitting algorithm is applied: runs of consecutive whitespace are regarded as a single separator, and the result will contain no empty strings at the start or end if the string has leading or trailing whitespace. Consequently, splitting an empty string or a string consisting of just whitespace with a ``None`` separator returns ``[]``.
tr: Eğer *sep* belirtilmemişse veya ``None`` ise, farklı bir bölme algoritması uygulanır: ardışık boşluk dizileri tek bir ayırıcı olarak kabul edilir ve dizgenin başında veya sonunda boşluk varsa, sonucun başında veya sonunda boş dizeler olmaz. Dolayısıyla, boş bir dizeyi veya sadece beyaz boşluktan oluşan bir dizeyi ``None`` ayırıcısıyla bölmek ``[]`` döndürür.

source: Return a list of the lines in the string, breaking at line boundaries. Line breaks are not included in the resulting list unless *keepends* is given and true.
tr: Satır sınırlarında keserek dizedeki satırların bir listesini döndürür. Satır sonları için *keepends* belirtilmediği ve true değerinde olmadığı sürece, satır sonları sonuç listesine dahil edilmez.

source: This method splits on the following line boundaries. In particular, the boundaries are a superset of :term:`universal newlines`.
tr: Bu yöntem aşağıdaki satır sınırlarında bölme yapar. Spesifik olarak, sınırlar :term:`universal newlines` 'ın bir üst kümesidir.

source: Representation
tr: Temsil

source: Description
tr: Açıklama

source: Line Feed
tr: Satır Atlama

source: Carriage Return
tr: Satır Başına Alma

source: Carriage Return + Line Feed
tr: Satır Başına Alma + Satır Atlama

source: Line Tabulation
tr: Satır Tablolama

source: Form Feed
tr: Form Besleme

source: File Separator
tr: Dosya Ayırıcı

source: Group Separator
tr: Grup Ayırıcı

source: Record Separator
tr: Kayıt Ayırıcı

source: Next Line (C1 Control Code)
tr: Yeni Satır (C1 Denetim Kodu)

source: Line Separator
tr: Satır Ayrıcı

source: Paragraph Separator
tr: Paragraf Ayırıcı

source: ``\v`` and ``\f`` added to list of line boundaries.
tr: ``\v`` ve ``\f`` satır sınırlarına eklenir.

source: Unlike :meth:`~str.split` when a delimiter string *sep* is given, this method returns an empty list for the empty string, and a terminal line break does not result in an extra line::
tr: Bir sınırlayıcı dize *sep* verildiğinde :meth:`~str.split` yönteminden farklı olarak, bu yöntem boş dize için boş bir liste döndürür ve bir terminal satır sonu fazladan bir satır ile sonuçlanmaz::

source: For comparison, ``split('\n')`` gives::
tr: Kıyaslayacak olursak ``split(‘\n’)`` şu değeri verir::

source: Return ``True`` if string starts with the *prefix*, otherwise return ``False``. *prefix* can also be a tuple of prefixes to look for. With optional *start*, test string beginning at that position. With optional *end*, stop comparing string at that position.
tr: Dize *önek* ile başlıyorsa ``True`` döndürür, aksi takdirde ``False`` döndürür. *prefix* ayrıca aranacak ön eklerin bir tuple'ı da olabilir. İsteğe bağlı *start* ile, o konumdan başlayan dizeyi sınar. İsteğe bağlı *end* ile, dizeyi o konumda karşılaştırmayı durdurur.

source: Return a copy of the string with the leading and trailing characters removed. The *chars* argument is a string specifying the set of characters to be removed. If omitted or ``None``, the *chars* argument defaults to removing whitespace. The *chars* argument is not a prefix or suffix; rather, all combinations of its values are stripped::
tr: Dizenin baştaki ve sondaki karakterleri çıkarılmış bir kopyasını döndürür. *chars* bağımsız değişkeni, kaldırılacak karakter kümesini belirten bir dizedir. Atlanırsa veya ``None`` olursa, *chars* bağımsız değişkeni varsayılan olarak boşlukları kaldırır. *chars* bağımsız değişkeni bir ön ek veya son ek değildir; bunun yerine, değerlerinin tüm kombinasyonları çıkarılır::
