Repository: python/python-docs-tr
Catalog: library/stdtypes.po
Languages: tr

source: Return the integer represented by the given array of bytes.
tr: Verilen bayt dizisi tarafından temsil edilen tam sayıyı döndürür.

source: The argument *bytes* must either be a :term:`bytes-like object` or an iterable producing bytes.
tr: *bytes* argümanı ya bir :term:`bytes-like object` ya da yinelenebilir üreten bayt olabilir.

source: The *byteorder* argument determines the byte order used to represent the integer, and defaults to ``"big"``. If *byteorder* is ``"big"``, the most significant byte is at the beginning of the byte array. If *byteorder* is ``"little"``, the most significant byte is at the end of the byte array. To request the native byte order of the host system, use :data:`sys.byteorder` as the byte order value.
tr: *byteorder* argümanı, tam sayıyı temsil etmek için kullanılan bayt sırasını belirler. *byteorder* ``"big"`` ise, en önemli bayt, bayt dizisinin başındadır. *byteorder* ``"little"`` ise, en önemli bayt, bayt dizisinin sonundadır. Ana sistemin yerel bayt sırasını istemek için bayt sırası değeri olarak :data:`sys.byteorder` kullanın.

source: The *signed* argument indicates whether two's complement is used to represent the integer.
tr: *signed* argümanı, tam sayıyı temsil etmek için ikinin tümleyeninin kullanılıp kullanılmadığını gösterir.

source: Added default argument value for ``byteorder``.
tr: Byteorder`` için varsayılan bağımsız değişken değeri eklendi.

source: Return a pair of integers whose ratio is equal to the original integer and has a positive denominator. The integer ratio of integers (whole numbers) is always the integer as the numerator and ``1`` as the denominator.
tr: Oranı, orijinal tam sayıya tam olarak eşit ve pozitif bir paydaya sahip bir tam sayı çifti döndürür. Integerlerin tam sayı oranı her zaman pay olarak tam sayı ve payda olarak ``1`` dir.

source: Returns ``True``. Exists for duck type compatibility with :meth:`float.is_integer`.
tr: ``Doğru`` değerini döndürür. :meth:`float.is_integer` ile ördek türü uyumluluğu için mevcuttur.

source: Additional Methods on Float
tr: Gerçel Sayılarda Ek Metotlar

source: The float type implements the :class:`numbers.Real` :term:`abstract base class`. float also has the following additional methods.
tr: Float türü, :class:`numbers.Real` :term:`abstract base class` 'ı uygular. Float ayrıca aşağıdaki ek metotlara sahiptir.

source: Return a pair of integers whose ratio is exactly equal to the original float. The ratio is in lowest terms and has a positive denominator. Raises :exc:`OverflowError` on infinities and a :exc:`ValueError` on NaNs.
tr: Oranı tam olarak orijinal gerçel sayıya eşit ve pozitif bir paydaya sahip bir çift tam sayı döndürür. Sonsuzluklarda :exc:`OverflowError` ve NaN'lerde (SayıDeğil) :exc:`ValueError` hataları ortaya çıkar.

source: Return ``True`` if the float instance is finite with integral value, and ``False`` otherwise::
tr: Float örneği integral değeriyle sonluysa ``True``, aksi takdirde ``False`` döndürür::

source: Two methods support conversion to and from hexadecimal strings. Since Python's floats are stored internally as binary numbers, converting a float to or from a *decimal* string usually involves a small rounding error. In contrast, hexadecimal strings allow exact representation and specification of floating-point numbers. This can be useful when debugging, and in numerical work.
tr: İki yöntem, onaltılık dizelere dönüştürmeyi destekler. Python'un floatları dahili olarak ikili sayılar olarak depolandığından, bir kayan noktayı *decimal* (ondalık) dizgeye dönüştürmek veya bu karakter dizisinden dönüştürmek genellikle küçük bir yuvarlama hatası içerir. Buna karşılık, onaltılık diziler, gerçel sayıların tam olarak gösterilmesine ve belirtilmesine izin verir. Bu, hata ayıklama sırasında ve sayısal çalışmalarda yararlı olabilir.

source: Return a representation of a floating-point number as a hexadecimal string. For finite floating-point numbers, this representation will always include a leading ``0x`` and a trailing ``p`` and exponent.
tr: Bir gerçel sayının temsilini, onaltılık bir dize olarak döndürür. Sonlu gerçel sayılar için, bu gösterim her zaman başında bir ``0x`` ve sonunda bir ``p`` ve üs içerecektir.

source: Class method to return the float represented by a hexadecimal string *s*. The string *s* may have leading and trailing whitespace.
tr: Gerçel sayıyı temsil eden bir onaltılık dize *s*'yi döndüren için sınıf (class) metodu. *s* dizesinin başında ve sonunda boşluk olabilir.

source: Note that :meth:`float.hex` is an instance method, while :meth:`float.fromhex` is a class method.
tr: :meth:`float.hex` 'in bir örnek (instance) metodu olduğunu, :meth:`float.fromhex` 'in ise bir sınıf (class) metodu olduğunu unutmayın.

source: A hexadecimal string takes the form::
tr: Onaltılık bir dize şu biçimi alır::

source: where the optional ``sign`` may by either ``+`` or ``-``, ``integer`` and ``fraction`` are strings of hexadecimal digits, and ``exponent`` is a decimal integer with an optional leading sign. Case is not significant, and there must be at least one hexadecimal digit in either the integer or the fraction. This syntax is similar to the syntax specified in section 6.4.4.2 of the C99 standard, and also to the syntax used in Java 1.5 onwards. In particular, the output of :meth:`float.hex` is usable as a hexadecimal floating-point literal in C or Java code, and hexadecimal strings produced by C's ``%a`` format character or Java's ``Double.toHexString`` are accepted by :meth:`float.fromhex`.
tr: burada opsiyonel ``işaret``, ``+`` veya ``-`` olabilir; ``tam sayı`` ve ``kesir`` onaltılı basamaklı dizelerdir; ``üs`` opsiyonel ön işaretle birlikte ondalık tam sayıdır. Büyük/küçük harf önemli değildir ve tam sayı veya kesirde en az bir onaltılık basamak olmalıdır. Bu söz dizimi, C99 standardının 6.4.4.2 bölümünde belirtilen söz dizimine ve ayrıca Java 1.5'ten itibaren kullanılan söz dizimine benzer. Özellikle, :meth:`float.hex` 'in çıktısı, C veya Java kodunda bir onaltılık gerçel değişmezi olarak kullanılabilir ve C'nin ``%a`` biçim karakteri veya Java'nın ``Double.toHexString`` 'i tarafından üretilen onaltılık dizeler :meth:`float.fromhex` tarafından kabul edilir.

source: Note that the exponent is written in decimal rather than hexadecimal, and that it gives the power of 2 by which to multiply the coefficient. For example, the hexadecimal string ``0x3.a7p10`` represents the floating-point number ``(3 + 10./16 + 7./16**2) * 2.0**10``, or ``3740.0``::
tr: Üssün onaltılık değil ondalık olarak yazıldığına ve katsayıyı çarpmak için 2'nin gücünü verdiğine dikkat edin. Örneğin, ``0x3.a7p10`` onaltılık dizesi, ``(3 + 10./16 + 7./16**2) * 2.0**10`` veya ``3740.0`` gerçel sayısını temsil eder::

source: Applying the reverse conversion to ``3740.0`` gives a different hexadecimal string representing the same number::
tr: ``3740.0`` 'a ters dönüştürme uygulamak, aynı sayıyı temsil eden farklı bir onaltılık dize verir::

source: Hashing of numeric types
tr: Sayısal türlerin hashlemesi

source: For numbers ``x`` and ``y``, possibly of different types, it's a requirement that ``hash(x) == hash(y)`` whenever ``x == y`` (see the :meth:`~object.__hash__` method documentation for more details). For ease of implementation and efficiency across a variety of numeric types (including :class:`int`, :class:`float`, :class:`decimal.Decimal` and :class:`fractions.Fraction`) Python's hash for numeric types is based on a single mathematical function that's defined for any rational number, and hence applies to all instances of :class:`int` and :class:`fractions.Fraction`, and all finite instances of :class:`float` and :class:`decimal.Decimal`. Essentially, this function is given by reduction modulo ``P`` for a fixed prime ``P``. The value of ``P`` is made available to Python as the :attr:`modulus` attribute of :data:`sys.hash_info`.
tr: Muhtemelen farklı türlerdeki ``x`` ve ``y`` sayıları için, ``x == y`` olduğunda ``hash(x) == hash(y)`` olması bir gerekliliktir (bkz. :meth:`~object.__hash__`). Çeşitli sayısal türler arasında uygulama kolaylığı ve verimlilik için (:class:`int`, :class:`float`, :class:`decimal.Decimal` ve :class:`fractions.Fraction` dahil) Python'un sayısal türler için hash'i, herhangi bir rasyonel sayı için tanımlanmış tek bir matematiksel fonksiyona dayanır ve bu nedenle :class:`int` ve :class:`fractions.Fraction` 'ın tüm örnekleri ve :class:`float` ve :class:`decimal.Decimal` öğelerinin tüm sonlu örnekleri için geçerlidir. Esasen, bu fonksiyon sabit bir asal sayı olan ``P`` için ``reduction modulo`` ``P`` ile verilir. ``P`` değeri Python'a :data:`sys.hash_info` 'nun :attr:`modulus` özelliği olarak sunulur.

source: Currently, the prime used is ``P = 2**31 - 1`` on machines with 32-bit C longs and ``P = 2**61 - 1`` on machines with 64-bit C longs.
tr: Şu anda kullanılan asal sayı, 32 bit C uzunluğundaki makinelerde ``P = 2**31 - 1`` ve 64-bit C uzunluğundaki makinelerde ``P = 2**61 - 1`` şeklindedir.

source: Here are the rules in detail:
tr: İşte ayrıntılı kurallar:

source: If ``x = m / n`` is a nonnegative rational number and ``n`` is not divisible by ``P``, define ``hash(x)`` as ``m * invmod(n, P) % P``, where ``invmod(n, P)`` gives the inverse of ``n`` modulo ``P``.
tr: ``x = m / n`` negatif olmayan bir rasyonel sayıysa ve ``n`` ``P`` ile bölünemiyorsa, ``hash(x)`` 'i ``m * invmod(n, P) % P`` olarak tanımlayın, bu durumda ``invmod(n, P)``, ``n`` modül ``P`` 'nin tersini verir.

source: If ``x = m / n`` is a nonnegative rational number and ``n`` is divisible by ``P`` (but ``m`` is not) then ``n`` has no inverse modulo ``P`` and the rule above doesn't apply; in this case define ``hash(x)`` to be the constant value ``sys.hash_info.inf``.
tr: ``x = m / n`` negatif olmayan bir rasyonel sayıysa ve ``n``, ``P`` ile bölünebiliyorsa (ancak ``m`` değildir), o zaman ``n`` 'nin ``P`` şeklinde ters modülü yoktur ve yukarıdaki kural geçerli değildir; bu durumda ``hash(x)`` i ``sys.hash_info.inf`` olarak tanımlayın.

source: If ``x = m / n`` is a negative rational number define ``hash(x)`` as ``-hash(-x)``. If the resulting hash is ``-1``, replace it with ``-2``.
tr: ``x = m / n`` negatif bir rasyonel sayıysa, ``hash(x)`` 'i ``-hash(-x)`` olarak tanımlayın. Elde edilen ``hash`` ``-1`` ise, bunu ``-2`` ile değiştirin.

source: The particular values ``sys.hash_info.inf`` and ``-sys.hash_info.inf`` are used as hash values for positive infinity or negative infinity (respectively).
tr: ``sys.hash_info.inf`` ve ``-sys.hash_info.inf``, pozitif sonsuz veya negatif sonsuz (sırasıyla) için ``hash`` değerleri olarak kullanılır.

source: For a :class:`complex` number ``z``, the hash values of the real and imaginary parts are combined by computing ``hash(z.real) + sys.hash_info.imag * hash(z.imag)``, reduced modulo ``2**sys.hash_info.width`` so that it lies in ``range(-2**(sys.hash_info.width - 1), 2**(sys.hash_info.width - 1))``. Again, if the result is ``-1``, it's replaced with ``-2``.
tr: Bir :class:`complex` sayı ``z`` için, gerçek ve sanal parçaların hash değerleri, ``hash(z.real) + sys.hash_info.imag * hash(z.imag)`` , ``reduced modulo`` ``2**sys.hash_info.width`` hesaplanarak birleştirilir, böylece ``range(-2**(sys.hash_info.width - 1), 2**(sys.hash_info.width - 1))`` 'de bulunur. Yine sonuç ``-1`` ise, ``-2`` ile değiştirilir.

source: To clarify the above rules, here's some example Python code, equivalent to the built-in hash, for computing the hash of a rational number, :class:`float`, or :class:`complex`::
tr: Yukarıdaki kuralları açıklığa kavuşturmak için, :class:`float` veya :class:`complex` olan rasyonel bir sayının ``hash`` 'ini hesaplamak için gömülü ``hash`` 'e eş değer örnek Python kodu::

source: Boolean Type - :class:`bool`
tr: Boole Türü - :sınıf:`bool`

source: Booleans represent truth values. The :class:`bool` type has exactly two constant instances: ``True`` and ``False``.
tr: Boolean'lar doğruluk değerlerini temsil eder. :class:`bool` türünün tam olarak iki sabit örneği vardır: ``Doğru`` ve ``Yanlış``.

source: The built-in function :func:`bool` converts any value to a boolean, if the value can be interpreted as a truth value (see section :ref:`truth` above).
tr: Yerleşik :func:`bool` işlevi, eğer değer bir doğruluk değeri olarak yorumlanabiliyorsa, herhangi bir değeri bir boole dönüştürür (yukarıdaki :ref:`truth` bölümüne bakın).

source: For logical operations, use the :ref:`boolean operators <boolean>` ``and``, ``or`` and ``not``. When applying the bitwise operators ``&``, ``|``, ``^`` to two booleans, they return a bool equivalent to the logical operations "and", "or", "xor". However, the logical operators ``and``, ``or`` and ``!=`` should be preferred over ``&``, ``|`` and ``^``.
tr: Mantıksal işlemler için :ref:`boolean operatörlerini <boolean>` ``and``, ``or`` ve ``not`` kullanın. Bitsel operatörler ``&``, ``|``, ``^`` iki boolean'a uygulandığında, "ve", "veya", "xor" mantıksal işlemlerine eşdeğer bir bool döndürürler. Ancak, mantıksal operatörler ``ve``, ``veya`` ve ``!=``, ``&``, ``|`` ve ``^`` yerine tercih edilmelidir.

source: The use of the bitwise inversion operator ``~`` is deprecated and will raise an error in Python 3.14.
tr: Bitsel ters çevirme operatörünün ``~`` kullanımı artık önerilmemektedir ve Python 3.14'te bir hataya neden olacaktır.

source: :class:`bool` is a subclass of :class:`int` (see :ref:`typesnumeric`). In many numeric contexts, ``False`` and ``True`` behave like the integers 0 and 1, respectively. However, relying on this is discouraged; explicitly convert using :func:`int` instead.
tr: :class:`bool`, :class:`int`in bir alt sınıfıdır (bkz. :ref:`typesnumeric`). Birçok sayısal bağlamda "Yanlış" ve "Doğru" sırasıyla 0 ve 1 tam sayıları gibi davranır. Ancak buna güvenmek tavsiye edilmez; Bunun yerine açıkça :func:`int` kullanarak dönüştürün.

source: Iterator Types
tr: Yineleyici Türleri

source: Python supports a concept of iteration over containers. This is implemented using two distinct methods; these are used to allow user-defined classes to support iteration. Sequences, described below in more detail, always support the iteration methods.
tr: Python, konteynerler üzerinde yineleme kavramını destekler. Bu, iki farklı metot kullanılarak uygulanır; bunlar, kullanıcı tanımlı sınıfların yinelemeyi desteklemesine izin vermek için kullanılır. Aşağıda daha ayrıntılı olarak açıklanan diziler, her zaman yineleme metotlarını destekler.

source: One method needs to be defined for container objects to provide :term:`iterable` support:
tr: Container nesnelerinin :term:`iterable` desteği sağlaması için bir metodun tanımlanması gerekir:

source: Return an :term:`iterator` object. The object is required to support the iterator protocol described below. If a container supports different types of iteration, additional methods can be provided to specifically request iterators for those iteration types. (An example of an object supporting multiple forms of iteration would be a tree structure which supports both breadth-first and depth-first traversal.) This method corresponds to the :c:member:`~PyTypeObject.tp_iter` slot of the type structure for Python objects in the Python/C API.
tr: Bir :term:`iterator` nesnesi döndürür. Nesnenin aşağıda açıklanan yineleyici protokolünü desteklemesi gerekir. Bir container, farklı yineleme türlerini destekliyorsa, bu yineleme türleri için özel olarak yineleyiciler istemek için ek yöntemler sağlanabilir. (Birden çok yineleme biçimini destekleyen bir nesneye örnek olarak hem genişlik öncelikli hem de derinlik öncelikli geçişi destekleyen bir ağaç yapısı verilebilir.) Bu metot, Python/C API'sindeki Python nesneleri için tür yapısının :c:member:`~PyTypeObject.tp_iter` yuvasına karşılık gelir.

source: The iterator objects themselves are required to support the following two methods, which together form the :dfn:`iterator protocol`:
tr: Yineleyici nesnelerinin kendilerinin, birlikte :dfn:`iterator protocol` 'ü oluşturan aşağıdaki iki metodu desteklemesi gerekir:

source: Return the :term:`iterator` object itself. This is required to allow both containers and iterators to be used with the :keyword:`for` and :keyword:`in` statements. This method corresponds to the :c:member:`~PyTypeObject.tp_iter` slot of the type structure for Python objects in the Python/C API.
tr: :term:`iterator` nesnesinin kendisini döndürür. Bu, hem containerların hem de yineleyicilerin :keyword:`for` ve :keyword:`in` ifadeleriyle birlikte kullanılmasına izin vermek için gereklidir. Bu metot, Python/C API'sindeki Python nesneleri için tür yapısının :c:member:`~PyTypeObject.tp_iter` yuvasına karşılık gelir.

source: Return the next item from the :term:`iterator`. If there are no further items, raise the :exc:`StopIteration` exception. This method corresponds to the :c:member:`~PyTypeObject.tp_iternext` slot of the type structure for Python objects in the Python/C API.
tr: :term:`iterator` 'den sonraki öğeyi döndürür. Başka öğe yoksa, :exc:`StopIteration` hatasını verir. Bu metot, Python/C API'sindeki Python nesneleri için tür yapısının :c:member:`~PyTypeObject.tp_iternext` yuvasına karşılık gelir.

source: Python defines several iterator objects to support iteration over general and specific sequence types, dictionaries, and other more specialized forms. The specific types are not important beyond their implementation of the iterator protocol.
tr: Python, genel ve özel dizi türleri, sözlükler ve diğer daha özel formlar üzerinde yinelemeyi desteklemek için birkaç yineleyici nesnesi tanımlar. Belirli türler, yineleyici protokolünün uygulanmasının ötesinde önemli değildir.

source: Once an iterator's :meth:`~iterator.__next__` method raises :exc:`StopIteration`, it must continue to do so on subsequent calls. Implementations that do not obey this property are deemed broken.
tr: Bir yineleyicinin :meth:`~iterator.__next__` metodu :exc:`StopIteration` hatasını verdiğinde, sonraki çağrılarda bunu yapmaya devam etmelidir. Bu özelliğe uymayan uygulamalar bozuk sayılır.

source: Generator Types
tr: Oluşturucu Tipleri

source: Python's :term:`generator`\s provide a convenient way to implement the iterator protocol. If a container object's :meth:`__iter__` method is implemented as a generator, it will automatically return an iterator object (technically, a generator object) supplying the :meth:`__iter__` and :meth:`~generator.__next__` methods. More information about generators can be found in :ref:`the documentation for the yield expression <yieldexpr>`.
tr: Python'un :term:`generator`\s, yineleyici protokolünü uygulamak için uygun bir yol sağlar. Bir container nesnesinin :meth:`__iter__` metodu bir oluşturucu olarak uygulanırsa, otomatik olarak :meth:`__iter__` ve :meth:`~generator.__next__` metotlarını sağlayan bir yineleyici nesne (teknik olarak bir oluşturucu nesnesi) döndürür. Oluşturucular hakkında daha fazla bilgi :ref:`the documentation for the yield expression <yieldexpr>` adresinde bulunabilir.

source: Sequence Types --- :class:`list`, :class:`tuple`, :class:`range`
tr: Dizi Tipleri --- :class:`list`, :class:`tuple`, :class:`range`

source: There are three basic sequence types: lists, tuples, and range objects. Additional sequence types tailored for processing of :ref:`binary data <binaryseq>` and :ref:`text strings <textseq>` are described in dedicated sections.
tr: Üç temel dizi türü vardır: listeler, demetler ve aralık nesneleri. :ref:`binary data <binaryseq>` ve :ref:`text strings <textseq>` 'in işlenmesi için uyarlanmış ek dizi türleri, özel bölümlerde açıklanmıştır.

source: Common Sequence Operations
tr: Yaygın Dizi İşlemleri

source: The operations in the following table are supported by most sequence types, both mutable and immutable. The :class:`collections.abc.Sequence` ABC is provided to make it easier to correctly implement these operations on custom sequence types.
tr: Aşağıdaki tablodaki işlemler, hem değiştirilebilir hem de değiştirilemez olan çoğu dizi türü tarafından desteklenir. :class:`collections.abc.Sequence` ABC, bu işlemleri özel dize türlerinde doğru şekilde uygulamayı kolaylaştırmak için sağlanmıştır.

source: This table lists the sequence operations sorted in ascending priority. In the table, *s* and *t* are sequences of the same type, *n*, *i*, *j* and *k* are integers and *x* is an arbitrary object that meets any type and value restrictions imposed by *s*.
tr: Bu tablo artan önceliğe göre sıralanmış dizi işlemlerini listeler. Tabloda *s* ve *t* aynı türden dizilerdir, *n*, *i*, *j* ve *k* tam sayılardır ve *x*, *s* tarafından dayatılan her tür ve değer kısıtlamasını karşılayan isteğe bağlı bir nesnedir.

source: The ``in`` and ``not in`` operations have the same priorities as the comparison operations. The ``+`` (concatenation) and ``*`` (repetition) operations have the same priority as the corresponding numeric operations. [3]_
tr: ``in`` ve ``not in`` işlemleri, karşılaştırma işlemleriyle aynı önceliklere sahiptir. ``+`` (birleştirme) ve ``*`` (yineleme) işlemleri, karşılık gelen sayısal işlemlerle aynı önceliğe sahiptir. [3]_

source: ``True`` if an item of *s* is equal to *x*, else ``False``
tr: *s* 'nin bir öğesi *x* 'e eşitse ``True``, aksi takdirde ``False``

source: ``False`` if an item of *s* is equal to *x*, else ``True``
tr: *s* 'nin bir öğesi *x* 'e eşitse ``False``, aksi taktirde ``True``

source: the concatenation of *s* and *t*
tr: *s* ve *t* 'nin birleşimi

source: ``s * n`` or ``n * s``
tr: ``s * n`` veya ``n * s``

source: equivalent to adding *s* to itself *n* times
tr: *s* 'yi kendisine *n* kez eklemeye eş değer

source: *i*\ th item of *s*, origin 0
tr: *s* 'nin *i*\ 'inci öğesi, orijin 0

source: slice of *s* from *i* to *j*
tr: *s* 'nin *i* 'den *j* 'ye kadar olan dilimi

source: slice of *s* from *i* to *j* with step *k*
tr: *s* 'nin *i* 'den *j* 'ye kadar olan dilimi, *k* 'lik adımlarla (örneğin *k* = 2 ise, ikişer ikişer)

source: length of *s*
tr: *s* 'nin uzunluğu

source: smallest item of *s*
tr: *s* 'nin en küçük öğesi

source: largest item of *s*
tr: *s* 'nin en büyük öğesi

source: index of the first occurrence of *x* in *s* (at or after index *i* and before index *j*)
tr: *x* 'in *s* içindeki ilk görüldüğü dizini (*i* dizininde veya sonrasında ve *j* dizininden önce)

source: total number of occurrences of *x* in *s*
tr: *s* 'de *x*'in toplam görülme sayısı

source: Sequences of the same type also support comparisons. In particular, tuples and lists are compared lexicographically by comparing corresponding elements. This means that to compare equal, every element must compare equal and the two sequences must be of the same type and have the same length. (For full details see :ref:`comparisons` in the language reference.)
tr: Aynı türden diziler de karşılaştırmaları destekler. Özellikle, demetler ve listeler, karşılık gelen öğeler ile sözlükbilimsel olarak karşılaştırılır. Bu, eşit karşılaştırma yapılabilmesi için her öğenin eşit olarak karşılaştırması gerektiği ve iki dizinin aynı türde ve aynı uzunlukta olması gerektiği anlamına gelir. (Tüm ayrıntılar için dil referansındaki :ref:`comparisons` bölümüne bakın.)

source: Forward and reversed iterators over mutable sequences access values using an index. That index will continue to march forward (or backward) even if the underlying sequence is mutated. The iterator terminates only when an :exc:`IndexError` or a :exc:`StopIteration` is encountered (or when the index drops below zero).
tr: Değiştirilebilir diziler üzerindeki ileri ve geri yineleyiciler, bir dizin kullanarak değerlere erişir. Temel dizi mutasyona uğrasa bile bu endeks ileri (veya geri) ilerlemeye devam edecektir. Yineleyici yalnızca :exc:`IndexError` veya :exc:`StopIteration` ile karşılaşıldığında (veya dizin sıfırın altına düştüğünde) sonlandırılır.
