Repository: python/python-docs-tr
Catalog: library/stdtypes.po
Languages: tr

source: One-dimensional memoryviews can now be sliced. One-dimensional memoryviews with formats 'B', 'b' or 'c' are now :term:`hashable`.
tr: Tek boyutlu bellek görünümleri artık dilimlenebilir. 'B', 'b' veya 'c' formatlarına sahip tek boyutlu bellek görünümleri artık hashlenebilir.

source: memoryview is now registered automatically with :class:`collections.abc.Sequence`
tr: memoryview artık :class:`collections.abc.Sequence` ile otomatik olarak kaydedilir

source: memoryviews can now be indexed with tuple of integers.
tr: memoryviews artık tamsayılardan oluşan bir tuple ile indekslenebilir.

source: :class:`memoryview` has several methods:
tr: :class:`memoryview` birkaç yönteme sahiptir:

source: A memoryview and a :pep:`3118` exporter are equal if their shapes are equivalent and if all corresponding values are equal when the operands' respective format codes are interpreted using :mod:`struct` syntax.
tr: Bir memoryview ve bir :pep:`3118` dışa aktarıcı, şekilleri eşdeğerse ve işlenenlerin ilgili format kodları :mod:`struct` sözdizimi kullanılarak yorumlandığında karşılık gelen tüm değerler eşitse eşittir.

source: For the subset of :mod:`struct` format strings currently supported by :meth:`tolist`, ``v`` and ``w`` are equal if ``v.tolist() == w.tolist()``::
tr: Şu anda :meth:`tolist` tarafından desteklenen :mod:`struct` biçim dizelerinin alt kümesi için, `v.tolist() == w.tolist() ise, ``v`` ve ``w`` eşittir. ``::

source: If either format string is not supported by the :mod:`struct` module, then the objects will always compare as unequal (even if the format strings and buffer contents are identical)::
tr: Biçim dizelerinden herhangi biri :mod:`struct` modülü tarafından desteklenmiyorsa, nesneler her zaman eşit olmayan olarak karşılaştırılır (biçim dizeleri ve arabellek içerikleri aynı olsa bile)::

source: Note that, as with floating point numbers, ``v is w`` does *not* imply ``v == w`` for memoryview objects.
tr: Kayan noktalı sayılarda olduğu gibi, "v is w" ifadesinin memoryview nesneleri için "v == w" anlamına gelmediğini* unutmayın.

source: Previous versions compared the raw memory disregarding the item format and the logical array structure.
tr: Önceki sürümler, öğe formatını ve mantıksal dizi yapısını göz ardı ederek ham belleği karşılaştırdı.

source: Return the data in the buffer as a bytestring. This is equivalent to calling the :class:`bytes` constructor on the memoryview. ::
tr: Tampondaki verileri bytestring olarak döndürün. Bu, bellek görünümünde :class:`bytes` yapıcısını çağırmaya eşdeğerdir. ::

source: For non-contiguous arrays the result is equal to the flattened list representation with all elements converted to bytes. :meth:`tobytes` supports all format strings, including those that are not in :mod:`struct` module syntax.
tr: Bitişik olmayan diziler için sonuç, tüm öğelerin bayta dönüştürüldüğü düzleştirilmiş liste gösterimine eşittir. :meth:`tobytes`, :mod:`struct` modülünün sözdiziminde olmayanlar da dahil olmak üzere tüm biçim dizelerini destekler.

source: *order* can be {'C', 'F', 'A'}. When *order* is 'C' or 'F', the data of the original array is converted to C or Fortran order. For contiguous views, 'A' returns an exact copy of the physical memory. In particular, in-memory Fortran order is preserved. For non-contiguous views, the data is converted to C first. *order=None* is the same as *order='C'*.
tr: *sipariş* {'C', 'F', 'A'} olabilir. *order* 'C' veya 'F' olduğunda, orijinal dizinin verileri C veya Fortran sırasına dönüştürülür. Bitişik görünümler için 'A', fiziksel belleğin tam bir kopyasını döndürür. Özellikle bellek içi Fortran düzeni korunur. Bitişik olmayan görünümler için veriler önce C'ye dönüştürülür. *order=Yok*, *order='C'* ile aynıdır.

source: Return a string object containing two hexadecimal digits for each byte in the buffer. ::
tr: Arabellekteki her bayt için iki onaltılık basamak içeren bir dize nesnesi döndürür. ::

source: Similar to :meth:`bytes.hex`, :meth:`memoryview.hex` now supports optional *sep* and *bytes_per_sep* parameters to insert separators between bytes in the hex output.
tr: :meth:`bytes.hex`e benzer şekilde, :meth:`memoryview.hex` artık onaltılık çıktıda baytlar arasına ayırıcılar eklemek için isteğe bağlı *sep* ve *bytes_per_sep* parametrelerini destekler.

source: Return the data in the buffer as a list of elements. ::
tr: Arabellekteki verileri bir öğe listesi olarak döndürün. ::

source: :meth:`tolist` now supports all single character native formats in :mod:`struct` module syntax as well as multi-dimensional representations.
tr: :meth:`tolist` artık :mod:`struct` modülü sözdizimindeki tüm tek karakter yerel formatlarını ve çok boyutlu gösterimleri destekliyor.

source: Return a readonly version of the memoryview object. The original memoryview object is unchanged. ::
tr: Memoryview nesnesinin salt okunur bir sürümünü döndürür. Orijinal memoryview nesnesi değişmedi. ::

source: Release the underlying buffer exposed by the memoryview object. Many objects take special actions when a view is held on them (for example, a :class:`bytearray` would temporarily forbid resizing); therefore, calling release() is handy to remove these restrictions (and free any dangling resources) as soon as possible.
tr: Memoryview nesnesi tarafından sunulan temel arabelleği serbest bırakın. Birçok nesne, üzerlerinde bir görünüm tutulduğunda özel eylemler gerçekleştirir (örneğin, bir :class:'bytearray' yeniden boyutlandırmayı geçici olarak yasaklar); bu nedenle, release() çağrılması, bu kısıtlamaları mümkün olan en kısa sürede kaldırmak (ve sarkan kaynakları serbest bırakmak) için kullanışlıdır.

source: After this method has been called, any further operation on the view raises a :class:`ValueError` (except :meth:`release()` itself which can be called multiple times)::
tr: Bu yöntem çağrıldıktan sonra, görünümdeki diğer işlemler bir :class:`ValueError` oluşturur (birden çok kez çağrılabilen :meth:`release()` dışında)::

source: The context management protocol can be used for a similar effect, using the ``with`` statement::
tr: Bağlam yönetimi protokolü, ``with`` ifadesi kullanılarak benzer bir etki için kullanılabilir::

source: Cast a memoryview to a new format or shape. *shape* defaults to ``[byte_length//new_itemsize]``, which means that the result view will be one-dimensional. The return value is a new memoryview, but the buffer itself is not copied. Supported casts are 1D -> C-:term:`contiguous` and C-contiguous -> 1D.
tr: Bir bellek görünümünü yeni bir biçime veya şekle dönüştürün. *shape* varsayılan olarak ``[byte_length//new_itemsize]`` şeklindedir, bu da sonuç görünümünün tek boyutlu olacağı anlamına gelir. Dönen değer, yeni bir bellek görünümüdür, ancak arabelleğin kendisi kopyalanmaz. Desteklenen yayınlar 1D -> C-:term:`contiguous` ve C-contiguous -> 1D'dir.

source: The destination format is restricted to a single element native format in :mod:`struct` syntax. One of the formats must be a byte format ('B', 'b' or 'c'). The byte length of the result must be the same as the original length. Note that all byte lengths may depend on the operating system.
tr: Hedef format :mod:`struct` sözdiziminde tek öğeli yerel formatla sınırlıdır. Formatlardan biri bayt formatı olmalıdır ('B', 'b' veya 'c'). Sonucun bayt uzunluğu orijinal uzunlukla aynı olmalıdır. Tüm bayt uzunluklarının işletim sistemine bağlı olabileceğini unutmayın.

source: Cast 1D/long to 1D/unsigned bytes::
tr: 1B/uzun ila 1B/işaretsiz baytları yayınla::

source: Cast 1D/unsigned bytes to 1D/char::
tr: 1D/imzasız baytları 1D/char'a aktar::

source: Cast 1D/bytes to 3D/ints to 1D/signed char::
tr: 1D/baytları 3D'ye/ints'i 1D/signed char'a yayınla::

source: Cast 1D/unsigned long to 2D/unsigned long::
tr: 1D/unsigned long'u 2D/unsigned long'a yayınla::

source: The source format is no longer restricted when casting to a byte view.
tr: Bir bayt görünümüne yayın yapılırken kaynak biçimi artık kısıtlanmamaktadır.

source: There are also several readonly attributes available:
tr: Ayrıca birkaç salt okunur öznitelik mevcuttur:

source: The underlying object of the memoryview::
tr: Memoryview'in altında yatan nesne::

source: ``nbytes == product(shape) * itemsize == len(m.tobytes())``. This is the amount of space in bytes that the array would use in a contiguous representation. It is not necessarily equal to ``len(m)``::
tr: ``nbayt == ürün(şekil) * öğe boyutu == len(m.tobytes())``. Bu, dizinin bitişik bir temsilde kullanacağı bayt cinsinden alan miktarıdır. ``len(m)`` değerine eşit olması gerekmez::

source: Multi-dimensional arrays::
tr: Çok boyutlu diziler::

source: A bool indicating whether the memory is read only.
tr: Belleğin salt okunur olup olmadığını gösteren bir bool.

source: A string containing the format (in :mod:`struct` module style) for each element in the view. A memoryview can be created from exporters with arbitrary format strings, but some methods (e.g. :meth:`tolist`) are restricted to native single element formats.
tr: Görünümdeki her öğe için biçimi ( :mod:`struct` modül stilinde) içeren bir dize. Rastgele biçim dizeleriyle dışa aktarıcılardan bir bellek görünümü oluşturulabilir, ancak bazı yöntemler (ör. :meth:`tolist`) yerel tek öğe biçimleriyle sınırlıdır.

source: format ``'B'`` is now handled according to the struct module syntax. This means that ``memoryview(b'abc')[0] == b'abc'[0] == 97``.
tr: ``'B'`` formatı artık yapı modülü sözdizimine göre işleniyor. Bu, ``memoryview(b'abc')[0] == b'abc'[0] == 97`` anlamına gelir.

source: The size in bytes of each element of the memoryview::
tr: Bellek görünümündeki her bir öğenin bayt cinsinden boyutu::

source: An integer indicating how many dimensions of a multi-dimensional array the memory represents.
tr: Belleğin çok boyutlu bir dizinin kaç boyutunu temsil ettiğini gösteren bir tamsayı.

source: A tuple of integers the length of :attr:`ndim` giving the shape of the memory as an N-dimensional array.
tr: Belleğin şeklini N boyutlu bir dizi olarak veren :attr:`ndim` uzunluğunda bir tam sayı demeti.

source: An empty tuple instead of ``None`` when ndim = 0.
tr: Ndim = 0 olduğunda ``None`` yerine boş bir demetdir.

source: A tuple of integers the length of :attr:`ndim` giving the size in bytes to access each element for each dimension of the array.
tr: :attr:`ndim` uzunluğunda, dizinin her boyutu için her bir öğeye erişmek için boyutu bayt cinsinden veren bir tamsayı demeti.

source: Used internally for PIL-style arrays. The value is informational only.
tr: PIL tarzı diziler için dahili olarak kullanılır. Değer yalnızca bilgi amaçlıdır.

source: A bool indicating whether the memory is C-:term:`contiguous`.
tr: Belleğin C-:term:`contiguous` olup olmadığını gösteren bir bool.

source: A bool indicating whether the memory is Fortran :term:`contiguous`.
tr: Belleğin Fortran :term:`contiguous` olup olmadığını gösteren bir bool.

source: A bool indicating whether the memory is :term:`contiguous`.
tr: Belleğin :term:`contiguous` olup olmadığını gösteren bir bool.

source: Set Types --- :class:`set`, :class:`frozenset`
tr: Set Türleri --- :class:`set`, :class:`frozenset`

source: A :dfn:`set` object is an unordered collection of distinct :term:`hashable` objects. Common uses include membership testing, removing duplicates from a sequence, and computing mathematical operations such as intersection, union, difference, and symmetric difference. (For other containers see the built-in :class:`dict`, :class:`list`, and :class:`tuple` classes, and the :mod:`collections` module.)
tr: Bir :dfn:`set` nesnesi, farklı :term:`hashable` nesnelerinin sıralanmamış bir koleksiyonudur. Yaygın kullanımları arasında üyelik sınaması, bir diziden yinelenenlerin kaldırılması ve kesişim, birleşim, fark ve simetrik fark gibi matematiksel işlemlerin hesaplanması yer alır. (Diğer kapsayıcılar için yerleşik :class:`dict`, :class:`list` ve :class:`tuple` sınıflarına ve :mod:`collections` modülüne bakın)

source: Like other collections, sets support ``x in set``, ``len(set)``, and ``for x in set``. Being an unordered collection, sets do not record element position or order of insertion. Accordingly, sets do not support indexing, slicing, or other sequence-like behavior.
tr: Diğer koleksiyonlar gibi, kümeler de ``x in set``, ``len(set)``, ve ``for x in set`` özelliklerini destekler. Sırasız bir koleksiyon olan kümeler, eleman konumunu veya ekleme sırasını kaydetmez. Buna göre, kümeler dizinleme, dilimleme veya sıra benzeri davranışları desteklemez.

source: There are currently two built-in set types, :class:`set` and :class:`frozenset`. The :class:`set` type is mutable --- the contents can be changed using methods like :meth:`~set.add` and :meth:`~set.remove`. Since it is mutable, it has no hash value and cannot be used as either a dictionary key or as an element of another set. The :class:`frozenset` type is immutable and :term:`hashable` --- its contents cannot be altered after it is created; it can therefore be used as a dictionary key or as an element of another set.
tr: Şu anda iki yerleşik set türü vardır, :class:`set` ve :class:`frozenset`. :class:`set` türü değişkendir --- içeriği :meth:`~set.add` ve :meth:`~set.remove` gibi yöntemler kullanılarak değiştirilebilir. Değiştirilebilir olduğu için hash değeri yoktur ve bir sözlük anahtarı ya da başka bir kümenin elemanı olarak kullanılamaz. :class:`frozenset` türü değişmezdir ve :term:`hashable` --- içeriği oluşturulduktan sonra değiştirilemez; bu nedenle bir sözlük anahtarı veya başka bir kümenin öğesi olarak kullanılabilir.

source: Non-empty sets (not frozensets) can be created by placing a comma-separated list of elements within braces, for example: ``{'jack', 'sjoerd'}``, in addition to the :class:`set` constructor.
tr: Boş olmayan kümeler (frozensetler değil), :class:`set` yapıcısına ek olarak parantez içine virgülle ayrılmış bir öğe listesi yerleştirilerek oluşturulabilir, örneğin: ``{'jack', 'sjoerd'}``.

source: The constructors for both classes work the same:
tr: Her iki sınıfın kurucuları aynı şekilde çalışır:

source: Return a new set or frozenset object whose elements are taken from *iterable*. The elements of a set must be :term:`hashable`. To represent sets of sets, the inner sets must be :class:`frozenset` objects. If *iterable* is not specified, a new empty set is returned.
tr: Elemanları *iterable* öğesinden alınan yeni bir küme veya frozenset nesnesi döndürür. Bir kümenin elemanları :term:`hashable` olmalıdır. Kümelerin kümelerini temsil etmek için, iç kümeler :class:`frozenset` nesneleri olmalıdır. Eğer *iterable* belirtilmemişse, yeni bir boş küme döndürülür.

source: Sets can be created by several means:
tr: Setler çeşitli yollarla oluşturulabilir:

source: Use a comma-separated list of elements within braces: ``{'jack', 'sjoerd'}``
tr: Parantez içinde virgülle ayrılmış bir öğe listesi kullanın: ``{'jack', 'sjoerd'}``

source: Use a set comprehension: ``{c for c in 'abracadabra' if c not in 'abc'}``
tr: Bir küme kavrayışı kullanın: ``{c for c in 'abracadabra' if c not in 'abc'}``

source: Use the type constructor: ``set()``, ``set('foobar')``, ``set(['a', 'b', 'foo'])``
tr: Tür kurucusunu kullanın: ``set()``, ``set('foobar')``, ``set(['a', 'b', 'foo'])``

source: Instances of :class:`set` and :class:`frozenset` provide the following operations:
tr: :class:`set` ve :class:`frozenset` örnekleri aşağıdaki işlemleri sağlar:

source: Return the number of elements in set *s* (cardinality of *s*).
tr: *s* kümesindeki eleman sayısını döndürür (*s*'nin kardinalitesi).

source: Test *x* for membership in *s*.
tr: *x*'i *s* üyeliği için test edin.

source: Test *x* for non-membership in *s*.
tr: *x*'in *s*'ye üye olup olmadığını test edin.

source: Return ``True`` if the set has no elements in common with *other*. Sets are disjoint if and only if their intersection is the empty set.
tr: Kümenin *other* kümelerle ortak hiçbir elemanı yoksa ``True`` döndürür. Kümeler, ancak ve ancak kesişimleri boş küme ise ayrıktır.

source: Test whether every element in the set is in *other*.
tr: Kümedeki her elemanın *other* içinde olup olmadığını test edin.

source: Test whether the set is a proper subset of *other*, that is, ``set <= other and set != other``.
tr: Kümenin *other* kümenin uygun bir alt kümesi olup olmadığını, yani ``set <= other and set != other`` olup olmadığını test eder.

source: Test whether every element in *other* is in the set.
tr: Kümedeki her elemanın *other* içinde olup olmadığını test edin.

source: Test whether the set is a proper superset of *other*, that is, ``set >= other and set != other``.
tr: Kümenin *other* kümenin uygun bir üst kümesi olup olmadığını, yani ``set >= other and set != other`` olup olmadığını test edin.

source: Return a new set with elements from the set and all others.
tr: Kümedeki ve diğer tüm kümelerdeki elemanları içeren yeni bir küme döndürür.

source: Return a new set with elements common to the set and all others.
tr: Küme ve diğer tüm kümeler için ortak öğeler içeren yeni bir küme döndürür.

source: Return a new set with elements in the set that are not in the others.
tr: Küme içinde diğerlerinde olmayan elemanlar içeren yeni bir küme döndürür.

source: Return a new set with elements in either the set or *other* but not both.
tr: Elemanları ya kümede ya da *diğer* kümede olan ancak her ikisinde de olmayan yeni bir küme döndürür.

source: Return a shallow copy of the set.
tr: Kümenin yüzeysel bir kopyasını döndürür.

source: Note, the non-operator versions of :meth:`union`, :meth:`intersection`, :meth:`difference`, :meth:`symmetric_difference`, :meth:`issubset`, and :meth:`issuperset` methods will accept any iterable as an argument. In contrast, their operator based counterparts require their arguments to be sets. This precludes error-prone constructions like ``set('abc') & 'cbs'`` in favor of the more readable ``set('abc').intersection('cbs')``.
tr: Not: :meth:`union`, :meth:`intersection`, :meth:`difference`, :meth:`symmetric_difference`, :meth:`issubset` ve :meth:`issuperset` metotlarının operatörsüz versiyonları herhangi bir yinelenebiliri argüman olarak kabul edecektir. Buna karşılık, operatör tabanlı benzerleri argümanlarının küme olmasını gerektirir. Bu, daha okunabilir ``set('abc').intersection('cbs')`` yerine ``set('abc') & 'cbs'`` gibi hataya açık yapıları engeller. Translated with www.DeepL.com/Translator (free version)

source: Both :class:`set` and :class:`frozenset` support set to set comparisons. Two sets are equal if and only if every element of each set is contained in the other (each is a subset of the other). A set is less than another set if and only if the first set is a proper subset of the second set (is a subset, but is not equal). A set is greater than another set if and only if the first set is a proper superset of the second set (is a superset, but is not equal).
tr: Hem :class:`set` hem de :class:`frozenset` kümeden kümeye karşılaştırmaları destekler. İki küme, ancak ve ancak her kümenin her elemanı diğerinin içinde bulunuyorsa (her biri diğerinin alt kümesi ise) eşittir. Bir küme başka bir kümeden ancak ve ancak birinci küme ikinci kümenin uygun bir alt kümesi ise (bir alt kümedir, ancak eşit değildir) küçüktür. Bir küme, ancak ve ancak birinci küme ikinci kümenin uygun bir üst kümesi ise (bir üst kümedir, ancak eşit değildir) başka bir kümeden büyüktür. Translated with www.DeepL.com/Translator (free version)

source: Instances of :class:`set` are compared to instances of :class:`frozenset` based on their members. For example, ``set('abc') == frozenset('abc')`` returns ``True`` and so does ``set('abc') in set([frozenset('abc')])``.
tr: :class:`set` örnekleri, üyelerine göre :class:`frozenset` örnekleriyle karşılaştırılır. Örneğin, ``set('abc') == frozenset('abc')`` ``True`` döndürür ve ``set('abc') in set([frozenset('abc')])`` de öyle.

source: The subset and equality comparisons do not generalize to a total ordering function. For example, any two nonempty disjoint sets are not equal and are not subsets of each other, so *all* of the following return ``False``: ``a<b``, ``a==b``, or ``a>b``.
tr: Alt küme ve eşitlik karşılaştırmaları toplam sıralama fonksiyonuna genelleştirilemez. Örneğin, boş olmayan herhangi iki ayrık küme eşit değildir ve birbirinin alt kümesi değildir, bu nedenle aşağıdakilerin *all* ``Yanlış`` döndürür: ``a<b``, ``a==b`` veya ``a>b``.

source: Since sets only define partial ordering (subset relationships), the output of the :meth:`list.sort` method is undefined for lists of sets.
tr: Kümeler yalnızca kısmi sıralama (alt küme ilişkileri) tanımladığından, :meth:`list.sort` yönteminin çıktısı küme listeleri için tanımsızdır.

source: Set elements, like dictionary keys, must be :term:`hashable`.
tr: Sözlük anahtarları gibi küme öğeleri de :term:`hashable` olmalıdır.

source: Binary operations that mix :class:`set` instances with :class:`frozenset` return the type of the first operand. For example: ``frozenset('ab') | set('bc')`` returns an instance of :class:`frozenset`.
tr: :class:`set` örneklerini :class:`frozenset` ile karıştıran ikili işlemler ilk işlenenin türünü döndürür. Örneğin: ``frozenset('ab') | set('bc')`` bir :class:`frozenset` örneği döndürür.

source: The following table lists operations available for :class:`set` that do not apply to immutable instances of :class:`frozenset`:
tr: Aşağıdaki tabloda :class:`set` için kullanılabilen ve :class:`frozenset` 'in değişmez örneklerine uygulanmayan işlemler listelenmektedir:

source: Update the set, adding elements from all others.
tr: Diğer tüm öğeleri ekleyerek seti güncelleyin.

source: Update the set, keeping only elements found in it and all others.
tr: Yalnızca içinde bulunan öğeleri ve diğerlerini koruyarak seti güncelleyin.

source: Update the set, removing elements found in others.
tr: Diğerlerinde bulunan öğeleri kaldırarak kümeyi güncelleyin.

source: Update the set, keeping only elements found in either set, but not in both.
tr: Kümeyi güncelleyin, yalnızca her iki kümede de bulunan öğeleri saklayın, ancak her ikisinde de bulunmayın.

source: Add element *elem* to the set.
tr: Kümeye *elem* öğesini ekleyin.

source: Remove element *elem* from the set. Raises :exc:`KeyError` if *elem* is not contained in the set.
tr: Kümeden *elem* elemanını kaldırır. Eğer *elem* kümede bulunmuyorsa :exc:`KeyError` değerini yükseltir.

source: Remove element *elem* from the set if it is present.
tr: Eğer varsa *elem* öğesini kümeden kaldırır.

source: Remove and return an arbitrary element from the set. Raises :exc:`KeyError` if the set is empty.
tr: Kümeden rastgele bir elemanı kaldırır ve döndürür. Küme boşsa :exc:`KeyError` değerini yükseltir.

source: Remove all elements from the set.
tr: Kümeden tüm öğeleri kaldırın.

source: Note, the non-operator versions of the :meth:`update`, :meth:`intersection_update`, :meth:`difference_update`, and :meth:`symmetric_difference_update` methods will accept any iterable as an argument.
tr: Not: :meth:`update`, :meth:`intersection_update`, :meth:`difference_update` ve :meth:`symmetric_difference_update` metotlarının operatör olmayan versiyonları herhangi bir iterable'ı argüman olarak kabul edecektir.

source: Note, the *elem* argument to the :meth:`__contains__`, :meth:`remove`, and :meth:`discard` methods may be a set. To support searching for an equivalent frozenset, a temporary one is created from *elem*.
tr: Not: :meth:`__contains__`, :meth:`remove` ve :meth:`discard` yöntemlerinin *elem* argümanı bir küme olabilir. Eş değer bir frozenset aramayı desteklemek için, *elem*'den geçici bir tane oluşturulur.
