Repository: python/python-docs-tr
Catalog: library/stdtypes.po
Languages: tr

source: The outermost leading and trailing *chars* argument values are stripped from the string. Characters are removed from the leading end until reaching a string character that is not contained in the set of characters in *chars*. A similar action takes place on the trailing end. For example::
tr: En dıştaki ön ve son*chars* bağımsız değişken değerleri dizeden çıkarılır. Karakterler, *chars* içindeki karakter kümesinde bulunmayan bir dize karakterine ulaşılana kadar önde gelen uçtan çıkarılır. Benzer bir işlem son uçta da gerçekleşir. Örneğin::

source: Return a copy of the string with uppercase characters converted to lowercase and vice versa. Note that it is not necessarily true that ``s.swapcase().swapcase() == s``.
tr: Büyük harf karakterleri küçük harfe dönüştürülmüş veya tam tersi yapılmış dizenin bir kopyasını döndürür. ``s.swapcase().swapcase() == s`` ifadesinin mutlaka doğru olması gerekmediğine dikkat edin.

source: Return a titlecased version of the string where words start with an uppercase character and the remaining characters are lowercase.
tr: Sözcüklerin büyük harfle başladığı ve kalan karakterlerin küçük harf olduğu dizenin başlıklandırılmış bir sürümünü döndürür.

source: The algorithm uses a simple language-independent definition of a word as groups of consecutive letters. The definition works in many contexts but it means that apostrophes in contractions and possessives form word boundaries, which may not be the desired result::
tr: Algoritma, bir kelimenin ardışık harf grupları olarak dilden bağımsız basit bir tanımını kullanır. Bu tanım birçok bağlamda işe yarar, ancak bu, kısaltmalar ve iyeliklerdeki kesme işaretlerinin kelime sınırları oluşturduğu anlamına gelir ve bu istenen sonuç olmayabilir::

source: The :func:`string.capwords` function does not have this problem, as it splits words on spaces only.
tr: :func:`string.capwords` işlevinde bu sorun yoktur, çünkü sözcükleri yalnızca boşluklara böler.

source: Alternatively, a workaround for apostrophes can be constructed using regular expressions::
tr: Alternatif olarak, normal ifadeler kullanılarak kesme işaretleri için geçici bir çözüm oluşturulabilir::

source: Return a copy of the string in which each character has been mapped through the given translation table. The table must be an object that implements indexing via :meth:`__getitem__`, typically a :term:`mapping` or :term:`sequence`. When indexed by a Unicode ordinal (an integer), the table object can do any of the following: return a Unicode ordinal or a string, to map the character to one or more other characters; return ``None``, to delete the character from the return string; or raise a :exc:`LookupError` exception, to map the character to itself.
tr: Her karakterin verilen çeviri tablosu aracılığıyla eşlendiği dizgenin bir kopyasını döndürür. Tablo, :meth:`__getitem__` aracılığıyla indeksleme uygulayan bir nesne, tipik olarak bir :term:`mapping` veya :term:`sequence` olmalıdır. Bir Unicode sıra numarası (bir tamsayı) ile indekslendiğinde, tablo nesnesi aşağıdakilerden herhangi birini yapabilir: karakteri bir veya daha fazla başka karakterle eşlemek için bir Unicode sıra numarası veya bir dize döndürmek; karakteri dönüş dizesinden silmek için ``None`` döndürmek; veya karakteri kendisiyle eşlemek için bir :exc:`LookupError` istisnası oluşturmak.

source: You can use :meth:`str.maketrans` to create a translation map from character-to-character mappings in different formats.
tr: Farklı formatlardaki karakterden karaktere eşlemelerden bir çeviri haritası oluşturmak için :meth:`str.maketrans` komutunu kullanabilirsiniz.

source: See also the :mod:`codecs` module for a more flexible approach to custom character mappings.
tr: Özel karakter eşlemelerine daha esnek bir yaklaşım için ayrıca :mod:`codecs` modülüne bakın.

source: Return a copy of the string with all the cased characters [4]_ converted to uppercase. Note that ``s.upper().isupper()`` might be ``False`` if ``s`` contains uncased characters or if the Unicode category of the resulting character(s) is not "Lu" (Letter, uppercase), but e.g. "Lt" (Letter, titlecase).
tr: Tüm büyük harfli karakterlerin [4]_ büyük harfe dönüştürüldüğü dizenin bir kopyasını döndürün. ``s.upper().isupper()``, eğer ``s`` büyük küçük harfe dönüştürülmemiş karakterler içeriyorsa veya ortaya çıkan karakter(ler)in Unicode kategorisi "Lu" değilse (Mektup) ``False`` olabileceğini unutmayın. , büyük harf), ancak ör. "Lt" (Mektup, başlık).

source: The uppercasing algorithm used is `described in section 3.13 'Default Case Folding' of the Unicode Standard <https://www.unicode.org/versions/Unicode15.0.0/ch03.pdf>`__.
tr: Kullanılan büyük harf algoritması 'Unicode Standardı'nın <https://www.unicode.org/versions/Unicode15.0.0/ch03.pdf> 3.13 'Varsayılan Harf Katlaması' bölümünde açıklanmıştır.

source: Return a copy of the string left filled with ASCII ``'0'`` digits to make a string of length *width*. A leading sign prefix (``'+'``/``'-'``) is handled by inserting the padding *after* the sign character rather than before. The original string is returned if *width* is less than or equal to ``len(s)``.
tr: Uzunluk *genişlik* uzunluğunda bir dize oluşturmak için soldaki dizenin ASCII ``'0'`` rakamlarıyla dolu bir kopyasını döndürün. Baştaki işaret öneki (``'+'``/``'-'``), işaret karakterinin öncesine değil *sonrasına* dolgu eklenerek işlenir. *width* ``len(s)`` değerinden küçük veya ona eşitse orijinal dize döndürülür.

source: ``printf``-style String Formatting
tr: ``printf`` tarzı Dize Biçimlendirmesi

source: The formatting operations described here exhibit a variety of quirks that lead to a number of common errors (such as failing to display tuples and dictionaries correctly). Using the newer :ref:`formatted string literals <f-strings>`, the :meth:`str.format` interface, or :ref:`template strings <template-strings>` may help avoid these errors. Each of these alternatives provides their own trade-offs and benefits of simplicity, flexibility, and/or extensibility.
tr: Burada açıklanan biçimlendirme işlemleri, bir dizi yaygın hataya (demetlerin ve sözlüklerin doğru şekilde görüntülenememesi gibi) yol açan çeşitli tuhaflıklar sergiler. Daha yeni :ref:`formatlı dize değişmezleri <f-strings>`, :meth:`str.format` arayüzü veya :ref:`template strings <template-strings>` kullanılması bu hataların önlenmesine yardımcı olabilir. Bu alternatiflerin her biri kendi dengelerini ve basitlik, esneklik ve/veya genişletilebilirlik faydalarını sağlar.

source: String objects have one unique built-in operation: the ``%`` operator (modulo). This is also known as the string *formatting* or *interpolation* operator. Given ``format % values`` (where *format* is a string), ``%`` conversion specifications in *format* are replaced with zero or more elements of *values*. The effect is similar to using the :c:func:`sprintf` in the C language.
tr: Dize nesnelerinin benzersiz bir yerleşik işlemi vardır: ``%`` operatörü (modulo). Bu aynı zamanda dize *biçimlendirme* veya *enterpolasyon* operatörü olarak da bilinir. ``Biçim % değerleri`` (burada *format* bir dizedir) verildiğinde, *format* içindeki ``%`` dönüştürme spesifikasyonları sıfır veya daha fazla *values* öğesiyle değiştirilir. Etki, C dilinde :c:func:`sprintf` kullanımına benzer.

source: If *format* requires a single argument, *values* may be a single non-tuple object. [5]_ Otherwise, *values* must be a tuple with exactly the number of items specified by the format string, or a single mapping object (for example, a dictionary).
tr: *format* tek bir argüman gerektiriyorsa, *values* tuple olmayan tek bir nesne olabilir. [5]_ Aksi halde, *değerler*, biçim dizesi tarafından belirtilen öğe sayısını tam olarak içeren bir tanımlama grubu veya tek bir eşleme nesnesi (örneğin, bir sözlük) olmalıdır.

source: A conversion specifier contains two or more characters and has the following components, which must occur in this order:
tr: Bir dönüşüm belirteci iki veya daha fazla karakter içerir ve bu sırayla gerçekleşmesi gereken aşağıdaki bileşenlere sahiptir:

source: The ``'%'`` character, which marks the start of the specifier.
tr: Belirleyicinin başlangıcını işaret eden ``'%'`` karakteri.

source: Mapping key (optional), consisting of a parenthesised sequence of characters (for example, ``(somename)``).
tr: Parantez içindeki karakter dizisinden oluşan eşleme anahtarı (isteğe bağlı) (örneğin, ``(bazı ad)``).

source: Conversion flags (optional), which affect the result of some conversion types.
tr: Bazı dönüşüm türlerinin sonucunu etkileyen dönüşüm işaretleri (isteğe bağlı).

source: Minimum field width (optional). If specified as an ``'*'`` (asterisk), the actual width is read from the next element of the tuple in *values*, and the object to convert comes after the minimum field width and optional precision.
tr: Minimum alan genişliği (isteğe bağlı). Bir ``'*'`` (yıldız işareti) olarak belirtilirse, gerçek genişlik *değerler* içindeki demetin bir sonraki öğesinden okunur ve dönüştürülecek nesne, minimum alan genişliğinden ve isteğe bağlı hassasiyetten sonra gelir.

source: Precision (optional), given as a ``'.'`` (dot) followed by the precision. If specified as ``'*'`` (an asterisk), the actual precision is read from the next element of the tuple in *values*, and the value to convert comes after the precision.
tr: Hassasiyet (isteğe bağlı), ``'.'`` (nokta) ve ardından hassasiyet olarak verilir. ``'*'`` (yıldız işareti) olarak belirtilirse, gerçek duyarlık *values* içindeki demetin bir sonraki öğesinden okunur ve dönüştürülecek değer duyarlıktan sonra gelir.

source: Length modifier (optional).
tr: Uzunluk değiştirici (isteğe bağlı).

source: Conversion type.
tr: Dönüşüm türü.

source: When the right argument is a dictionary (or other mapping type), then the formats in the string *must* include a parenthesised mapping key into that dictionary inserted immediately after the ``'%'`` character. The mapping key selects the value to be formatted from the mapping. For example:
tr: Doğru argüman bir sözlük (veya başka bir eşleme türü) olduğunda, dizedeki formatlar *zorunludur*, o sözlüğe ``'%'`` karakterinden hemen sonra eklenen parantez içinde bir eşleme anahtarı içermelidir. Eşleme anahtarı, eşlemeden biçimlendirilecek değeri seçer. Örneğin:

source: In this case no ``*`` specifiers may occur in a format (since they require a sequential parameter list).
tr: Bu durumda bir formatta hiçbir ``*`` belirtici bulunamaz (sıralı bir parametre listesi gerektirdiklerinden).

source: The conversion flag characters are:
tr: Dönüşüm bayrağı karakterleri şunlardır:

source: Flag
tr: Bayrak

source: The value conversion will use the "alternate form" (where defined below).
tr: Değer dönüşümü "alternatif formu" (aşağıda tanımlandığı yerde) kullanacaktır.

source: The conversion will be zero padded for numeric values.
tr: Dönüşüm sayısal değerler için sıfır dolgulu olacaktır.

source: The converted value is left adjusted (overrides the ``'0'`` conversion if both are given).
tr: Dönüştürülen değer ayarlanmış olarak bırakılır (her ikisi de verilmişse ``'0'`` dönüşümünü geçersiz kılar).

source: (a space) A blank should be left before a positive number (or empty string) produced by a signed conversion.
tr: (boşluk) İmzalı bir dönüştürme tarafından üretilen bir pozitif sayıdan (veya boş dizeden) önce bir boşluk bırakılmalıdır.

source: A sign character (``'+'`` or ``'-'``) will precede the conversion (overrides a "space" flag).
tr: Dönüşümden önce bir işaret karakteri ("''+''' veya "'-'``) gelir ("boşluk" işaretini geçersiz kılar).

source: A length modifier (``h``, ``l``, or ``L``) may be present, but is ignored as it is not necessary for Python -- so e.g. ``%ld`` is identical to ``%d``.
tr: Bir uzunluk değiştirici ("h", "l" veya "L") mevcut olabilir, ancak Python için gerekli olmadığı için göz ardı edilir -- yani örn. ``%ld``, ``%d`` ile aynıdır.

source: The conversion types are:
tr: Dönüşüm türleri şunlardır:

source: Conversion
tr: Dönüşüm

source: Signed integer decimal.
tr: İşaretli tamsayı ondalık.

source: Signed octal value.
tr: İşaretli sekizlik değer.

source: Obsolete type -- it is identical to ``'d'``.
tr: Eski tip -- ``'d'`` ile aynıdır.

source: Signed hexadecimal (lowercase).
tr: İmzalı onaltılık (küçük harf).

source: Signed hexadecimal (uppercase).
tr: İmzalı onaltılık (büyük harf).

source: Floating point exponential format (lowercase).
tr: Kayan noktalı üstel biçim (küçük harf).

source: Floating point exponential format (uppercase).
tr: Kayan noktalı üstel biçim (büyük harf).

source: Floating point decimal format.
tr: Kayan noktalı ondalık biçim.

source: Floating point format. Uses lowercase exponential format if exponent is less than -4 or not less than precision, decimal format otherwise.
tr: Kayan nokta biçimi. Üs -4'ten küçükse veya kesinlikten az değilse küçük üstel biçimi, aksi takdirde ondalık biçimi kullanır.

source: Floating point format. Uses uppercase exponential format if exponent is less than -4 or not less than precision, decimal format otherwise.
tr: Kayan nokta biçimi. Üs -4'ten küçükse veya hassasiyetten az değilse büyük harfli üstel formatı, aksi takdirde ondalık formatı kullanır.

source: Single character (accepts integer or single character string).
tr: Tek karakter (tamsayı veya tek karakter dizesini kabul eder).

source: String (converts any Python object using :func:`repr`).
tr: String ( :func:`repr` kullanarak herhangi bir Python nesnesini dönüştürür).

source: String (converts any Python object using :func:`str`).
tr: String ( :func:`str` kullanarak herhangi bir Python nesnesini dönüştürür).

source: String (converts any Python object using :func:`ascii`).
tr: String ( :func:`ascii` kullanarak herhangi bir Python nesnesini dönüştürür).

source: No argument is converted, results in a ``'%'`` character in the result.
tr: Hiçbir bağımsız değişken dönüştürülmez, sonuçta ``'%'`` karakteri oluşur.

source: The alternate form causes a leading octal specifier (``'0o'``) to be inserted before the first digit.
tr: Alternatif form, ilk rakamdan önce önde gelen bir sekizli belirtecin (``'0o'``) eklenmesine neden olur.

source: The alternate form causes a leading ``'0x'`` or ``'0X'`` (depending on whether the ``'x'`` or ``'X'`` format was used) to be inserted before the first digit.
tr: Alternatif form, ilk rakamdan önce önde gelen bir ``'0x'`` veya ``'0X'`` (``'x'`` veya ``'X'`` formatının kullanılmasına bağlı olarak) eklenmesine neden olur.

source: The alternate form causes the result to always contain a decimal point, even if no digits follow it.
tr: Alternatif form, ardından hiçbir rakam gelmese bile sonucun her zaman bir ondalık nokta içermesine neden olur.

source: The precision determines the number of digits after the decimal point and defaults to 6.
tr: Hassasiyet, ondalık noktadan sonraki basamak sayısını belirler ve varsayılan olarak 6'dır.

source: The alternate form causes the result to always contain a decimal point, and trailing zeroes are not removed as they would otherwise be.
tr: Alternatif form, sonucun her zaman ondalık nokta içermesine neden olur ve sondaki sıfırlar normalde olduğu gibi kaldırılmaz.

source: The precision determines the number of significant digits before and after the decimal point and defaults to 6.
tr: Hassasiyet, ondalık noktadan önceki ve sonraki anlamlı basamak sayısını belirler ve varsayılan olarak 6'dır.

source: If precision is ``N``, the output is truncated to ``N`` characters.
tr: Hassasiyet ``N`` ise, çıktı ``N`` karaktere kadar kesilir.

source: See :pep:`237`.
tr: Bkz :pep:`237`.

source: Since Python strings have an explicit length, ``%s`` conversions do not assume that ``'\0'`` is the end of the string.
tr: Python karakter dizilerinin açık bir uzunluğu olduğundan, ``%s`` dönüşümleri ``'\0'`` karakter dizisinin sonu olduğunu varsaymaz.

source: ``%f`` conversions for numbers whose absolute value is over 1e50 are no longer replaced by ``%g`` conversions.
tr: Mutlak değeri 1e50'nin üzerinde olan sayılar için ``%f`` dönüşümlerinin yerini artık ``%g`` dönüşümleri almıyor.

source: Binary Sequence Types --- :class:`bytes`, :class:`bytearray`, :class:`memoryview`
tr: İkili Dizi Türleri --- :class:`bytes`, :class:`bytearray`, :class:`memoryview`

source: The core built-in types for manipulating binary data are :class:`bytes` and :class:`bytearray`. They are supported by :class:`memoryview` which uses the :ref:`buffer protocol <bufferobjects>` to access the memory of other binary objects without needing to make a copy.
tr: İkili verileri işlemek için temel yerleşik türler :class:`bytes` ve :class:`bytearray`dir. Bir kopya oluşturmaya gerek kalmadan diğer ikili nesnelerin belleğine erişmek için :ref:`buffer protokolünü <bufferobjects>` kullanan :class:`memoryview` tarafından desteklenirler.

source: The :mod:`array` module supports efficient storage of basic data types like 32-bit integers and IEEE754 double-precision floating values.
tr: :mod:`array` modülü, 32 bitlik tamsayılar ve IEEE754 çift duyarlıklı kayan değerler gibi temel veri türlerinin verimli bir şekilde depolanmasını destekler.

source: Bytes Objects
tr: Bayt Nesneleri

source: Bytes objects are immutable sequences of single bytes. Since many major binary protocols are based on the ASCII text encoding, bytes objects offer several methods that are only valid when working with ASCII compatible data and are closely related to string objects in a variety of other ways.
tr: Bayt nesneleri, değişmez tek bayt dizileridir. Birçok büyük ikili protokol, ASCII metin kodlamasına dayandığından, bayt nesneleri, yalnızca ASCII uyumlu verilerle çalışırken geçerli olan ve çeşitli şekillerde dize nesneleriyle yakından ilişkili olan birkaç yöntem sunar.

source: Firstly, the syntax for bytes literals is largely the same as that for string literals, except that a ``b`` prefix is added:
tr: İlk olarak, bayt hazır değerlerinin sözdizimi, bir "b" önekinin eklenmesi dışında, dize değişmezleriyle büyük ölçüde aynıdır:

source: Single quotes: ``b'still allows embedded "double" quotes'``
tr: Tek tırnak: ``b'hala gömülü "çift" tırnaklara izin verir'''

source: Double quotes: ``b"still allows embedded 'single' quotes"``
tr: Çift tırnak: ``b"gömülü 'tek' tırnak işaretlerine hâlâ izin veriyor"``

source: Triple quoted: ``b'''3 single quotes'''``, ``b"""3 double quotes"""``
tr: Üçlü alıntı: ``b'''3 tek tırnak'''``, ``b"""3 çift tırnak"""``

source: Only ASCII characters are permitted in bytes literals (regardless of the declared source code encoding). Any binary values over 127 must be entered into bytes literals using the appropriate escape sequence.
tr: Bayt hazır bilgilerinde yalnızca ASCII karakterlerine izin verilir (bildirilen kaynak kodu kodlamasından bağımsız olarak). 127'nin üzerindeki herhangi bir ikili değer, uygun çıkış dizisi kullanılarak bayt sabit değerlerine girilmelidir.

source: As with string literals, bytes literals may also use a ``r`` prefix to disable processing of escape sequences. See :ref:`strings` for more about the various forms of bytes literal, including supported escape sequences.
tr: Dize değişmezlerinde olduğu gibi, bayt değişmezleri de kaçış dizilerinin işlenmesini devre dışı bırakmak için bir "r" öneki kullanabilir. Desteklenen çıkış dizileri de dahil olmak üzere çeşitli değişmez bayt biçimleri hakkında daha fazla bilgi için :ref:`dizeleri` konusuna bakın.

source: While bytes literals and representations are based on ASCII text, bytes objects actually behave like immutable sequences of integers, with each value in the sequence restricted such that ``0 <= x < 256`` (attempts to violate this restriction will trigger :exc:`ValueError`). This is done deliberately to emphasise that while many binary formats include ASCII based elements and can be usefully manipulated with some text-oriented algorithms, this is not generally the case for arbitrary binary data (blindly applying text processing algorithms to binary data formats that are not ASCII compatible will usually lead to data corruption).
tr: Bayt sabit değerleri ve gösterimleri ASCII metnine dayalı olsa da, bayt nesneleri aslında değişmez tamsayı dizileri gibi davranır ve dizideki her değer "0 <= x < 256" şeklinde kısıtlanır (bu kısıtlamayı ihlal etme girişimleri :exc tetikler) :`DeğerHatası`). Bu, birçok ikili formatın ASCII tabanlı öğeler içermesine ve bazı metin yönelimli algoritmalarla yararlı bir şekilde manipüle edilebilmesine rağmen, bunun genellikle rastgele ikili veriler için geçerli olmadığını (metin işleme algoritmalarını, metin işleme algoritmalarını, otomatik olmayan ikili veri biçimlerine körü körüne uygulamak) vurgulamak için kasıtlı olarak yapılır. ASCII uyumluluğu genellikle veri bozulmasına yol açar).

source: In addition to the literal forms, bytes objects can be created in a number of other ways:
tr: Değişmez biçimlere ek olarak, bayt nesneleri bir dizi başka yolla da oluşturulabilir:

source: A zero-filled bytes object of a specified length: ``bytes(10)``
tr: Belirtilen uzunlukta sıfır doldurulmuş bayt nesnesi: ``bytes(10)``

source: From an iterable of integers: ``bytes(range(20))``
tr: Yinelenen tamsayılardan: ``bytes(range(20))``

source: Copying existing binary data via the buffer protocol: ``bytes(obj)``
tr: Mevcut ikili verileri arabellek protokolü aracılığıyla kopyalama: ``bytes(obj)``

source: Also see the :ref:`bytes <func-bytes>` built-in.
tr: Ayrıca :ref:`bytes <func-bytes>` yerleşikine bakın.

source: Since 2 hexadecimal digits correspond precisely to a single byte, hexadecimal numbers are a commonly used format for describing binary data. Accordingly, the bytes type has an additional class method to read data in that format:
tr: 2 onaltılık basamak tam olarak tek bir bayta karşılık geldiğinden, onaltılık sayılar ikili verileri açıklamak için yaygın olarak kullanılan bir biçimdir. Buna göre, bayt türü, verileri bu biçimde okumak için ek bir sınıf yöntemine sahiptir:

source: This :class:`bytes` class method returns a bytes object, decoding the given string object. The string must contain two hexadecimal digits per byte, with ASCII whitespace being ignored.
tr: Bu :class:`bytes` sınıf yöntemi, verilen dize nesnesinin kodunu çözerek bir bayt nesnesi döndürür. Dize, bayt başına iki onaltılık basamak içermelidir ve ASCII boşluk yok sayılır.

source: :meth:`bytes.fromhex` now skips all ASCII whitespace in the string, not just spaces.
tr: :meth:`bytes.fromhex` artık dizgedeki tüm ASCII boşluklarını atlıyor, sadece boşlukları değil.

source: A reverse conversion function exists to transform a bytes object into its hexadecimal representation.
tr: Bir bayt nesnesini onaltılık gösterimine dönüştürmek için bir ters dönüştürme işlevi vardır.

source: Return a string object containing two hexadecimal digits for each byte in the instance.
tr: Örnekteki her bayt için iki onaltılık basamak içeren bir dize nesnesi döndürün.

source: If you want to make the hex string easier to read, you can specify a single character separator *sep* parameter to include in the output. By default, this separator will be included between each byte. A second optional *bytes_per_sep* parameter controls the spacing. Positive values calculate the separator position from the right, negative values from the left.
tr: Onaltılı dizenin daha kolay okunmasını istiyorsanız, çıktıya dahil edilecek tek karakter ayırıcı *sep* parametresini belirtebilirsiniz. Varsayılan olarak, bu ayırıcı her bayt arasına dahil edilecektir. İkinci bir isteğe bağlı *bytes_per_sep* parametresi, aralığı kontrol eder. Pozitif değerler ayırıcı konumunu sağdan, negatif değerler soldan hesaplar.
