Repository: python/python-docs-tr
Catalog: library/stdtypes.po
Languages: tr

source: Return a copy of the sequence with specified trailing bytes removed. The *chars* argument is a binary sequence specifying the set of byte values to be removed - the name refers to the fact this method is usually used with ASCII characters. If omitted or ``None``, the *chars* argument defaults to removing ASCII whitespace. The *chars* argument is not a suffix; rather, all combinations of its values are stripped::
tr: Belirtilen sondaki baytlar kaldırılmış olarak dizinin bir kopyasını döndürün. *chars* bağımsız değişkeni, kaldırılacak bayt değerleri kümesini belirten ikili bir dizidir - ad, bu yöntemin genellikle ASCII karakterleriyle kullanıldığı gerçeğini ifade eder. Atlanırsa veya "Yok" ise, *karakterler* bağımsız değişkeni varsayılan olarak ASCII boşluklarını kaldırır. *chars* bağımsız değişkeni bir sonek değildir; bunun yerine, değerlerinin tüm kombinasyonları çıkarılır:

source: The binary sequence of byte values to remove may be any :term:`bytes-like object`. See :meth:`~bytes.removesuffix` for a method that will remove a single suffix string rather than all of a set of characters. For example::
tr: Kaldırılacak bayt değerlerinin ikili dizisi, herhangi bir :term:`bayt benzeri nesne' olabilir. Tüm karakter kümesi yerine tek bir sonek dizesini kaldıracak bir yöntem için :meth:`~bytes.removesuffix` konusuna bakın. Örneğin::

source: Split the binary sequence into subsequences of the same type, using *sep* as the delimiter string. If *maxsplit* is given and non-negative, at most *maxsplit* splits are done (thus, the list will have at most ``maxsplit+1`` elements). If *maxsplit* is not specified or is ``-1``, then there is no limit on the number of splits (all possible splits are made).
tr: Ayırıcı dize olarak *sep* kullanarak ikili diziyi aynı türden alt dizilere bölün. *maxsplit* verilirse ve negatif değilse, en fazla *maxsplit* bölme yapılır (böylece listede en fazla ``maxsplit+1`` öğe bulunur). *maxsplit* belirtilmezse veya ``-1`` ise, bölme sayısında bir sınır yoktur (tüm olası bölmeler yapılır).

source: If *sep* is given, consecutive delimiters are not grouped together and are deemed to delimit empty subsequences (for example, ``b'1,,2'.split(b',')`` returns ``[b'1', b'', b'2']``). The *sep* argument may consist of a multibyte sequence (for example, ``b'1<>2<>3'.split(b'<>')`` returns ``[b'1', b'2', b'3']``). Splitting an empty sequence with a specified separator returns ``[b'']`` or ``[bytearray(b'')]`` depending on the type of object being split. The *sep* argument may be any :term:`bytes-like object`.
tr: *böl* verilirse, ardışık sınırlayıcılar birlikte gruplandırılmaz ve boş alt dizileri sınırladıkları kabul edilir (örneğin, ``b'1,,2'.split(b',')``, ``[b'1' değerini döndürür. ', b'', b'2']``). *sep* bağımsız değişkeni çok baytlı bir diziden oluşabilir (örneğin, ``b'1<>2<>3'.split(b'<>')``, ``[b'1', b'2'yi döndürür ', b'3']``). Boş bir diziyi belirli bir ayırıcıyla bölmek, bölünen nesnenin türüne bağlı olarak ``[b'']`` veya ``[bytearray(b'')]`` döndürür. *sep* argümanı herhangi bir :term:`bayt benzeri nesne` olabilir.

source: If *sep* is not specified or is ``None``, a different splitting algorithm is applied: runs of consecutive ASCII whitespace are regarded as a single separator, and the result will contain no empty strings at the start or end if the sequence has leading or trailing whitespace. Consequently, splitting an empty sequence or a sequence consisting solely of ASCII whitespace without a specified separator returns ``[]``.
tr: *bölme* belirtilmezse veya "Yok" ise, farklı bir bölme algoritması uygulanır: ardışık ASCII boşluk çalıştırmaları, tek bir ayırıcı olarak kabul edilir ve sonuç, dizi uygunsa, başında veya sonunda boş dizeler içermez. başında veya sonunda boşluk var. Sonuç olarak, boş bir diziyi veya yalnızca ASCII boşluklarından oluşan bir diziyi belirli bir ayırıcı olmadan bölmek "[]" değerini döndürür.

source: Return a copy of the sequence with specified leading and trailing bytes removed. The *chars* argument is a binary sequence specifying the set of byte values to be removed - the name refers to the fact this method is usually used with ASCII characters. If omitted or ``None``, the *chars* argument defaults to removing ASCII whitespace. The *chars* argument is not a prefix or suffix; rather, all combinations of its values are stripped::
tr: Belirtilen baştaki ve sondaki baytlar çıkarılmış olarak dizinin bir gidişatı döndürün. *karakterler* bağımsız değişkeni, kaldırılacak bayt değerleri kümesini kitaplar ikili bir dizidir - ad, bu yöntemin genellikle ASCII karakterleriyle kullanılan gerçeğini ifade eder. Atlanırsa veya "Yok" ise, *karakterler* bağımsız değişkeni genel olarak ASCII boşluklarını kaldırır. *chars* bağımsız değişkeni bir önek veya sonek değildir; bunun yerine, değerlerinin tüm kombinasyonları kaldırılır:

source: The binary sequence of byte values to remove may be any :term:`bytes-like object`.
tr: Kaldırılacak bayt değerlerinin ikili dizisi, herhangi bir :term:`bayt benzeri nesne' olabilir.

source: The following methods on bytes and bytearray objects assume the use of ASCII compatible binary formats and should not be applied to arbitrary binary data. Note that all of the bytearray methods in this section do *not* operate in place, and instead produce new objects.
tr: Baytlar ve bayt dizisi nesneleri üzerindeki aşağıdaki yöntemler, ASCII uyumlu ikili biçimlerin kullanıldığını varsayar ve rastgele ikili verilere uygulanmamalıdır. Bu bölümdeki tüm bytearray yöntemlerinin yerinde *çalışmadığını* ve bunun yerine yeni nesneler ürettiğini unutmayın.

source: Return a copy of the sequence with each byte interpreted as an ASCII character, and the first byte capitalized and the rest lowercased. Non-ASCII byte values are passed through unchanged.
tr: Her bayt bir ASCII karakteri olarak yorumlanmış ve ilk bayt büyük ve geri kalanı küçük harfli olarak dizinin bir kopyasını döndürün. ASCII olmayan bayt değerleri değiştirilmeden geçirilir.

source: Return a copy of the sequence where all ASCII tab characters are replaced by one or more ASCII spaces, depending on the current column and the given tab size. Tab positions occur every *tabsize* bytes (default is 8, giving tab positions at columns 0, 8, 16 and so on). To expand the sequence, the current column is set to zero and the sequence is examined byte by byte. If the byte is an ASCII tab character (``b'\t'``), one or more space characters are inserted in the result until the current column is equal to the next tab position. (The tab character itself is not copied.) If the current byte is an ASCII newline (``b'\n'``) or carriage return (``b'\r'``), it is copied and the current column is reset to zero. Any other byte value is copied unchanged and the current column is incremented by one regardless of how the byte value is represented when printed::
tr: Geçerli sütuna ve verilen sekme boyutuna bağlı olarak, tüm ASCII sekme karakterlerinin bir veya daha fazla ASCII boşluğuyla değiştirildiği dizinin bir kopyasını döndürün. Sekme konumları her *tabsize* baytta bir gerçekleşir (varsayılan 8'dir, 0, 8, 16 sütunlarında sekme konumları verir, vb.). Sırayı genişletmek için mevcut sütun sıfıra ayarlanır ve sıra bayt bayt incelenir. Bayt bir ASCII sekme karakteriyse (``b'\t'``), geçerli sütun bir sonraki sekme konumuna eşit olana kadar sonuca bir veya daha fazla boşluk karakteri eklenir. (Sekme karakterinin kendisi kopyalanmaz.) Geçerli bayt bir ASCII yeni satır ("b'\n''") veya satırbaşı ("b'\r''") ise, kopyalanır ve geçerli bayt sütun sıfırlanır. Diğer tüm bayt değerleri değiştirilmeden kopyalanır ve geçerli sütun, yazdırıldığında bayt değerinin nasıl temsil edildiğine bakılmaksızın bir artırılır::

source: Return ``True`` if all bytes in the sequence are alphabetical ASCII characters or ASCII decimal digits and the sequence is not empty, ``False`` otherwise. Alphabetic ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'``. ASCII decimal digits are those byte values in the sequence ``b'0123456789'``.
tr: Dizideki tüm baytlar alfabetik ASCII karakterleri veya ASCII ondalık basamaklardan oluşuyorsa ve dizi boş değilse "True", aksi takdirde "False" döndürün. Alfabetik ASCII karakterleri, ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'` dizisindeki bayt değerleridir. ASCII ondalık basamakları, ``b'0123456789'` dizisindeki bayt değerleridir.

source: Return ``True`` if all bytes in the sequence are alphabetic ASCII characters and the sequence is not empty, ``False`` otherwise. Alphabetic ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'``.
tr: Dizideki tüm baytlar alfabetik ASCII karakterleriyse ve dizi boş değilse "True", aksi takdirde "False" döndürün. Alfabetik ASCII karakterleri, ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'` dizisindeki bayt değerleridir.

source: Return ``True`` if the sequence is empty or all bytes in the sequence are ASCII, ``False`` otherwise. ASCII bytes are in the range 0-0x7F.
tr: Dizi boşsa veya dizideki tüm baytlar ASCII ise "True", aksi takdirde "False" döndürün. ASCII baytları 0-0x7F aralığındadır.

source: Return ``True`` if all bytes in the sequence are ASCII decimal digits and the sequence is not empty, ``False`` otherwise. ASCII decimal digits are those byte values in the sequence ``b'0123456789'``.
tr: Dizideki tüm baytlar ASCII ondalık basamaklardan oluşuyorsa ve dizi boş değilse "True", aksi takdirde "False" döndürün. ASCII ondalık basamakları, ``b'0123456789'` dizisindeki bayt değerleridir.

source: Return ``True`` if there is at least one lowercase ASCII character in the sequence and no uppercase ASCII characters, ``False`` otherwise.
tr: Dizide en az bir küçük ASCII karakteri varsa ve büyük ASCII karakteri yoksa "True", aksi takdirde "False" döndürün.

source: Lowercase ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyz'``. Uppercase ASCII characters are those byte values in the sequence ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``.
tr: Küçük harfli ASCII karakterleri, ``b'abcdefghijklmnopqrstuvwxyz'` dizisindeki bayt değerleridir. Büyük ASCII karakterleri, ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'` dizisindeki bayt değerleridir.

source: Return ``True`` if all bytes in the sequence are ASCII whitespace and the sequence is not empty, ``False`` otherwise. ASCII whitespace characters are those byte values in the sequence ``b' \t\n\r\x0b\f'`` (space, tab, newline, carriage return, vertical tab, form feed).
tr: Dizideki tüm baytlar ASCII boşluksa ve dizi boş değilse "True", aksi takdirde "False" döndürün. ASCII boşluk karakterleri, ``b' \t\n\r\x0b\f'`` (boşluk, sekme, yeni satır, satırbaşı, dikey sekme, form besleme) dizisindeki bayt değerleridir.

source: Return ``True`` if the sequence is ASCII titlecase and the sequence is not empty, ``False`` otherwise. See :meth:`bytes.title` for more details on the definition of "titlecase".
tr: Dizi ASCII başlık durumuysa ve dizi boş değilse "True", aksi takdirde "False" döndürün. "Başlık kasası" tanımı hakkında daha fazla ayrıntı için :meth:`bytes.title` konusuna bakın.

source: Return ``True`` if there is at least one uppercase alphabetic ASCII character in the sequence and no lowercase ASCII characters, ``False`` otherwise.
tr: Dizide en az bir büyük alfabetik ASCII karakteri varsa ve küçük ASCII karakteri yoksa "True", aksi takdirde "False" döndürün.

source: Return a copy of the sequence with all the uppercase ASCII characters converted to their corresponding lowercase counterpart.
tr: Tüm büyük ASCII karakterlerinin karşılık gelen küçük harflere dönüştürüldüğü dizinin bir kopyasını döndürün.

source: Return a list of the lines in the binary sequence, breaking at ASCII line boundaries. This method uses the :term:`universal newlines` approach to splitting lines. Line breaks are not included in the resulting list unless *keepends* is given and true.
tr: İkili dizideki satırların bir listesini ASCII satır sınırlarında kırarak döndürür. Bu yöntem, satırları bölmek için :term:`evrensel yeni satırlar` yaklaşımını kullanır. Satır sonları, *keepends* verilmedikçe ve doğru olmadıkça sonuç listesine dahil edilmez.

source: Unlike :meth:`~bytes.split` when a delimiter string *sep* is given, this method returns an empty list for the empty string, and a terminal line break does not result in an extra line::
tr: Bir sınırlayıcı dize *sep* verildiğinde :meth:`~bytes.split`ten farklı olarak, bu yöntem boş dize için boş bir liste döndürür ve uçbir satır sonu fazladan bir satırla sonuçlanmaz::

source: Return a copy of the sequence with all the lowercase ASCII characters converted to their corresponding uppercase counterpart and vice-versa.
tr: Tüm küçük ASCII karakterlerinin karşılık gelen büyük harflere dönüştürüldüğü dizinin bir kopyasını döndürün ve bunun tersi de geçerlidir.

source: Unlike :func:`str.swapcase()`, it is always the case that ``bin.swapcase().swapcase() == bin`` for the binary versions. Case conversions are symmetrical in ASCII, even though that is not generally true for arbitrary Unicode code points.
tr: :func:`str.swapcase()`den farklı olarak, ikili sürümler için her zaman ``bin.swapcase().swapcase() == bin`` durumu söz konusudur. İsteğe bağlı Unicode kod noktaları için genellikle doğru olmasa da, durum dönüştürmeleri ASCII'de simetriktir.

source: Return a titlecased version of the binary sequence where words start with an uppercase ASCII character and the remaining characters are lowercase. Uncased byte values are left unmodified.
tr: Sözcüklerin büyük ASCII karakteriyle başladığı ve geri kalan karakterlerin küçük harf olduğu ikili dizinin başlıklı bir sürümünü döndürün. Kasaya alınmamış bayt değerleri değiştirilmeden bırakılır.

source: Lowercase ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyz'``. Uppercase ASCII characters are those byte values in the sequence ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``. All other byte values are uncased.
tr: Küçük harfli ASCII karakterleri, ``b'abcdefghijklmnopqrstuvwxyz'` dizisindeki bayt değerleridir. Büyük ASCII karakterleri, ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'` dizisindeki bayt değerleridir. Diğer tüm bayt değerleri büyük/küçük harfe sahip değildir.

source: A workaround for apostrophes can be constructed using regular expressions::
tr: Kesme işaretleri için geçici bir çözüm düzenli ifadeler kullanılarak oluşturulabilir::

source: Return a copy of the sequence with all the lowercase ASCII characters converted to their corresponding uppercase counterpart.
tr: Karşılık gelen büyük harflere dönüştürülmüş tüm küçük ASCII karakterleriyle dizinin bir kopyasını döndürün.

source: Return a copy of the sequence left filled with ASCII ``b'0'`` digits to make a sequence of length *width*. A leading sign prefix (``b'+'``/ ``b'-'``) is handled by inserting the padding *after* the sign character rather than before. For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(seq)``.
tr: Uzunluk *genişlik* dizisi oluşturmak için ASCII ``b'0'`` rakamlarıyla dolu bırakılan dizinin bir kopyasını döndürün. Baş işaret öneki (``b'+'``/``b'-'``), işaret karakterinden önce değil *ardından* dolgu eklenerek işlenir. :class:`bytes` nesneleri için, *width* ``len(seq)`` değerinden küçük veya ona eşitse orijinal sıra döndürülür.

source: ``printf``-style Bytes Formatting
tr: ``printf`` tarzı Bayt Biçimlendirmesi

source: The formatting operations described here exhibit a variety of quirks that lead to a number of common errors (such as failing to display tuples and dictionaries correctly). If the value being printed may be a tuple or dictionary, wrap it in a tuple.
tr: Burada açıklanan biçimlendirme işlemleri, bir dizi yaygın hataya yol açan (demetleri ve sözlükleri doğru şekilde görüntüleyememek gibi) çeşitli tuhaflıklar sergiler. Yazdırılan değer bir demet veya sözlük olabilirse, onu bir demet içine sarın.

source: Bytes objects (``bytes``/``bytearray``) have one unique built-in operation: the ``%`` operator (modulo). This is also known as the bytes *formatting* or *interpolation* operator. Given ``format % values`` (where *format* is a bytes object), ``%`` conversion specifications in *format* are replaced with zero or more elements of *values*. The effect is similar to using the :c:func:`sprintf` in the C language.
tr: Bayt nesnelerinin ("bytes"/"bytearray") tek bir yerleşik işlemi vardır: "%" işleci (modulo). Bu, bayt *biçimlendirme* veya *interpolasyon* operatörü olarak da bilinir. Verilen ``biçim % değerleri'' (burada *format* bir bayt nesnesidir), *format* içindeki ``%`` dönüştürme belirtimleri, sıfır veya daha fazla *values* öğesiyle değiştirilir. Etki, C dilinde :c:func:`sprintf` kullanımına benzer.

source: If *format* requires a single argument, *values* may be a single non-tuple object. [5]_ Otherwise, *values* must be a tuple with exactly the number of items specified by the format bytes object, or a single mapping object (for example, a dictionary).
tr: *format* tek bir argüman gerektiriyorsa, *values* demet olmayan tek bir nesne olabilir. [5]_ Aksi takdirde, *değerler* tam olarak biçim bayt nesnesi tarafından belirtilen öğe sayısına sahip bir grup veya tek bir eşleme nesnesi (örneğin, bir sözlük) olmalıdır.

source: When the right argument is a dictionary (or other mapping type), then the formats in the bytes object *must* include a parenthesised mapping key into that dictionary inserted immediately after the ``'%'`` character. The mapping key selects the value to be formatted from the mapping. For example:
tr: Doğru bağımsız değişken bir sözlük (veya başka bir eşleme türü) olduğunda, bayt nesnesindeki biçimler sözlüğe ``'%'`` karakterinden hemen sonra eklenen parantez içinde bir eşleme anahtarı *içermelidir*. Eşleme anahtarı, eşlemeden biçimlendirilecek değeri seçer. Örneğin:

source: Single byte (accepts integer or single byte objects).
tr: Tek bayt (tamsayı veya tek bayt nesneleri kabul eder).

source: Bytes (any object that follows the :ref:`buffer protocol <bufferobjects>` or has :meth:`__bytes__`).
tr: Bayt ( :ref:`buffer protokolünü <bufferobjects>` takip eden veya :meth:`__bytes__` içeren herhangi bir nesne).

source: ``'s'`` is an alias for ``'b'`` and should only be used for Python2/3 code bases.
tr: ``'s'``, ``'b'`` için bir takma addır ve yalnızca Python2/3 kod tabanları için kullanılmalıdır.

source: Bytes (converts any Python object using ``repr(obj).encode('ascii', 'backslashreplace')``).
tr: Bayt (``repr(obj).encode('ascii', 'backslashreplace')`` kullanarak herhangi bir Python nesnesini dönüştürür).

source: ``'r'`` is an alias for ``'a'`` and should only be used for Python2/3 code bases.
tr: ``'r'``, ``'a'`` için bir takma addır ve yalnızca Python2/3 kod tabanları için kullanılmalıdır.

source: ``b'%s'`` is deprecated, but will not be removed during the 3.x series.
tr: ''b'%s'`` kullanımdan kaldırılmıştır, ancak 3.x serisi sırasında kaldırılmayacaktır.

source: ``b'%r'`` is deprecated, but will not be removed during the 3.x series.
tr: ''b'%r'`` kullanımdan kaldırılmıştır, ancak 3.x serisi sırasında kaldırılmayacaktır.

source: :pep:`461` - Adding % formatting to bytes and bytearray
tr: :pep:`461` - Baytlara ve bytearray'e % formatlama ekleme

source: Memory Views
tr: Bellek Görünümleri

source: :class:`memoryview` objects allow Python code to access the internal data of an object that supports the :ref:`buffer protocol <bufferobjects>` without copying.
tr: class:`memoryview` nesneleri Python kodunun :ref:`buffer protocol <bufferobjects>` destekleyen bir nesnenin dahili verilerine kopyalama yapmadan erişmesini sağlar.

source: Create a :class:`memoryview` that references *object*. *object* must support the buffer protocol. Built-in objects that support the buffer protocol include :class:`bytes` and :class:`bytearray`.
tr: *nesneye* başvuran bir :class:`memoryview` oluşturun. *nesne* arabellek protokolünü desteklemelidir. Tampon protokolünü destekleyen yerleşik nesneler şunları içerir:class:`bytes` ve :class:`bytearray`.

source: A :class:`memoryview` has the notion of an *element*, which is the atomic memory unit handled by the originating *object*. For many simple types such as :class:`bytes` and :class:`bytearray`, an element is a single byte, but other types such as :class:`array.array` may have bigger elements.
tr: Bir :class:`memoryview`, kaynak *nesne* tarafından yönetilen atomik bellek birimi olan bir *element* kavramına sahiptir. :class:`bytes` ve :class:`bytearray` gibi birçok basit tür için bir öğe tek bir bayttır, ancak :class:`array.array` gibi diğer türler daha büyük öğelere sahip olabilir.

source: ``len(view)`` is equal to the length of :class:`~memoryview.tolist`, which is the nested list representation of the view. If ``view.ndim = 1``, this is equal to the number of elements in the view.
tr: ``len(view)``, görünümün iç içe liste temsili olan :class:`~memoryview.tolist`in uzunluğuna eşittir. ``view.ndim = 1`` ise bu, görünümdeki öğelerin sayısına eşittir.

source: If ``view.ndim == 0``, ``len(view)`` now raises :exc:`TypeError` instead of returning 1.
tr: ``view.ndim == 0`` ise, ``len(view)`` artık 1 döndürmek yerine :exc:`TypeError` değerini yükseltir.

source: The :class:`~memoryview.itemsize` attribute will give you the number of bytes in a single element.
tr: ``len(view)`` :class:`~memoryview.tolist` uzunluğuna eşittir. Eğer ``view.ndim = 0`` ise, uzunluk 1`dir. Eğer ``view.ndim = 1`` ise, uzunluk görünümdeki eleman sayısına eşittir. Daha yüksek boyutlar için uzunluk, görünümün iç içe liste gösteriminin uzunluğuna eşittir. Class:`~memoryview.itemsize` niteliği size tek bir öğedeki bayt sayısını verecektir.

source: A :class:`memoryview` supports slicing and indexing to expose its data. One-dimensional slicing will result in a subview::
tr: Bir :class:`memoryview`, verilerini ortaya çıkarmak için dilimleme ve indekslemeyi destekler. Tek boyutlu dilimleme bir alt görünümle sonuçlanacaktır::

source: If :class:`~memoryview.format` is one of the native format specifiers from the :mod:`struct` module, indexing with an integer or a tuple of integers is also supported and returns a single *element* with the correct type. One-dimensional memoryviews can be indexed with an integer or a one-integer tuple. Multi-dimensional memoryviews can be indexed with tuples of exactly *ndim* integers where *ndim* is the number of dimensions. Zero-dimensional memoryviews can be indexed with the empty tuple.
tr: Eğer :class:`~memoryview.format`, :mod:`struct` modülündeki yerel format belirleyicilerinden biriyse, bir tamsayı veya tamsayı çiftiyle indeksleme de desteklenir ve doğru tipte tek bir *element* döndürür. Tek boyutlu bellek görünümleri bir tamsayı veya bir tamsayı çiftiyle indekslenebilir. Çok boyutlu bellek görünümleri, *ndim* boyut sayısı olmak üzere tam olarak *ndim* tamsayılarından oluşan tuple'lar ile indekslenebilir. Sıfır boyutlu bellek görünümleri boş bir tuple ile indekslenebilir.

source: Here is an example with a non-byte format::
tr: İşte bayt olmayan formatta bir örnek::

source: If the underlying object is writable, the memoryview supports one-dimensional slice assignment. Resizing is not allowed::
tr: Altta yatan nesne yazılabilirse, memoryview tek boyutlu dilim atamasını destekler. Yeniden boyutlandırmaya izin verilmez::

source: One-dimensional memoryviews of :term:`hashable` (read-only) types with formats 'B', 'b' or 'c' are also hashable. The hash is defined as ``hash(m) == hash(m.tobytes())``::
tr: 'B', 'b' veya 'c' biçimli hashlenebilir (salt okunur) türlerin tek boyutlu bellek görünümleri de hashlenebilir. Hash, ``hash(m) == hash(m.tobytes())``: şeklinde tanımlanır:
