Repository: python/python-docs-tr
Catalog: library/stdtypes.po
Languages: tr

source: While the ``in`` and ``not in`` operations are used only for simple containment testing in the general case, some specialised sequences (such as :class:`str`, :class:`bytes` and :class:`bytearray`) also use them for subsequence testing::
tr: ``in`` ve ``not in`` işlemleri, genel durumda yalnızca basit sınırlama testi için kullanılırken, bazı özel diziler (örneğin: :class:`str`, :class:`bytes` ve :class:`bytearray`) bunları sonraki dizi testi için de kullanır:

source: Values of *n* less than ``0`` are treated as ``0`` (which yields an empty sequence of the same type as *s*). Note that items in the sequence *s* are not copied; they are referenced multiple times. This often haunts new Python programmers; consider::
tr: *n* 'nin ``0`` 'dan küçük değerleri ``0`` olarak değerlendirilir (bu, *s* ile aynı türde boş bir dizi verir). *s* dizisindeki öğeler kopyalanmaz, birden çok kez referans gösterilir (kullanılır). Bu, çoğunlukla yeni Python programcılarına musallat olur; şunu düşünün::

source: What has happened is that ``[[]]`` is a one-element list containing an empty list, so all three elements of ``[[]] * 3`` are references to this single empty list. Modifying any of the elements of ``lists`` modifies this single list. You can create a list of different lists this way::
tr: Olan şu ki, ``[[]]`` boş bir liste içeren tek elemanlı bir listedir, dolayısıyla ``[[]] * 3`` 'ün üç elemanı da bu boş listeye referanstır. ``lists`` öğelerinin herhangi birinin değiştirilmesi bu listeyi değiştirir. Bu şekilde farklı listelerin bir listesini oluşturabilirsiniz::

source: Further explanation is available in the FAQ entry :ref:`faq-multidimensional-list`.
tr: Daha fazla açıklama SSS gönderisinde mevcuttur: :ref:`faq-multidimensional-list`.

source: If *i* or *j* is negative, the index is relative to the end of sequence *s*: ``len(s) + i`` or ``len(s) + j`` is substituted. But note that ``-0`` is still ``0``.
tr: *i* veya *j* negatifse, dizin *s*: dizisinin sonuna göredir: ``len(s) + i`` veya ``len(s) + j`` değiştirilir. Ancak ``-0`` 'ın hala ``0`` olduğuna dikkat edin.

source: The slice of *s* from *i* to *j* is defined as the sequence of items with index *k* such that ``i <= k < j``. If *i* or *j* is greater than ``len(s)``, use ``len(s)``. If *i* is omitted or ``None``, use ``0``. If *j* is omitted or ``None``, use ``len(s)``. If *i* is greater than or equal to *j*, the slice is empty.
tr: *s* 'nin *i* ile *j* arasındaki dilimi, ``i <= k < j`` olacak şekilde *k* indeksine sahip öğelerin dizisi olarak tanımlanır. *i* veya *j* ``len(s)`` 'den büyükse,``len(s)`` kullanın. *i* atlanırsa veya ``None`` ise, ``0`` kullanın. *j* atlanırsa veya ``None`` ise, ``len(s)`` kullanın. *i*, *j* 'den büyük veya ona eşitse, dilim boştur.

source: The slice of *s* from *i* to *j* with step *k* is defined as the sequence of items with index ``x = i + n*k`` such that ``0 <= n < (j-i)/k``. In other words, the indices are ``i``, ``i+k``, ``i+2*k``, ``i+3*k`` and so on, stopping when *j* is reached (but never including *j*). When *k* is positive, *i* and *j* are reduced to ``len(s)`` if they are greater. When *k* is negative, *i* and *j* are reduced to ``len(s) - 1`` if they are greater. If *i* or *j* are omitted or ``None``, they become "end" values (which end depends on the sign of *k*). Note, *k* cannot be zero. If *k* is ``None``, it is treated like ``1``.
tr: *k* adımıyla *s*'nin *i*'den *j*'ye dilimi, ``x = i + n*k`` indeksine sahip öğelerin dizisi olarak tanımlanır, öyle ki ``0 <= n < (j-i) )/k``. Başka bir deyişle, indeksler ``i``, ``i+k``, ``i+2*k``, ``i+3*k`` vb. olup, *j* olduğunda dururlar. ulaşıldı (ancak asla *j* dahil değil). *k* pozitif olduğunda, *i* ve *j* büyükse ``len(s)``ye indirgenir. *k* negatif olduğunda, *i* ve *j* büyükse ``len(s) - 1``e indirgenir. *i* veya *j* atlanırsa veya ``Hiçbiri``, bunlar "son" değerleri haline gelir (hangi son, *k* işaretine bağlıdır). *k*'nın sıfır olamayacağını unutmayın. *k* "Yok" ise "1" gibi değerlendirilir.

source: Concatenating immutable sequences always results in a new object. This means that building up a sequence by repeated concatenation will have a quadratic runtime cost in the total sequence length. To get a linear runtime cost, you must switch to one of the alternatives below:
tr: Değiştirilemez dizileri birleştirmek her zaman yeni bir nesneyle sonuçlanır. Bu, tekrarlanan birleştirme ile bir dizi oluşturmanın, toplam dizi uzunluğunda ikinci dereceden bir çalışma zamanı maliyetine sahip olacağı anlamına gelir. Doğrusal bir çalışma zamanı maliyeti elde etmek için aşağıdaki alternatiflerden birine geçmelisiniz:

source: if concatenating :class:`str` objects, you can build a list and use :meth:`str.join` at the end or else write to an :class:`io.StringIO` instance and retrieve its value when complete
tr: :class:`str` nesnelerini birleştiriyorsanız, bir liste oluşturabilir ve sonunda :meth:`str.join` kullanabilir veya bir :class:`io.StringIO` örneğine yazabilir ve tamamlandığında değerini alabilirsiniz

source: if concatenating :class:`bytes` objects, you can similarly use :meth:`bytes.join` or :class:`io.BytesIO`, or you can do in-place concatenation with a :class:`bytearray` object. :class:`bytearray` objects are mutable and have an efficient overallocation mechanism
tr: :class:`bytes` nesnelerini birleştiriyorsanız, benzer şekilde :meth:`bytes.join` veya :class:`io.BytesIO` kullanabilir veya bir :class:`bytearray` nesnesiyle yerinde birleştirme yapabilirsiniz. :class:`bytearray` nesneleri değiştirilebilirdir ve verimli bir aşırı tahsis mekanizmasına sahiptir

source: if concatenating :class:`tuple` objects, extend a :class:`list` instead
tr: :class:`tuple` nesneleri birleştiriyorsanız, bunun yerine bir :class:`list` öğesini genişletin

source: for other types, investigate the relevant class documentation
tr: diğer türler için ilgili sınıf dokümantasyonunu inceleyin

source: Some sequence types (such as :class:`range`) only support item sequences that follow specific patterns, and hence don't support sequence concatenation or repetition.
tr: Bazı dizi türleri (örneğin :class:`range`) yalnızca belirli kalıpları takip eden öğe dizilerini destekler ve bu nedenle dizi birleştirmeyi veya tekrarlamayı desteklemez.

source: ``index`` raises :exc:`ValueError` when *x* is not found in *s*. Not all implementations support passing the additional arguments *i* and *j*. These arguments allow efficient searching of subsections of the sequence. Passing the extra arguments is roughly equivalent to using ``s[i:j].index(x)``, only without copying any data and with the returned index being relative to the start of the sequence rather than the start of the slice.
tr: *s* içinde *x* bulunmadığında ``index`` :exc:`ValueError` hatasını verir. Tüm uygulamalar *i* ve *j* ek argümanlarının iletilmesini desteklemez. Bu argümanlar, dizinin alt bölümlerinin verimli bir şekilde aranmasını sağlar. Fazladan argümanları iletmek kabaca ``s[i:j].index(x)`` kullanmaya eş değerdir, yalnızca herhangi bir veri kopyalamadan ve döndürülen index dilimin başlangıcından ziyade dizinin başlangıcına göredir.

source: Immutable Sequence Types
tr: Değiştirilemez Dizi Tipleri

source: The only operation that immutable sequence types generally implement that is not also implemented by mutable sequence types is support for the :func:`hash` built-in.
tr: Değiştirilemez dizi türlerinin genellikle uyguladığı ve aynı zamanda değişken dizi türleri tarafından uygulanmayan tek işlem, gömülü :func:`hash` desteğidir.

source: This support allows immutable sequences, such as :class:`tuple` instances, to be used as :class:`dict` keys and stored in :class:`set` and :class:`frozenset` instances.
tr: Bu destek, :class:`tuple` örnekleri gibi değiştirilemez dizilerin :class:`dict` anahtarları olarak kullanılmasına, :class:`set` ve :class:`frozenset` örneklerinde saklanmasına izin verir.

source: Attempting to hash an immutable sequence that contains unhashable values will result in :exc:`TypeError`.
tr: Hash edilemeyen değerler içeren değişmez bir diziye hash uygulanmaya çalışılması :exc:`TypeError` ile sonuçlanacaktır.

source: Mutable Sequence Types
tr: Değiştirilebilir Dizi Tipleri

source: The operations in the following table are defined on mutable sequence types. The :class:`collections.abc.MutableSequence` ABC is provided to make it easier to correctly implement these operations on custom sequence types.
tr: Aşağıdaki tabloda yer alan işlemler değiştirilebilir dizi tiplerinde tanımlanmıştır. :class:`collections.abc.MutableSequence` ABC, bu işlemleri özel dizi türlerinde doğru şekilde uygulamayı kolaylaştırmak için sağlanmıştır.

source: In the table *s* is an instance of a mutable sequence type, *t* is any iterable object and *x* is an arbitrary object that meets any type and value restrictions imposed by *s* (for example, :class:`bytearray` only accepts integers that meet the value restriction ``0 <= x <= 255``).
tr: Tabloda *s* değiştirilebilir bir dizi türünün bir örneğidir, *t* yinelenebilir herhangi bir nesnedir ve *x*, *s* tarafından dayatılan herhangi bir tür ve değer kısıtlamasını karşılayan rastgele bir nesnedir (örneğin, :class:`bytearray` yalnızca ``0 <= x <= 255`` değer kısıtlamasını karşılayan tam sayıları kabul eder).

source: item *i* of *s* is replaced by *x*
tr: *s* 'nin *i* öğesi *x* ile değiştirilir

source: slice of *s* from *i* to *j* is replaced by the contents of the iterable *t*
tr: *s* 'nin *i* ile *j* arasındaki dilimi, yinelenebilir *t* içeriğiyle değiştirilir

source: same as ``s[i:j] = []``
tr: ``s[i:j] = []`` ile eş değerdir

source: the elements of ``s[i:j:k]`` are replaced by those of *t*
tr: ``s[i:j:k]`` 'nin öğelerinin yerini *t* öğelerininkiler alır

source: removes the elements of ``s[i:j:k]`` from the list
tr: ``s[i:j:k]`` 'nin öğelerini listeden kaldırır

source: appends *x* to the end of the sequence (same as ``s[len(s):len(s)] = [x]``)
tr: dizinin sonuna *x* ekler (``s[len(s):len(s)] = [x]`` ile eş değerdir)

source: removes all items from *s* (same as ``del s[:]``)
tr: *s* içindeki tüm öğeleri kaldırır (``del s[:]`` ile eş değerdir)

source: creates a shallow copy of *s* (same as ``s[:]``)
tr: *s*'nin sığ bir kopyasını oluşturur (``s[:]`` ile eş değerdir)

source: ``s.extend(t)`` or ``s += t``
tr: ``s.extend(t)`` veya ``s += t``

source: extends *s* with the contents of *t* (for the most part the same as ``s[len(s):len(s)] = t``)
tr: *s* 'yi *t* 'nin içeriğiyle genişletir (çoğunlukla ``s[len(s):len(s)] = t`` ile eş değerdir)

source: updates *s* with its contents repeated *n* times
tr: *n* kez tekrarlanan içeriğiyle *s* 'yi günceller

source: inserts *x* into *s* at the index given by *i* (same as ``s[i:i] = [x]``)
tr: *i* tarafından verilen dizinde *s* 'nin içine *x* ekler (``s[i:i] = [x]`` ile eş değerdir)

source: ``s.pop()`` or ``s.pop(i)``
tr: ``s.pop()`` veya ``s.pop(i)``

source: retrieves the item at *i* and also removes it from *s*
tr: *i* noktasındaki öğeyi alır ve *s* öğesinden kaldırır

source: remove the first item from *s* where ``s[i]`` is equal to *x*
tr: ``s[i]`` 'nin *x* 'e eşit olduğu *s* 'den ilk öğeyi kaldırır

source: reverses the items of *s* in place
tr: *s* 'nin öğelerini yerinde tersine çevirir

source: *t* must have the same length as the slice it is replacing.
tr: *t*, değiştirdiği dilimle aynı uzunlukta olmalıdır.

source: The optional argument *i* defaults to ``-1``, so that by default the last item is removed and returned.
tr: İsteğe bağlı *i* argümanı varsayılan olarak ``-1`` şeklindedir, böylece varsayılan olarak son öğe kaldırılır ve döndürülür.

source: :meth:`remove` raises :exc:`ValueError` when *x* is not found in *s*.
tr: *s* 'nin içinde *x* bulunmadığında :meth:`remove` işlemi :exc:`ValueError` hatasını verir.

source: The :meth:`reverse` method modifies the sequence in place for economy of space when reversing a large sequence. To remind users that it operates by side effect, it does not return the reversed sequence.
tr: :meth:`reverse` metodu, büyük bir diziyi tersine çevirirken yerden tasarruf sağlamak için diziyi yerinde değiştirir. Kullanıcılara yan etki ile çalıştığını hatırlatmak için ters diziyi döndürmez.

source: :meth:`clear` and :meth:`!copy` are included for consistency with the interfaces of mutable containers that don't support slicing operations (such as :class:`dict` and :class:`set`). :meth:`!copy` is not part of the :class:`collections.abc.MutableSequence` ABC, but most concrete mutable sequence classes provide it.
tr: :meth:`clear` ve :meth:`!copy` dilimleme işlemlerini desteklemeyen değişken kapların arayüzleriyle tutarlılık sağlamak amacıyla dahil edilmiştir (örneğin :class:`dict` ve :class:`set`). :meth:`!copy`, :class:`collections.abc.MutableSequence` ABC'nin bir parçası değildir, ancak çoğu somut değişken dizi sınıfı bunu sağlar.

source: :meth:`clear` and :meth:`!copy` methods.
tr: :meth:`clear` ve :meth:`!copy` metotları.

source: The value *n* is an integer, or an object implementing :meth:`~object.__index__`. Zero and negative values of *n* clear the sequence. Items in the sequence are not copied; they are referenced multiple times, as explained for ``s * n`` under :ref:`typesseq-common`.
tr: *n* değeri bir tam sayıdır veya :meth:`~object.__index__` uygulayan bir nesnedir. *n* 'nin sıfır ve negatif değerleri diziyi temizler. Dizideki öğeler kopyalanmaz; :ref:`typesseq-common` altında ``s * n`` için açıklandığı gibi, bunlara birden çok kez başvurulur.

source: Lists
tr: Listeler

source: Lists are mutable sequences, typically used to store collections of homogeneous items (where the precise degree of similarity will vary by application).
tr: Listeler, tipik olarak (kesin benzerlik derecesinin uygulamaya göre değişeceği) homojen öğelerin koleksiyonlarını depolamak için kullanılan değiştirilebilir dizilerdir.

source: Lists may be constructed in several ways:
tr: Listeler birkaç şekilde oluşturulabilir:

source: Using a pair of square brackets to denote the empty list: ``[]``
tr: Boş listeyi belirtmek için bir çift köşeli parantez kullanma: ``[]``

source: Using square brackets, separating items with commas: ``[a]``, ``[a, b, c]``
tr: Köşeli parantez kullanarak, öğeleri virgülle ayırarak: ``[a]``, ``[a, b, c]``

source: Using a list comprehension: ``[x for x in iterable]``
tr: Liste kavrayışını kullanma: ``[x for x in iterable]``

source: Using the type constructor: ``list()`` or ``list(iterable)``
tr: Tür oluşturucuyu kullanma: ``list()`` veya ``list(iterable)``

source: The constructor builds a list whose items are the same and in the same order as *iterable*'s items. *iterable* may be either a sequence, a container that supports iteration, or an iterator object. If *iterable* is already a list, a copy is made and returned, similar to ``iterable[:]``. For example, ``list('abc')`` returns ``['a', 'b', 'c']`` and ``list( (1, 2, 3) )`` returns ``[1, 2, 3]``. If no argument is given, the constructor creates a new empty list, ``[]``.
tr: Yapıcı, öğeleri *iterable* 'ın öğeleriyle aynı ve aynı sırada olan bir liste oluşturur. *iterable*; bir dizi, yinelemeyi destekleyen bir container veya yineleyici nesne olabilir. *iterable* zaten bir listeyse, ``iterable[:]`` 'e benzer şekilde bir kopya oluşturulur ve döndürülür. Örneğin, ``list('abc')``, ``['a', 'b', 'c']`` değerini döndürür ve ``list( (1, 2, 3) )``, ``[ 1, 2, 3]``. Argüman verilmezse, yapıcı ``[]`` yeni bir boş liste oluşturur.

source: Many other operations also produce lists, including the :func:`sorted` built-in.
tr: Gömülü :func:`sorted` dahil olmak üzere diğer birçok işlem de listeler üretir.

source: Lists implement all of the :ref:`common <typesseq-common>` and :ref:`mutable <typesseq-mutable>` sequence operations. Lists also provide the following additional method:
tr: Listeler, tüm :ref:`common <typesseq-common>` ve :ref:`mutable <typesseq-mutable>` dizi işlemlerini uygular. Listeler ayrıca aşağıdaki ek metodu da sağlar:

source: This method sorts the list in place, using only ``<`` comparisons between items. Exceptions are not suppressed - if any comparison operations fail, the entire sort operation will fail (and the list will likely be left in a partially modified state).
tr: Bu metot, öğeler arasında yalnızca ``<`` karşılaştırmalarını kullanarak listeyi yerinde sıralar. Hatalar bastırılmaz - herhangi bir karşılaştırma işlemi başarısız olursa, tüm sıralama işlemi başarısız olur (ve liste büyük olasılıkla kısmen değiştirilmiş durumda kalır).

source: :meth:`sort` accepts two arguments that can only be passed by keyword (:ref:`keyword-only arguments <keyword-only_parameter>`):
tr: :meth:`sort` yalnızca anahtar kelime tarafından iletilebilen iki argümanı kabul eder (:ref:`keyword-only arguments <keyword-only_parameter>`):

source: *key* specifies a function of one argument that is used to extract a comparison key from each list element (for example, ``key=str.lower``). The key corresponding to each item in the list is calculated once and then used for the entire sorting process. The default value of ``None`` means that list items are sorted directly without calculating a separate key value.
tr: *key*, her liste öğesinden bir karşılaştırma anahtarı çıkarmak için kullanılan bir argümanın işlevini belirtir (örneğin, ``key=str.lower``). Listedeki her bir öğeye karşılık gelen anahtar bir kez hesaplanır ve ardından tüm sıralama işlemi için kullanılır. Varsayılan değer olan ``None``, liste öğelerinin ayrı bir anahtar değeri hesaplamadan doğrudan sıralandığı anlamına gelir.

source: The :func:`functools.cmp_to_key` utility is available to convert a 2.x style *cmp* function to a *key* function.
tr: :func:`functools.cmp_to_key` yardımcı programı, 2.x stili *cmp* işlevini bir *key* işlevine dönüştürmek için kullanılabilir.

source: *reverse* is a boolean value. If set to ``True``, then the list elements are sorted as if each comparison were reversed.
tr: *reverse* bir boolean değeridir. ``True`` olarak ayarlanırsa, liste öğeleri, her karşılaştırma tersine çevrilmiş gibi sıralanır.

source: This method modifies the sequence in place for economy of space when sorting a large sequence. To remind users that it operates by side effect, it does not return the sorted sequence (use :func:`sorted` to explicitly request a new sorted list instance).
tr: Bu yöntem, büyük bir diziyi sıralarken yerden tasarruf sağlamak için diziyi yerinde değiştirir. Kullanıcılara yan etki ile çalıştığını hatırlatmak için, sıralanan diziyi döndürmez (açıkça yeni bir sıralanmış liste örneği istemek için :func:`sorted` kullanın).

source: The :meth:`sort` method is guaranteed to be stable. A sort is stable if it guarantees not to change the relative order of elements that compare equal --- this is helpful for sorting in multiple passes (for example, sort by department, then by salary grade).
tr: :meth:`sort` metodunun kararlı olduğu garanti edilir. Bir sıralama, eşit olarak karşılaştırılan öğelerin göreli sırasını değiştirmemeyi garanti ediyorsa kararlıdır --- bu, birden çok geçişte sıralama için yararlıdır (örneğin, departmana göre sıralama, ardından maaş derecesine göre).

source: For sorting examples and a brief sorting tutorial, see :ref:`sortinghowto`.
tr: Sıralama örnekleri ve kısa bir sıralama eğitimi için bkz. :ref:`sortinghowto`.

source: While a list is being sorted, the effect of attempting to mutate, or even inspect, the list is undefined. The C implementation of Python makes the list appear empty for the duration, and raises :exc:`ValueError` if it can detect that the list has been mutated during a sort.
tr: Bir liste sıralanırken, listeyi değiştirmeye ve hatta incelemeye çalışmanın etkisi tanımsızdır. Python'un C uygulaması, listenin süre boyunca boş görünmesini sağlar ve bir sıralama sırasında listenin mutasyona uğradığını algılayabilirse :exc:`ValueError` hatasını verir.

source: Tuples
tr: Demetler

source: Tuples are immutable sequences, typically used to store collections of heterogeneous data (such as the 2-tuples produced by the :func:`enumerate` built-in). Tuples are also used for cases where an immutable sequence of homogeneous data is needed (such as allowing storage in a :class:`set` or :class:`dict` instance).
tr: Tuple'lar, tipik olarak heterojen veri koleksiyonlarını depolamak için kullanılan değiştirilemez dizilerdir (örneğin, gömülü :func:`enumerate` tarafından üretilen 2 tuple). Tuple'lar, değiştirilemez bir homojen veri dizisinin gerekli olduğu durumlarda da kullanılır (bir :class:`set` veya :class:`dict` örneğinde depolamaya izin vermek gibi).

source: Tuples may be constructed in a number of ways:
tr: Tuple'lar çeşitli şekillerde oluşturulabilir:

source: Using a pair of parentheses to denote the empty tuple: ``()``
tr: Boş demeti belirtmek için bir çift parantez kullanma: ``()``

source: Using a trailing comma for a singleton tuple: ``a,`` or ``(a,)``
tr: Tekli bir tuple için sonunda virgül kullanma: ``a,`` veya ``(a,)``

source: Separating items with commas: ``a, b, c`` or ``(a, b, c)``
tr: Öğeleri virgülle ayırma: ``a, b, c`` veya ``(a, b, c)``

source: Using the :func:`tuple` built-in: ``tuple()`` or ``tuple(iterable)``
tr: Gömülü :func:`tuple` kullanmak: ``tuple()`` veya ``tuple(iterable)``

source: The constructor builds a tuple whose items are the same and in the same order as *iterable*'s items. *iterable* may be either a sequence, a container that supports iteration, or an iterator object. If *iterable* is already a tuple, it is returned unchanged. For example, ``tuple('abc')`` returns ``('a', 'b', 'c')`` and ``tuple( [1, 2, 3] )`` returns ``(1, 2, 3)``. If no argument is given, the constructor creates a new empty tuple, ``()``.
tr: Yapıcı, öğeleri *iterable* öğeleriyle aynı ve aynı sırada olan bir demet oluşturur. *iterable* bir dizi, yinelemeyi destekleyen bir container veya yineleyici nesne olabilir. *iterable* zaten bir tuple ise, değiştirilmeden döndürülür. Örneğin, ``tuple('abc')``, ``('a', 'b', 'c')`` 'yi ve ``tuple( [1, 2, 3] )``, ``(1, 2, 3)`` 'yi döndürür. Herhangi bir argüman verilmezse, yapıcı yeni bir boş demet oluşturur ``()``.

source: Note that it is actually the comma which makes a tuple, not the parentheses. The parentheses are optional, except in the empty tuple case, or when they are needed to avoid syntactic ambiguity. For example, ``f(a, b, c)`` is a function call with three arguments, while ``f((a, b, c))`` is a function call with a 3-tuple as the sole argument.
tr: Bir demeti oluşturanın aslında parantez değil virgül olduğuna dikkat edin. Boş demet durumunda veya söz dizimsel belirsizliği önlemek için gerektiğinde parantezler isteğe bağlıdır. Örneğin, ``f(a, b, c)`` üç argümanlı bir fonksiyon çağrısı iken ``f((a, b, c))``, tek argüman olarak 3'lü bir tuple içeren bir fonksiyon çağrısıdır.

source: Tuples implement all of the :ref:`common <typesseq-common>` sequence operations.
tr: Tuple'lar, tüm :ref:`common <typesseq-common>` dizi işlemlerini uygular.

source: For heterogeneous collections of data where access by name is clearer than access by index, :func:`collections.namedtuple` may be a more appropriate choice than a simple tuple object.
tr: Ada göre erişimin dizine göre erişimden daha net olduğu heterojen veri koleksiyonları için, :func:`collections.namedtuple` basit bir tuple nesnesinden daha uygun bir seçim olabilir.

source: Ranges
tr: Aralıklar

source: The :class:`range` type represents an immutable sequence of numbers and is commonly used for looping a specific number of times in :keyword:`for` loops.
tr: :class:`range` türü, değiştirilemez bir sayı dizisini temsil eder ve genellikle :keyword:`for` döngülerinde belirli sayıda döngü yapmak için kullanılır.
