Repository: python/python-docs-tr
Catalog: library/stdtypes.po
Languages: tr

source: The arguments to the range constructor must be integers (either built-in :class:`int` or any object that implements the :meth:`~object.__index__` special method). If the *step* argument is omitted, it defaults to ``1``. If the *start* argument is omitted, it defaults to ``0``. If *step* is zero, :exc:`ValueError` is raised.
tr: Aralık oluşturucunun argümanları tamsayı olmalıdır (gömülü :class:`int` veya :meth:`~object.__index__` özel metodunu uygulayan herhangi bir nesne). *step* argümanı atlanırsa, varsayılan olarak ``1`` olur. *start* argümanı atlanırsa, varsayılan olarak ``0`` olur. *step* sıfırsa, :exc:`ValueError` hatası ortaya çıkar.

source: For a positive *step*, the contents of a range ``r`` are determined by the formula ``r[i] = start + step*i`` where ``i >= 0`` and ``r[i] < stop``.
tr: Pozitif *step* için, ``r`` aralığının içeriği, ``i >= 0`` ve ``r[i] < stop`` olmak üzere ``r[i] = start + step*i`` formülüyle belirlenir.

source: For a negative *step*, the contents of the range are still determined by the formula ``r[i] = start + step*i``, but the constraints are ``i >= 0`` and ``r[i] > stop``.
tr: Negatif bir *step* için, aralığın içeriği hala ``r[i] = start + step*i`` formülüyle belirlenir, ancak kısıtlamalar ``i >= 0`` ve ``r[i] > stop`` 'dir.

source: A range object will be empty if ``r[0]`` does not meet the value constraint. Ranges do support negative indices, but these are interpreted as indexing from the end of the sequence determined by the positive indices.
tr: Bir aralık nesnesi ``r[0]`` değer kısıtlamasını karşılamıyorsa, boş olacaktır. Aralıklar negatif indeksleri destekler, ancak bunlar pozitif indeksler tarafından belirlenen dizinin sonundan indeksleme olarak yorumlanır.

source: Ranges containing absolute values larger than :data:`sys.maxsize` are permitted but some features (such as :func:`len`) may raise :exc:`OverflowError`.
tr: :data:`sys.maxsize` 'dan büyük mutlak değerler içeren aralıklara izin verilir, ancak bazı özellikler (:func:`len` gibi), :exc:`OverflowError` hatasınının ortaya çıkmasını sağlayabilir.

source: Range examples::
tr: Aralık örnekleri::

source: Ranges implement all of the :ref:`common <typesseq-common>` sequence operations except concatenation and repetition (due to the fact that range objects can only represent sequences that follow a strict pattern and repetition and concatenation will usually violate that pattern).
tr: Aralıklar, birleştirme ve tekrar dışında tüm :ref:`common <typesseq-common>` dizi işlemlerini uygular (aralık nesnelerinin yalnızca katı bir kalıp izleyen dizileri temsil edebilmesi ve tekrarlama ve birleştirmenin genellikle bu kalıbı ihlal etmesi nedeniyle).

source: The value of the *start* parameter (or ``0`` if the parameter was not supplied)
tr: *start* parametresinin değeri (veya parametre sağlanmadıysa ``0``)

source: The value of the *stop* parameter
tr: *stop* parametresinin değeri

source: The value of the *step* parameter (or ``1`` if the parameter was not supplied)
tr: *step* parametresinin değeri (veya parametre sağlanmadıysa ``1``)

source: The advantage of the :class:`range` type over a regular :class:`list` or :class:`tuple` is that a :class:`range` object will always take the same (small) amount of memory, no matter the size of the range it represents (as it only stores the ``start``, ``stop`` and ``step`` values, calculating individual items and subranges as needed).
tr: :class:`range` türünün normal bir :class:`list` veya :class:`tuple` üzerindeki avantajı, bir :class:`range` nesnesinin temsil ettiği aralığın boyutu ne olursa olsun her zaman aynı (küçük) miktarda bellek almasıdır (yalnızca ``start``, ``stop`` ve ``step`` değerlerini sakladığı için, tek tek öğeleri ve alt aralıkları gerektiği gibi hesaplar).

source: Range objects implement the :class:`collections.abc.Sequence` ABC, and provide features such as containment tests, element index lookup, slicing and support for negative indices (see :ref:`typesseq`):
tr: Aralık (range) nesneleri :class:`collections.abc.Sequence` ABC'sini uygular ve sınırlama testleri, eleman indeksi araması, dilimleme ve negatif indeksler için destek gibi özellikler sağlar (bkz. :ref:`typesseq`):

source: Testing range objects for equality with ``==`` and ``!=`` compares them as sequences. That is, two range objects are considered equal if they represent the same sequence of values. (Note that two range objects that compare equal might have different :attr:`~range.start`, :attr:`~range.stop` and :attr:`~range.step` attributes, for example ``range(0) == range(2, 1, 3)`` or ``range(0, 3, 2) == range(0, 4, 2)``.)
tr: Aralık nesnelerini ``==`` ve ``!=`` ile eşitlik açısından test etmek, bunları diziler olarak karşılaştırır. Yani, aynı değer dizisini temsil ediyorlarsa, iki aralık nesnesi eşit kabul edilir. (Eşit karşılaştıran iki aralık nesnesinin farklı :attr:`~range.start`, :attr:`~range.stop` ve :attr:`~range.step` niteliklerine sahip olabileceğini unutmayın, örneğin ``range(0) == range(2, 1, 3)`` veya ``range(0, 3, 2) == range(0, 4, 2)``.)

source: Implement the Sequence ABC. Support slicing and negative indices. Test :class:`int` objects for membership in constant time instead of iterating through all items.
tr: Dizi ABC'sini uygular, Dilimleme ve negatif indekslemeyi destekler, Tüm öğeleri yinelemek yerine sabit zamanda üyelik için :class:`int` nesnelerini test eder.

source: Define '==' and '!=' to compare range objects based on the sequence of values they define (instead of comparing based on object identity).
tr: Aralık nesnelerini tanımladıkları değer sırasına göre karşılaştırmak için '==' ve '!=' tanımlayın (nesne kimliğine göre karşılaştırmak yerine).

source: The :attr:`~range.start`, :attr:`~range.stop` and :attr:`~range.step` attributes.
tr: :attr:`~range.start`, :attr:`~range.stop` ve :attr:`~range.step` özellikleri.

source: The `linspace recipe <https://code.activestate.com/recipes/579000/>`_ shows how to implement a lazy version of range suitable for floating point applications.
tr: `Linspace tarifi <http://code.activestate.com/recipes/579000/>`_ , kayan nokta uygulamaları için uygun olan tembel bir aralığın nasıl uygulanacağını gösterir.

source: Text Sequence Type --- :class:`str`
tr: Metin Sırası Türü --- :class:`str`

source: Textual data in Python is handled with :class:`str` objects, or :dfn:`strings`. Strings are immutable :ref:`sequences <typesseq>` of Unicode code points. String literals are written in a variety of ways:
tr: Python'da metinsel veriler :class:`str` nesneleri veya :dfn:`strings` ile işlenir. Dizeler, Unicode kod noktalarının değişmez :ref:`dizgeleridir <typesseq>`. Dize değişmezleri çeşitli şekillerde yazılır:

source: Single quotes: ``'allows embedded "double" quotes'``
tr: Tek tırnak: ``'katıştırılmış "çift" tırnaklara izin verir'``

source: Double quotes: ``"allows embedded 'single' quotes"``
tr: Çift tırnak: ``"katıştırılmış 'tek' tırnaklara izin verir"``

source: Triple quoted: ``'''Three single quotes'''``, ``"""Three double quotes"""``
tr: Üçlü tırnak: ``'''Üç tek tırnak'''``, ``"""Üç çift tırnak"""``

source: Triple quoted strings may span multiple lines - all associated whitespace will be included in the string literal.
tr: Üçlü tırnak içine alınmış dizeler birden çok satıra yayılabilir - ilişkili tüm boşluklar dize değişmezine dahil edilecektir.

source: String literals that are part of a single expression and have only whitespace between them will be implicitly converted to a single string literal. That is, ``("spam " "eggs") == "spam eggs"``.
tr: Tek bir ifadenin parçası olan ve aralarında yalnızca boşluk bulunan dize değişmezleri, örtük olarak tek bir dize değişmezine dönüştürülür. Yani, ``("spam" "yumurtalar") == "spam yumurtalar"``.

source: See :ref:`strings` for more about the various forms of string literal, including supported escape sequences, and the ``r`` ("raw") prefix that disables most escape sequence processing.
tr: Desteklenen kaçış dizileri ve çoğu kaçış dizisi işlemeyi devre dışı bırakan ``r`` ("raw", Türkçesiyle "ham") ön eki dahil olmak üzere dize değişmezinin çeşitli biçimleri hakkında daha fazla bilgi için bkz. :ref:`strings`.

source: Strings may also be created from other objects using the :class:`str` constructor.
tr: Dizeler, :class:`str` yapıcısı kullanılarak diğer nesnelerden de oluşturulabilir.

source: Since there is no separate "character" type, indexing a string produces strings of length 1. That is, for a non-empty string *s*, ``s[0] == s[0:1]``.
tr: Ayrı bir "karakter" türü olmadığından, bir dizenin indekslenmesi 1 uzunluğunda dizeler üretir. Yani, boş olmayan bir *s* dizesi için ``s[0] == s[0:1]``.

source: There is also no mutable string type, but :meth:`str.join` or :class:`io.StringIO` can be used to efficiently construct strings from multiple fragments.
tr: Değiştirilebilir bir dize türü de yoktur, ancak :meth:`str.join` veya :class:`io.StringIO` birden çok parçadan dizeleri verimli bir şekilde oluşturmak için kullanılabilir.

source: For backwards compatibility with the Python 2 series, the ``u`` prefix is once again permitted on string literals. It has no effect on the meaning of string literals and cannot be combined with the ``r`` prefix.
tr: Python 2 serisiyle geriye dönük uyumluluk için, dize değişmezlerinde ``u`` ön ekine izin verilir. Bunun dize değişmezlerinin anlamı üzerinde hiçbir etkisi yoktur ve ``r`` ön ekiyle birleştirilemez.

source: Return a :ref:`string <textseq>` version of *object*. If *object* is not provided, returns the empty string. Otherwise, the behavior of ``str()`` depends on whether *encoding* or *errors* is given, as follows.
tr: *nesne* 'nin :ref:`string <textseq>` sürümünü döndürür. *nesne* sağlanmazsa boş dizeyi döndürür. Aksi takdirde, ``str()`` davranışı, aşağıdaki gibi *kodlama* veya *hatalar* 'ın verilmesine bağlıdır.

source: If neither *encoding* nor *errors* is given, ``str(object)`` returns :meth:`type(object).__str__(object) <object.__str__>`, which is the "informal" or nicely printable string representation of *object*. For string objects, this is the string itself. If *object* does not have a :meth:`~object.__str__` method, then :func:`str` falls back to returning :func:`repr(object) <repr>`.
tr: Ne *encoding* ne de *errors* verilmezse, ``str(object)`` :meth:`type(object).__str__(object) <object.__str__>` değerini döndürür, bu da "gayri resmi" veya güzel bir şekilde yazdırılabilir *nesnenin* dize temsili. Dize nesneleri için bu, dizenin kendisidir. *object*'in :meth:`~object.__str__` yöntemi yoksa, :func:`str`, :func:`repr(object) <repr>` döndürmeye geri döner.

source: If at least one of *encoding* or *errors* is given, *object* should be a :term:`bytes-like object` (e.g. :class:`bytes` or :class:`bytearray`). In this case, if *object* is a :class:`bytes` (or :class:`bytearray`) object, then ``str(bytes, encoding, errors)`` is equivalent to :meth:`bytes.decode(encoding, errors) <bytes.decode>`. Otherwise, the bytes object underlying the buffer object is obtained before calling :meth:`bytes.decode`. See :ref:`binaryseq` and :ref:`bufferobjects` for information on buffer objects.
tr: *kodlama* veya *hatalar* 'dan en az biri verilirse, *nesne* bir :term:`bytes-like object` olmalıdır (ör. :class:`bytes` veya :class:`bytearray`). Bu durumda, *nesne* bir :class:`bytes` (veya :class:`bytearray`) nesnesiyse ``str(bytes, *kodlama*, *hatalar*)``, :meth:`bytes.decode(*kodlama*, *hatalar*) <bytes.decode>` 'a eş değerdir. Aksi takdirde, arabellek nesnesinin altında yatan bayt nesnesi, :meth:`bytes.decode` çağrılmadan önce elde edilir. Arabellek nesneleri hakkında bilgi için bkz. :ref:`binaryseq` ve :ref:`bufferobjects`.

source: Passing a :class:`bytes` object to :func:`str` without the *encoding* or *errors* arguments falls under the first case of returning the informal string representation (see also the :option:`-b` command-line option to Python). For example::
tr: Bir :class:`bytes` nesnesini *kodlama* veya *hatalar* argümanları olmadan :func:`str` 'ye iletmek, gayriresmi dize temsilini döndürmenin ilk durumuna girer (ayrıca bkz. Python için :option:`-b` komut satırı seçeneği). Örneğin::

source: For more information on the ``str`` class and its methods, see :ref:`textseq` and the :ref:`string-methods` section below. To output formatted strings, see the :ref:`f-strings` and :ref:`formatstrings` sections. In addition, see the :ref:`stringservices` section.
tr: ``str`` sınıfı ve metotları hakkında daha fazla bilgi için aşağıdaki :ref:`textseq` ve :ref:`string-methods` bölümüne bakın. Biçimlendirilmiş dizelerin çıktısını almak için :ref:`f-strings` ve :ref:`formatstrings` bölümlerine bakın. Ayrıca, :ref:`stringservices` bölümüne de bakın.

source: String Methods
tr: String (Dize) Metotları

source: Strings implement all of the :ref:`common <typesseq-common>` sequence operations, along with the additional methods described below.
tr: Dizeler, aşağıda açıklanan ek yöntemlerle birlikte tüm :ref:`ortak <typesseq-common>` dizi işlemlerini uygular.

source: Strings also support two styles of string formatting, one providing a large degree of flexibility and customization (see :meth:`str.format`, :ref:`formatstrings` and :ref:`string-formatting`) and the other based on C ``printf`` style formatting that handles a narrower range of types and is slightly harder to use correctly, but is often faster for the cases it can handle (:ref:`old-string-formatting`).
tr: Dizeler aynı zamanda iki dize biçimlendirme stilini de destekler; biri büyük ölçüde esneklik ve özelleştirme sağlar (bkz. :meth:`str.format`, :ref:`formatstrings` ve :ref:`string-formatting`) ve diğeri Daha dar bir tür aralığını işleyen ve doğru şekilde kullanılması biraz daha zor olan, ancak işleyebileceği durumlar için genellikle daha hızlı olan C ``printf`` stili biçimlendirmesidir (:ref:`old-string-formatting`).

source: The :ref:`textservices` section of the standard library covers a number of other modules that provide various text related utilities (including regular expression support in the :mod:`re` module).
tr: Standart kütüphanenin :ref:`textservices` bölümü, metinle ilgili çeşitli yardımcı programlar sağlayan bir dizi başka modülü kapsar (:mod:`re` modülündeki normal ifade desteği dahil).

source: Return a copy of the string with its first character capitalized and the rest lowercased.
tr: İlk karakteri büyük ve geri kalanı küçük harf ile, dizenin bir kopyasını döndürür.

source: The first character is now put into titlecase rather than uppercase. This means that characters like digraphs will only have their first letter capitalized, instead of the full character.
tr: İlk karakter artık büyük harf yerine başlık harfine konulmuştur. Bu, digraflar gibi karakterlerin tam karakter yerine yalnızca ilk harflerinin büyük olacağı anlamına gelir.

source: Return a casefolded copy of the string. Casefolded strings may be used for caseless matching.
tr: Dizenin küçük harfe katlanmış bir kopyasını döndürür. Küçük harfe katlanmış dizeler, büyük/küçük harfsiz eşleştirme için kullanılabilir.

source: Casefolding is similar to lowercasing but more aggressive because it is intended to remove all case distinctions in a string. For example, the German lowercase letter ``'ß'`` is equivalent to ``"ss"``. Since it is already lowercase, :meth:`lower` would do nothing to ``'ß'``; :meth:`casefold` converts it to ``"ss"``.
tr: Büyük harf katlama, harf küçültmeye (lowercasing) benzer ancak daha agresiftir, çünkü bir dizedeki tüm büyük/küçük harf ayrımlarını kaldırmayı amaçlar. Örneğin, Almanca küçük harf ``'ß'``, ``"ss"`` ile eş değerdir. Zaten küçük harf olduğundan, :meth:`lower` ``'ß'`` için hiçbir şey yapmaz; :meth:`casefold` onu ``"ss"`` biçimine dönüştürür.

source: The casefolding algorithm is `described in section 3.13 'Default Case Folding' of the Unicode Standard <https://www.unicode.org/versions/Unicode15.0.0/ch03.pdf>`__.
tr: Kasa katlama algoritması Unicode Standardı <https://www.unicode.org/versions/Unicode15.0.0/ch03.pdf> 3.13 'Varsayılan Vaka Katlama' bölümünde açıklanmıştır.

source: Return centered in a string of length *width*. Padding is done using the specified *fillchar* (default is an ASCII space). The original string is returned if *width* is less than or equal to ``len(s)``.
tr: *width* uzunluğundaki bir dizede ortalanmış olarak döndürür. Doldurma, belirtilen *fillchar* kullanılarak yapılır (varsayılanı bir ASCII boşluğudur). *width*, ``len(s)`` değerinden küçük veya ona eşitse orijinal dize döndürülür.

source: Return the number of non-overlapping occurrences of substring *sub* in the range [*start*, *end*]. Optional arguments *start* and *end* are interpreted as in slice notation.
tr: [*start*, *end*] aralığında *sub* alt dizesinin örtüşmeyen oluşumlarının sayısını döndürür. İsteğe bağlı bağımsız değişkenler *start* ve *end*, dilim notasyonunda olduğu gibi yorumlanır.

source: If *sub* is empty, returns the number of empty strings between characters which is the length of the string plus one.
tr: Sub* boşsa, karakterler arasındaki boş dizelerin sayısını döndürür; bu sayı dizenin uzunluğu artı birdir.

source: Return the string encoded to :class:`bytes`.
tr: :class:`bytes` olarak kodlanmış dizeyi döndürün.

source: *encoding* defaults to ``'utf-8'``; see :ref:`standard-encodings` for possible values.
tr: *kodlama* varsayılan olarak ``'utf-8'`` şeklindedir; Olası değerler için :ref:`standart kodlamalar`a bakın.

source: *errors* controls how encoding errors are handled. If ``'strict'`` (the default), a :exc:`UnicodeError` exception is raised. Other possible values are ``'ignore'``, ``'replace'``, ``'xmlcharrefreplace'``, ``'backslashreplace'`` and any other name registered via :func:`codecs.register_error`. See :ref:`error-handlers` for details.
tr: *errors* kodlama hatalarının nasıl ele alınacağını kontrol eder. Eğer ``'strict'`` (varsayılan) ise, bir :exc:`UnicodeError` istisnası oluşturulur. Diğer olası değerler ``'ignore'``, ``'replace'``, ``'xmlcharrefreplace'``, ``'backslashreplace'`` ve :func:`codecs.register_error` ile kaydedilen diğer isimlerdir. Ayrıntılar için :ref:`error-handlers` bölümüne bakınız.

source: For performance reasons, the value of *errors* is not checked for validity unless an encoding error actually occurs, :ref:`devmode` is enabled or a :ref:`debug build <debug-build>` is used.
tr: Performans nedenleriyle, gerçekten bir kodlama hatası oluşmadıkça, :ref:`devmode` etkinleştirilmedikçe veya :ref:`debug build <debug-build>` kullanılmadıkça *errors* değeri geçerlilik açısından kontrol edilmez.

source: Added support for keyword arguments.
tr: Anahtar kelime argümanları için destek eklendi.

source: The value of the *errors* argument is now checked in :ref:`devmode` and in :ref:`debug mode <debug-build>`.
tr: *errors* şimdi :ref:`devmode` ve :ref:`hata ayıklama modunda <debug-build>` kontrol edilir.

source: Return ``True`` if the string ends with the specified *suffix*, otherwise return ``False``. *suffix* can also be a tuple of suffixes to look for. With optional *start*, test beginning at that position. With optional *end*, stop comparing at that position.
tr: Dize belirtilen *suffix* ile bitiyorsa ``True``, aksi takdirde ``False`` döndürür. *suffix* ayrıca aranacak bir son ek grubu da olabilir. İsteğe bağlı *start* ile, o konumdan başlayarak test edin. İsteğe bağlı *end* ile, o konumda karşılaştırmayı bırakın.

source: Return a copy of the string where all tab characters are replaced by one or more spaces, depending on the current column and the given tab size. Tab positions occur every *tabsize* characters (default is 8, giving tab positions at columns 0, 8, 16 and so on). To expand the string, the current column is set to zero and the string is examined character by character. If the character is a tab (``\t``), one or more space characters are inserted in the result until the current column is equal to the next tab position. (The tab character itself is not copied.) If the character is a newline (``\n``) or return (``\r``), it is copied and the current column is reset to zero. Any other character is copied unchanged and the current column is incremented by one regardless of how the character is represented when printed.
tr: Geçerli sütuna ve verilen tab boyutuna bağlı olarak, tüm tab karakterlerinin bir veya daha fazla boşlukla değiştirildiği dizenin bir kopyasını döndürür. Tab konumları her *tab boyutu* karakterinde oluşur (varsayılan 8'dir, 0, 8, 16 ve benzeri sütunlarda tab konumları verilir). Dizeyi genişletmek için mevcut sütun sıfıra ayarlanır ve dize karakter karakter incelenir. Karakter bir tab ise (``\t``), geçerli sütun sonraki tab konumuna eşit olana kadar sonuca bir veya daha fazla boşluk karakteri eklenir. (Tab karakterinin kendisi kopyalanmaz.) Karakter yeni satırsa (``\n``) veya dönüşse (``\r``), kopyalanır ve mevcut sütun sıfırlanır. Diğer herhangi bir karakter değiştirilmeden kopyalanır ve mevcut sütun, karakterin yazdırıldığında nasıl temsil edildiğine bakılmaksızın bir artırılır.

source: Return the lowest index in the string where substring *sub* is found within the slice ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` if *sub* is not found.
tr: *sub* alt dizesinin ``s[start:end]`` diliminde bulunduğu dizedeki en düşük dizini döndür. İsteğe bağlı argümanlar *start* ve *end*, dilim notasyonunda olduğu gibi yorumlanır. *sub* bulunamazsa ``-1`` döndürür.

source: The :meth:`~str.find` method should be used only if you need to know the position of *sub*. To check if *sub* is a substring or not, use the :keyword:`in` operator::
tr: :meth:`~str.find` metodu yalnızca *sub* öğesinin konumunu bilmeniz gerekiyorsa kullanılmalıdır. *sub* 'ın bir alt dize olup olmadığını kontrol etmek için :keyword:`in` operatörünü kullanın::

source: Perform a string formatting operation. The string on which this method is called can contain literal text or replacement fields delimited by braces ``{}``. Each replacement field contains either the numeric index of a positional argument, or the name of a keyword argument. Returns a copy of the string where each replacement field is replaced with the string value of the corresponding argument.
tr: Bir dize biçimlendirme işlemi gerçekleştirin. Bu yöntemin çağrıldığı dize, parantez ``{}`` ile sınırlandırılmış metin veya değiştirme alanları içerebilir. Her değiştirme alanı, ya bir konumsal (sırası önemli) argümanın sayısal dizinini ya da bir anahtar sözcük argmünanının adını içerir. Her değiştirme alanının, karşılık gelen argümanın dize değeriyle değiştirildiği dizenin bir kopyasını döndürür.

source: See :ref:`formatstrings` for a description of the various formatting options that can be specified in format strings.
tr: Biçim dizelerinde (f string) belirtilebilecek çeşitli biçimlendirme seçeneklerinin açıklaması için bkz. :ref:`formatstrings`.
