Repository: python/python-docs-tr
Catalog: library/stdtypes.po
Languages: tr

source: Like function objects, bound method objects support getting arbitrary attributes. However, since method attributes are actually stored on the underlying function object (``meth.__func__``), setting method attributes on bound methods is disallowed. Attempting to set an attribute on a method results in an :exc:`AttributeError` being raised. In order to set a method attribute, you need to explicitly set it on the underlying function object::
tr: Fonksiyon nesneleri gibi, bağlı metot nesneleri de keyfi nitelikler almayı destekler. Ancak, yöntem nitelikleri aslında temel işlev nesnesinde (``meth.__func__``) saklandığından, bağlı yöntemlerde yöntem niteliklerinin ayarlanmasına izin verilmez. Bir yöntem üzerinde bir öznitelik ayarlamaya çalışmak :exc:`AttributeError` ile sonuçlanır. Bir yöntem özniteliğini ayarlamak için, bunu temel işlev nesnesi üzerinde açıkça ayarlamanız gerekir::

source: See :ref:`types` for more information.
tr: Daha fazla bilgi için :ref:`types` sayfasına bakın.

source: Code Objects
tr: Kod Nesneleri

source: Code objects are used by the implementation to represent "pseudo-compiled" executable Python code such as a function body. They differ from function objects because they don't contain a reference to their global execution environment. Code objects are returned by the built-in :func:`compile` function and can be extracted from function objects through their :attr:`__code__` attribute. See also the :mod:`code` module.
tr: Kod nesneleri, uygulama tarafından bir fonksiyon gövdesi gibi "sözde derlenmiş" çalıştırılabilir Python kodunu temsil etmek için kullanılır. Fonksiyon nesnelerinden farklıdırlar çünkü global yürütme ortamlarına bir referans içermezler. Kod nesneleri yerleşik :func:`compile` işlevi tarafından döndürülür ve :attr:`__code__` niteliği aracılığıyla işlev nesnelerinden çıkarılabilir. Ayrıca :mod:`code` modülüne de bakınız.

source: Accessing ``__code__`` raises an :ref:`auditing event <auditing>` ``object.__getattr__`` with arguments ``obj`` and ``"__code__"``.
tr: ``__code__`` 'e erişmek,``obj`` ve ``"__code__"`` argümanlarıyla :ref:`denetim etkinliği <auditing>` ``object.__getattr__`` oluşturur.

source: A code object can be executed or evaluated by passing it (instead of a source string) to the :func:`exec` or :func:`eval` built-in functions.
tr: Bir kod nesnesi (kaynak dize yerine) :func:`exec` veya :func:`eval` yerleşik işlevlerine geçirilerek yürütülebilir veya değerlendirilebilir.

source: Type objects represent the various object types. An object's type is accessed by the built-in function :func:`type`. There are no special operations on types. The standard module :mod:`types` defines names for all standard built-in types.
tr: Type nesneleri çeşitli nesne türlerini temsil eder. Bir nesnenin türüne yerleşik işlev :func:`type` tarafından erişilir. Türler üzerinde özel bir işlem yoktur. Standart modül :mod:`types` tüm standart yerleşik türler için isimleri tanımlar.

source: Types are written like this: ``<class 'int'>``.
tr: Türler şu şekilde yazılır: ``<class 'int'>``.

source: The Null Object
tr: Null Nesne

source: This object is returned by functions that don't explicitly return a value. It supports no special operations. There is exactly one null object, named ``None`` (a built-in name). ``type(None)()`` produces the same singleton.
tr: Bu nesne, açıkça bir değer döndürmeyen işlevler tarafından döndürülür. Özel operasyonları desteklemez. Tam olarak ``None`` (yerleşik bir ad) adlı bir null nesne vardır. ``type(None)()`` aynı singleton'u üretir.

source: It is written as ``None``.
tr: ''Yok'' olarak yazılmıştır.

source: The Ellipsis Object
tr: Üç Nokta Nesnesi

source: This object is commonly used by slicing (see :ref:`slicings`). It supports no special operations. There is exactly one ellipsis object, named :const:`Ellipsis` (a built-in name). ``type(Ellipsis)()`` produces the :const:`Ellipsis` singleton.
tr: Bu nesne genellikle dilimleme tarafından kullanılır (bkz. :ref:`slicings`). Özel operasyonları desteklemez. Tam olarak :const:`Ellipsis` (yerleşik bir ad) adında bir elips nesnesi vardır. ``type(Ellipsis)()``, :const:`Ellipsis` singletonunu üretir.

source: It is written as ``Ellipsis`` or ``...``.
tr: ``Ellipsis`` veya ``...`` olarak yazılmıştır.

source: The NotImplemented Object
tr: NotImplemented Nesnesi

source: This object is returned from comparisons and binary operations when they are asked to operate on types they don't support. See :ref:`comparisons` for more information. There is exactly one ``NotImplemented`` object. ``type(NotImplemented)()`` produces the singleton instance.
tr: Bu nesne, desteklemedikleri türlerde çalışmaları istendiğinde karşılaştırmalardan ve ikili işlemlerden döndürülür. Daha fazla bilgi için :ref:`comparisons` sayfasına bakın. Tam olarak bir ``NotImplemented`` nesnesi vardır. ``type(NotImplemented)()``, singleton örneğini üretir.

source: It is written as ``NotImplemented``.
tr: ''NotImplemented'' olarak yazılmıştır.

source: Internal Objects
tr: İç Nesneler

source: See :ref:`types` for this information. It describes stack frame objects, traceback objects, and slice objects.
tr: Bu bilgi için :ref:`types` sayfasına bakın. Yığın çerçeve nesnelerini, geri izleme nesnelerini ve dilim nesnelerini açıklar.

source: Special Attributes
tr: Özel Özellikler

source: The implementation adds a few special read-only attributes to several object types, where they are relevant. Some of these are not reported by the :func:`dir` built-in function.
tr: Uygulama, ilgili oldukları çeşitli nesne türlerine birkaç özel salt okunur öznitelik ekler. Bunlardan bazıları :func:`dir` yerleşik işlevi tarafından bildirilmez.

source: A dictionary or other mapping object used to store an object's (writable) attributes.
tr: Bir nesnenin (yazılabilir) özniteliklerini depolamak için kullanılan sözlük veya başka bir eşleme nesnesi.

source: The class to which a class instance belongs.
tr: Bir sınıf örneğinin ait olduğu sınıf.

source: The tuple of base classes of a class object.
tr: Bir sınıf elemanının temel sınıflarının kümesi.

source: The name of the class, function, method, descriptor, or generator instance.
tr: Sınıf, fonksiyon, yöntem, tanımlayıcı veya üretici örneğinin adı.

source: The :term:`qualified name` of the class, function, method, descriptor, or generator instance.
tr: Sınıf, fonksiyon, yöntem, tanımlayıcı veya üretici örneğinin :term:`qualified name`.

source: The :ref:`type parameters <type-params>` of generic classes, functions, and :ref:`type aliases <type-aliases>`.
tr: Genel sınıfların, işlevlerin ve :ref:`tip takma adları <tip-takma adlar>`ın :ref:`tip parametreleri <tip-params>`.

source: This attribute is a tuple of classes that are considered when looking for base classes during method resolution.
tr: Bu öznitelik, yöntem çözümlemesi sırasında temel sınıfları ararken dikkate alınan bir sınıf kümesidir.

source: This method can be overridden by a metaclass to customize the method resolution order for its instances. It is called at class instantiation, and its result is stored in :attr:`~class.__mro__`.
tr: Bu yöntem, örneklerinin yöntem çözümleme sırasını özelleştirmek için bir meta sınıf tarafından geçersiz kılınabilir. Sınıf örneğinde çağrılır ve sonucu :attr:`~class.__mro__` içinde depolanır.

source: Each class keeps a list of weak references to its immediate subclasses. This method returns a list of all those references still alive. The list is in definition order. Example::
tr: Her sınıf, kendi alt sınıflarına yapılan zayıf referansların bir listesini tutar. Bu yöntem, hala var olan tüm bu başvuruların bir listesini döndürür. Liste tanım sırasına göredir. Örnek::

source: Integer string conversion length limitation
tr: Tamsayı dizisi dönüştürme uzunluğu sınırlaması

source: CPython has a global limit for converting between :class:`int` and :class:`str` to mitigate denial of service attacks. This limit *only* applies to decimal or other non-power-of-two number bases. Hexadecimal, octal, and binary conversions are unlimited. The limit can be configured.
tr: CPython, hizmet reddi saldırılarını azaltmak için :class:`int` ve :class:`str` arasında dönüştürme için genel bir sınıra sahiptir. Bu sınır *yalnızca* ondalık veya ikinin katı olmayan diğer sayı tabanları için geçerlidir. Onaltılık, sekizlik ve ikili dönüştürmeler sınırsızdır. Sınır yapılandırılabilir.

source: The :class:`int` type in CPython is an arbitrary length number stored in binary form (commonly known as a "bignum"). There exists no algorithm that can convert a string to a binary integer or a binary integer to a string in linear time, *unless* the base is a power of 2. Even the best known algorithms for base 10 have sub-quadratic complexity. Converting a large value such as ``int('1' * 500_000)`` can take over a second on a fast CPU.
tr: CPython'daki :class:`int` türü, ikili biçimde (genellikle "bignum" olarak bilinir) saklanan bir abitrary uzunluklu sayıdır. Tabanı 2'nin kuvveti olmadığı sürece, bir diziyi ikili tamsayıya veya ikili tamsayıyı lineer zamanda bir diziye dönüştürebilen hiçbir algoritma yoktur. 10 tabanı için en iyi bilinen algoritmalar bile ikinci dereceden karmaşıklığa sahiptir. ``int('1' * 500_000)`` gibi büyük bir değerin dönüştürülmesi, hızlı bir CPU'da bir saniyeden fazla zaman alabilir.

source: Limiting conversion size offers a practical way to avoid `CVE-2020-10735 <https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-10735>`_.
tr: Dönüşüm boyutunu sınırlamak, `CVE-2020-10735 <https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-10735>`_ önlemek için pratik bir yol sunar.

source: The limit is applied to the number of digit characters in the input or output string when a non-linear conversion algorithm would be involved. Underscores and the sign are not counted towards the limit.
tr: Sınır, doğrusal olmayan bir dönüştürme algoritması söz konusu olduğunda giriş veya çıkış dizisindeki basamak karakterlerinin sayısına uygulanır. Alt çizgiler ve işaret, sınıra dahil edilmez.

source: When an operation would exceed the limit, a :exc:`ValueError` is raised:
tr: Bir işlem sınırı aştığında, bir :exc:`ValueError` oluşturulur:

source: The default limit is 4300 digits as provided in :data:`sys.int_info.default_max_str_digits <sys.int_info>`. The lowest limit that can be configured is 640 digits as provided in :data:`sys.int_info.str_digits_check_threshold <sys.int_info>`.
tr: Varsayılan sınır, :data:`sys.int_info.default_max_str_digits <sys.int_info>` içinde sağlanan 4300 basamaktır. Yapılandırılabilecek en düşük sınır, :data:`sys.int_info.str_digits_check_threshold <sys.int_info>` içinde sağlanan şekilde 640 basamaktır.

source: Verification:
tr: Doğrulama:

source: Affected APIs
tr: Etkilenen API'ler

source: The limitation only applies to potentially slow conversions between :class:`int` and :class:`str` or :class:`bytes`:
tr: Sınırlama yalnızca :class:`int` ve :class:`str` veya :class:`bytes` arasındaki potansiyel olarak yavaş dönüşümler için geçerlidir:

source: ``int(string)`` with default base 10.
tr: ``int(string)``, varsayılan taban 10.

source: ``int(string, base)`` for all bases that are not a power of 2.
tr: 2'nin kuvveti olmayan tüm tabanlar için "int(string, base)".

source: ``repr(integer)``.
tr: ``repr(tamsayı)``.

source: any other string conversion to base 10, for example ``f"{integer}"``, ``"{}".format(integer)``, or ``b"%d" % integer``.
tr: 10 tabanına başka herhangi bir dize dönüştürme, örneğin ``f"{integer}"``, ``"{}".format(integer)`` veya ``b"%d" % integer``.

source: The limitations do not apply to functions with a linear algorithm:
tr: Sınırlamalar, doğrusal algoritmalı işlevler için geçerli değildir:

source: ``int(string, base)`` with base 2, 4, 8, 16, or 32.
tr: 2, 4, 8, 16 veya 32 tabanlı "int(string, base)".

source: :func:`int.from_bytes` and :func:`int.to_bytes`.
tr: :func:`int.from_bytes` ve :func:`int.to_bytes`.

source: :ref:`formatspec` for hex, octal, and binary numbers.
tr: :ref:`formatspec` onaltılı, sekizli ve ikili sayılar için.

source: :class:`str` to :class:`float`.
tr: :class:`str`den :class:`float`a.

source: :class:`str` to :class:`decimal.Decimal`.
tr: :class:`str` - :class:`decimal.Decimal`.

source: Configuring the limit
tr: Limiti yapılandırma

source: Before Python starts up you can use an environment variable or an interpreter command line flag to configure the limit:
tr: Python başlamadan önce, sınırı yapılandırmak için bir ortam değişkeni veya yorumlayıcı komut satırı işareti kullanabilirsiniz:

source: :envvar:`PYTHONINTMAXSTRDIGITS`, e.g. ``PYTHONINTMAXSTRDIGITS=640 python3`` to set the limit to 640 or ``PYTHONINTMAXSTRDIGITS=0 python3`` to disable the limitation.
tr: :envvar:`PYTHONINTMAXSTRDIGITS`, örn. Sınırı 640 olarak ayarlamak için ``PYTHONINTMAXSTRDIGITS=640 python3`` veya sınırlamayı devre dışı bırakmak için ``PYTHONINTMAXSTRDIGITS=0 python3``.

source: :option:`-X int_max_str_digits <-X>`, e.g. ``python3 -X int_max_str_digits=640``
tr: :seçenek:`-X int_max_str_digits <-X>`, örn. ``python3 -X int_max_str_digits=640``

source: :data:`sys.flags.int_max_str_digits` contains the value of :envvar:`PYTHONINTMAXSTRDIGITS` or :option:`-X int_max_str_digits <-X>`. If both the env var and the ``-X`` option are set, the ``-X`` option takes precedence. A value of *-1* indicates that both were unset, thus a value of :data:`sys.int_info.default_max_str_digits` was used during initialization.
tr: :data:`sys.flags.int_max_str_digits`, :envvar:`PYTHONINTMAXSTRDIGITS` veya :option:`-X int_max_str_digits <-X>` değerini içerir. Hem env var hem de "-X" seçeneği ayarlanmışsa, "-X" seçeneği önceliklidir. *-1* değeri, her ikisinin de ayarlanmamış olduğunu gösterir, dolayısıyla başlatma sırasında :data:`sys.int_info.default_max_str_digits` değeri kullanılmıştır.

source: From code, you can inspect the current limit and set a new one using these :mod:`sys` APIs:
tr: Koddan, şu :mod:`sys` API'lerini kullanarak geçerli sınırı inceleyebilir ve yeni bir sınır belirleyebilirsiniz:

source: :func:`sys.get_int_max_str_digits` and :func:`sys.set_int_max_str_digits` are a getter and setter for the interpreter-wide limit. Subinterpreters have their own limit.
tr: :func:`sys.get_int_max_str_digits` ve :func:`sys.set_int_max_str_digits`, yorumlayıcı genelinde sınır için bir alıcı ve ayarlayıcıdır. Yardımcı tercümanların kendi limitleri vardır.

source: Information about the default and minimum can be found in :data:`sys.int_info`:
tr: Varsayılan ve minimum hakkında bilgi şu adreste bulunabilir:attr:`sys.int_info`:

source: :data:`sys.int_info.default_max_str_digits <sys.int_info>` is the compiled-in default limit.
tr: :data:`sys.int_info.default_max_str_digits <sys.int_info>` derlenmiş varsayılan sınırdır.

source: :data:`sys.int_info.str_digits_check_threshold <sys.int_info>` is the lowest accepted value for the limit (other than 0 which disables it).
tr: data:`sys.int_info.str_digits_check_threshold <sys.int_info>` sınır için kabul edilen en düşük değerdir (sınırı devre dışı bırakan 0 dışında).

source: Setting a low limit *can* lead to problems. While rare, code exists that contains integer constants in decimal in their source that exceed the minimum threshold. A consequence of setting the limit is that Python source code containing decimal integer literals longer than the limit will encounter an error during parsing, usually at startup time or import time or even at installation time - anytime an up to date ``.pyc`` does not already exist for the code. A workaround for source that contains such large constants is to convert them to ``0x`` hexadecimal form as it has no limit.
tr: Düşük bir limit ayarlamak * sorunlara yol açabilir. Nadir olmakla birlikte, kaynağında minimum eşiği aşan ondalık tamsayı sabitleri içeren kod mevcuttur. Sınırı ayarlamanın bir sonucu olarak, sınırdan daha uzun ondalık tamsayı sabit değerleri içeren Python kaynak kodu, ayrıştırma sırasında, genellikle başlatma zamanında veya içe aktarma zamanında ve hatta kurulum zamanında - herhangi bir güncel ``.pyc`` hatasıyla karşılaşacaktır. kod için zaten mevcut değil. Bu kadar büyük sabitler içeren kaynak için geçici bir çözüm, sınırı olmadığı için onları "0x" onaltılık biçime dönüştürmektir.

source: Test your application thoroughly if you use a low limit. Ensure your tests run with the limit set early via the environment or flag so that it applies during startup and even during any installation step that may invoke Python to precompile ``.py`` sources to ``.pyc`` files.
tr: Düşük bir limit kullanıyorsanız, uygulamanızı kapsamlı bir şekilde test edin. Başlangıç ​​sırasında ve hatta ``.py`` kaynaklarını ``.pyc`` dosyalarına önceden derlemek için Python'u çağırabilecek herhangi bir kurulum adımı sırasında geçerli olması için testlerinizin ortam veya bayrak aracılığıyla erken ayarlanan sınırla çalıştığından emin olun.

source: Recommended configuration
tr: Önerilen yapılandırma

source: The default :data:`sys.int_info.default_max_str_digits` is expected to be reasonable for most applications. If your application requires a different limit, set it from your main entry point using Python version agnostic code as these APIs were added in security patch releases in versions before 3.12.
tr: Varsayılan :data:`sys.int_info.default_max_str_digits` değerinin çoğu uygulama için makul olması beklenir. Uygulamanız farklı bir sınır gerektiriyorsa, bu API'ler 3.11'den önceki sürümlerde güvenlik düzeltme eki sürümlerine eklendiğinden, Python sürüm agnostik kodunu kullanarak ana giriş noktanızdan ayarlayın.

source: Example::
tr: Örnek::

source: If you need to disable it entirely, set it to ``0``.
tr: Tamamen devre dışı bırakmanız gerekirse, "0" olarak ayarlayın.

source: Footnotes
tr: Dipnotlar

source: Additional information on these special methods may be found in the Python Reference Manual (:ref:`customization`).
tr: Bu özel yöntemler hakkında daha fazla bilgi Python Referans El Kitabında (:ref:`customization`) bulunabilir.

source: As a consequence, the list ``[1, 2]`` is considered equal to ``[1.0, 2.0]``, and similarly for tuples.
tr: Sonuç olarak, ``[1, 2]`` listesi ``[1.0, 2.0]`` ve benzer şekilde demetler için eşit kabul edilir.

source: They must have since the parser can't tell the type of the operands.
tr: Ayrıştırıcı, işlenenlerin türünü söyleyemediğinden sahip olmaları gerekir.

source: Cased characters are those with general category property being one of "Lu" (Letter, uppercase), "Ll" (Letter, lowercase), or "Lt" (Letter, titlecase).
tr: Harfli karakterler, genel kategori özelliği "Lu" (Harf, büyük), "Ll" (Harf, küçük harf) veya "Lt" (Harf, başlık) karakterlerinden biri olan karakterlerdir.

source: To format only a tuple you should therefore provide a singleton tuple whose only element is the tuple to be formatted.
tr: Bu nedenle, yalnızca bir tuple(demet) biçimlendirmek için, tek öğesi biçimlendirilecek tuple(demet) olan tek bir tuple(demet) sağlamanız gerekir.

source: built-in
tr: yerleşik

source: types
tr: türleri

source: statement
tr: ifade

source: if
tr: eğer

source: while
tr: sırasında

source: truth
tr: gerçek

source: value
tr: değer

source: operations
tr: operasyonlar

source: false
tr: yanlış

source: true
tr: doğru

source: None (Built-in object)
tr: Yok (Yerleşik nesne)

source: False (Built-in object)
tr: Yanlış (Yerleşik nesne)

source: operator
tr: operatör

source: or
tr: ya da

source: and
tr: ve

source: False
tr: Yanlış

source: True
tr: Doğru

source: not
tr: değil

source: chaining
tr: zincirleme

source: comparisons
tr: karşılaştırmalar

source: comparison
tr: karşılaştırma

source: < (less)
tr: < (daha az)

source: > (greater)
tr: > (daha büyük)

source: is
tr: dır-dir

source: is not
tr: değil

source: object
tr: kod Nesneleri

source: numeric
tr: numerik

source: objects
tr: kod Nesneleri

source: comparing
tr: karşılaştırmalar

source: __eq__() (instance method)
tr: __eq__() (örnek yöntemi)

source: __ne__() (instance method)
tr: __ne__() (örnek yöntemi)

source: __lt__() (instance method)
tr: __lt__() (örnek yöntemi)

source: __le__() (instance method)
tr: __le__() (örnek yöntemi)

source: __gt__() (instance method)
tr: __gt__() (örnek yöntemi)

source: __ge__() (instance method)
tr: __ge__() (örnek yöntemi)

source: in
tr: içinde

source: not in
tr: değil

source: integer
tr: tamsayı

source: floating point
tr: kayan nokta

source: complex number
tr: karmaşık sayı

source: language
tr: dil

source: literals
tr: değişmez harfler

source: octal
tr: sekizli

source: binary
tr: ikili

source: arithmetic
tr: aritmetik

source: built-in function
tr: yerleşik işlev

source: + (plus)
tr: +(artı)

source: unary operator
tr: tekli operatör

source: binary operator
tr: ikili operatör

source: - (minus)
tr: -(eksi)

source: * (asterisk)
tr: * (yıldız işareti)

source: / (slash)
tr: / (eğik çizgi)

source: % (percent)
tr: % (yüzde)

source: operations on
tr: üzerinde yapılan işlemler

source: conjugate() (complex number method)
tr: conjugate() (karmaşık sayı yöntemi)

source: module
tr: modül

source: math
tr: matematik

source: floor() (in module math)
tr: floor() (modül matematiğinde)

source: trunc() (in module math)
tr: trunc() (modül matematiğinde)

source: conversions
tr: dönüşümler

source: bitwise
tr: bit düzeyinde

source: shifting
tr: değişen

source: masking
tr: maskeleme

source: | (vertical bar)
tr: | (dikey çubuk)

source: ^ (caret)
tr: ^ (şapka)

source: & (ampersand)
tr: & (ve işareti)

source: values
tr: değerler

source: iterator protocol
tr: yineleyici protokolü

source: protocol
tr: protokol

source: iterator
tr: yineleyeci

source: sequence
tr: sekans

source: iteration
tr: tekrarlama

source: container
tr: konteyner

source: iteration over
tr: yineleme bitti

source: len
tr: uzunluk

source: min
tr: minimum

source: max
tr: maksimum

source: concatenation
tr: birleştirme

source: operation
tr: işlem

source: repetition
tr: tekrarlama

source: subscript
tr: alt simge

source: slice
tr: dilim

source: count() (sequence method)
tr: count() (sıra yöntemi)

source: index() (sequence method)
tr: index() (sıra yöntemi)

source: loop
tr: döngü

source: over mutable sequence
tr: aşırı değişken dizi

source: mutable sequence
tr: değişken dizi

source: loop over
tr: döngüye girmek

source: immutable
tr: değişmez

source: tuple
tr: demet

source: mutable
tr: değişken

source: list
tr: liste

source: bytearray
tr: bytearraybytearray

source: type
tr: tip

source: assignment
tr: atama

source: append() (sequence method)
tr: append() (sıra yöntemi)

source: clear() (sequence method)
tr: clear() (sıra yöntemi)

source: copy() (sequence method)
tr: copy() (sıra yöntemi)

source: extend() (sequence method)
tr: extend() (sıra yöntemi)

source: insert() (sequence method)
tr: insert() (sıra yöntemi)

source: pop() (sequence method)
tr: pop() (sıra yöntemi)

source: remove() (sequence method)
tr: kaldır() (sıra yöntemi)

source: reverse() (sequence method)
tr: ters() (sıra yöntemi)

source: range
tr: aralık

source: string
tr: dizi

source: text sequence type
tr: değiştirilebilir dizi tipleri

source: str (built-in class)
tr: str (yerleşik sınıf)

source: (see also string)
tr: (ayrıca bkz. dize)

source: buffer protocol
tr: tampon protokolü

source: methods
tr: yöntemler

source: re
tr: tekrar

source: universal newlines
tr: evrensel yeni satırlar

source: str.splitlines method
tr: str.splitlines yöntemi

source: formatting, string (%)
tr: biçimlendirme, dize (%)

source: interpolation, string (%)
tr: enterpolasyon, dize (%)

source: formatting, printf
tr: biçimlendirme, printf

source: interpolation, printf
tr: enterpolasyon, printf

source: printf-style formatting
tr: printf tarzı biçimlendirme

source: sprintf-style formatting
tr: sprintf tarzı biçimlendirme

source: () (parentheses)
tr: () (parentez)
