Repository: python/python-docs-tr
Catalog: library/stdtypes.po
Languages: tr

source: in printf-style formatting
tr: printf tarzı biçimlendirmede

source: . (dot)
tr: .(nokta)

source: space
tr: boşluk

source: binary sequence types
tr: ikili dizi türleri

source: memoryview
tr: bellek görünümü

source: array
tr: sıralamak

source: bytes.splitlines method
tr: bytes.splitlines yöntemi

source: bytearray.splitlines method
tr: bytearray.splitlines yöntemi

source: formatting
tr: biçimlendirme

source: interpolation
tr: satır tablolama

source: set
tr: ayarlamak

source: mapping
tr: haritalama

source: dictionary
tr: sözlük

source: __missing__()
tr: __eksik__()

source: context manager
tr: bağlam yöneticisi

source: context management protocol
tr: bağlam yönetimi protokolü

source: context management
tr: bağlam yönetimi

source: annotation
tr: dipnot

source: type annotation; type hint
tr: açıklama yazın; ipucu yazın

source: GenericAlias
tr: Genel Takma Ad

source: Generic
tr: Genel

source: Alias
tr: Takma ad

source: Union
tr: Birlik

source: union
tr: birlik

source: method
tr: yöntemler

source: code
tr: kod

source: code object
tr: kod Nesneleri

source: compile
tr: derlemek

source: __code__ (function object attribute)
tr: __code__ (işlev nesnesi niteliği)

source: exec
tr: yönetici

source: eval
tr: değerlendirmek

source: ellipsis literal
tr: üç nokta değişmezi
