Repository: python/python-docs-tr
Catalog: library/stdtypes.po
Languages: tr

source: Built-in Types
tr: Gömülü Türler

source: The following sections describe the standard types that are built into the interpreter.
tr: Aşağıdaki bölümlerde, yorumlayıcıda yerleşik olarak yer alan standart türler açıklanmaktadır.

source: The principal built-in types are numerics, sequences, mappings, classes, instances and exceptions.
tr: Başlıca gömülü türler sayısallar, diziler, eşleşmeler, sınıflar, örnekler ve kural dışı durumlardır.

source: Some collection classes are mutable. The methods that add, subtract, or rearrange their members in place, and don't return a specific item, never return the collection instance itself but ``None``.
tr: Bazı koleksiyon sınıfları değişebilirdir. Üyelerini yerinde ekleyen, çıkaran veya yeniden düzenleyen ve belirli bir öğe döndürmeyen metotlar, her zaman koleksiyon örneğini değil ``None`` değerini döndürür.

source: Some operations are supported by several object types; in particular, practically all objects can be compared for equality, tested for truth value, and converted to a string (with the :func:`repr` function or the slightly different :func:`str` function). The latter function is implicitly used when an object is written by the :func:`print` function.
tr: Bazı işlemler birkaç nesne türü tarafından desteklenir; özellikle, tüm nesneler eşitlik için karşılaştırılabilir, doğruluk değeri için test edilebilir ve bir dizeye dönüştürülebilir (:func:`repr` fonksiyonu veya hafif farklı olan :func:`str` fonksiyonu ile). İkinci fonksiyon, bir nesne :func:`print` ile yazdırıldığında dolaylı olarak kullanılır.

source: Truth Value Testing
tr: Doğruluk Değeri Testi

source: Any object can be tested for truth value, for use in an :keyword:`if` or :keyword:`while` condition or as operand of the Boolean operations below.
tr: Herhangi bir nesne, :keyword:`if` veya :keyword:`while` koşulunda veya aşağıdaki Boolean işlemlerinin işleneni olarak kullanımında doğruluk değeri için test edilebilir.

source: By default, an object is considered true unless its class defines either a :meth:`~object.__bool__` method that returns ``False`` or a :meth:`__len__` method that returns zero, when called with the object. [1]_ Here are most of the built-in objects considered false:
tr: Varsayılan olarak, bir nesne, sınıfı "False" döndüren bir :meth:`__bool__` metodunu veya nesneyle birlikte çağrıldığında sıfır döndüren bir :meth:`__len__` metodunu tanımlamadıkça doğru kabul edilir. [1]_ Yanlış olarak kabul edilen yerleşik nesnelerin çoğu:

source: constants defined to be false: ``None`` and ``False``
tr: false olarak tanımlanan sabitler: ``None`` ve ``False``

source: zero of any numeric type: ``0``, ``0.0``, ``0j``, ``Decimal(0)``, ``Fraction(0, 1)``
tr: herhangi bir sayısal türden sıfır: ``0``, ``0.0``, ``0j``, ``Decimal(0)``, ``Fraction(0, 1)``

source: empty sequences and collections: ``''``, ``()``, ``[]``, ``{}``, ``set()``, ``range(0)``
tr: boş diziler ve koleksiyonlar: ``''``, ``()``, ``[]``, ``{}``, ``set()``, ``range(0)``

source: Operations and built-in functions that have a Boolean result always return ``0`` or ``False`` for false and ``1`` or ``True`` for true, unless otherwise stated. (Important exception: the Boolean operations ``or`` and ``and`` always return one of their operands.)
tr: Boolean sonucu olan işlemler ve gömülü fonksiyonlar, aksi belirtilmedikçe her zaman false için "0" veya "False" ve true için "1" veya "True" döndürür. (Önemli istisna: Boolean işlemleri "or" ve "and" her zaman işlenenlerinden birini döndürür.)

source: Boolean Operations --- :keyword:`!and`, :keyword:`!or`, :keyword:`!not`
tr: Boolean İşlemleri --- :keyword:`!and`, :keyword:`!or`, :keyword:`!not`

source: These are the Boolean operations, ordered by ascending priority:
tr: Bunlar artan önceliğe göre sıralanmış Boolean işlemleridir:

source: Operation
tr: İşlem

source: Result
tr: Sonuç

source: Notes
tr: Notlar

source: if *x* is true, then *x*, else *y*
tr: *x* doğruysa, *x*, aksi halde *y*

source: if *x* is false, then *x*, else *y*
tr: *x* yanlışsa, *x*, aksi halde *y*

source: if *x* is false, then ``True``, else ``False``
tr: *x* yanlışsa, ``True``, aksi halde ``False``

source: Notes:
tr: Notlar:

source: This is a short-circuit operator, so it only evaluates the second argument if the first one is false.
tr: Bu bir kısa devre operatörüdür, bu nedenle ikinci argümanı yalnızca birincisi yanlışsa değerlendirir.

source: This is a short-circuit operator, so it only evaluates the second argument if the first one is true.
tr: Bu bir kısa devre operatörüdür, bu nedenle sadece ilki doğruysa ikinci argümanı değerlendirir.

source: ``not`` has a lower priority than non-Boolean operators, so ``not a == b`` is interpreted as ``not (a == b)``, and ``a == not b`` is a syntax error.
tr: ``not`` Boolean olmayan operatörlerden daha düşük bir önceliğe sahiptir, bu nedenle ``not a == b``, ``not (a == b)`` olarak yorumlanır bu sebeple ``a == not b`` bir söz dizimi hatasıdır.

source: Comparisons
tr: Karşılaştırmalar

source: There are eight comparison operations in Python. They all have the same priority (which is higher than that of the Boolean operations). Comparisons can be chained arbitrarily; for example, ``x < y <= z`` is equivalent to ``x < y and y <= z``, except that *y* is evaluated only once (but in both cases *z* is not evaluated at all when ``x < y`` is found to be false).
tr: Python'da sekiz karşılaştırma işlemi vardır. Hepsinin önceliği aynıdır (Boolean işlemlerinden daha önceliklidir). Karşılaştırmalar isteğe bağlı olarak zincirlenebilir; örneğin, ``x < y <= z``, ``x < y and y <= z`` ile eş değerdir, ancak *y* yalnızca bir kez değerlendirilir (ancak her iki durumda da ``x < y`` yanlış olduğu tespit edildiğinde *z* hiç değerlendirilmez).

source: This table summarizes the comparison operations:
tr: Bu tablo karşılaştırma operatörlerini özetlemektedir:

source: Meaning
tr: Anlamı

source: strictly less than
tr: kesinlikle daha az

source: less than or equal
tr: daha az veya eşit

source: strictly greater than
tr: kesinlikle daha büyük

source: greater than or equal
tr: daha büyük veya eşit

source: equal
tr: eşit

source: not equal
tr: eşit değil

source: object identity
tr: nesne kimliği

source: negated object identity
tr: olumsuz nesne kimliği

source: Objects of different types, except different numeric types, never compare equal. The ``==`` operator is always defined but for some object types (for example, class objects) is equivalent to :keyword:`is`. The ``<``, ``<=``, ``>`` and ``>=`` operators are only defined where they make sense; for example, they raise a :exc:`TypeError` exception when one of the arguments is a complex number.
tr: Farklı sayısal türler dışında, farklı türdeki nesneler hiçbir zaman eşit olarak karşılaştırılmaz. ``==`` operatörü her zaman tanımlanır, ancak bazı nesne türleri için (örneğin, sınıf nesneleri) :keyword:`is` ile eş değerdir. ``<``, ``<=``, ``>`` ve ``>=`` operatörleri yalnızca anlamlı oldukları yerde tanımlanır; örneğin, argümanlardan biri karmaşık bir sayı olduğunda bir :exc:`TypeError` hatası oluştururlar.

source: Non-identical instances of a class normally compare as non-equal unless the class defines the :meth:`~object.__eq__` method.
tr: Normalde, bir sınıfın özdeş olmayan örnekleri, sınıf :meth:`~object.__eq__` metodunu tanımlamadığı sürece eşit olmayan olarak karşılaştırılır.

source: Instances of a class cannot be ordered with respect to other instances of the same class, or other types of object, unless the class defines enough of the methods :meth:`~object.__lt__`, :meth:`~object.__le__`, :meth:`~object.__gt__`, and :meth:`~object.__ge__` (in general, :meth:`~object.__lt__` and :meth:`~object.__eq__` are sufficient, if you want the conventional meanings of the comparison operators).
tr: Bir sınıfın örnekleri, sınıf yeterli metotları tanımlamadıkça, aynı sınıfın diğer örneklerine veya diğer nesne türlerine göre sıralanamaz :meth:`~object.__lt__`, :meth:`~object.__le__` , :meth:`~object.__gt__` ve :meth:`~object.__ge__` (karşılaştırma operatörlerin geleneksel anlamlarını istiyorsanız, :meth:`~object.__lt__` ve :meth:`~object.__eq__` genellikle yeterli olacaktır).

source: The behavior of the :keyword:`is` and :keyword:`is not` operators cannot be customized; also they can be applied to any two objects and never raise an exception.
tr: :keyword:`is` ve :keyword:`is not` operatörlerinin davranışı özelleştirilemez; ayrıca herhangi iki nesneye uygulanabilirler ve asla bir hata oluşturmazlar.

source: Two more operations with the same syntactic priority, :keyword:`in` and :keyword:`not in`, are supported by types that are :term:`iterable` or implement the :meth:`__contains__` method.
tr: Aynı söz dizimsel önceliğe sahip iki işlem daha, :keyword:`in` ve :keyword:`not in`, :term:`iterable` olan veya :meth:`__contains__` metodunu uygulayan türler tarafından desteklenir.

source: Numeric Types --- :class:`int`, :class:`float`, :class:`complex`
tr: Sayısal Türler --- :class:`int`, :class:`float`, :class:`complex`

source: There are three distinct numeric types: :dfn:`integers`, :dfn:`floating point numbers`, and :dfn:`complex numbers`. In addition, Booleans are a subtype of integers. Integers have unlimited precision. Floating point numbers are usually implemented using :c:expr:`double` in C; information about the precision and internal representation of floating point numbers for the machine on which your program is running is available in :data:`sys.float_info`. Complex numbers have a real and imaginary part, which are each a floating point number. To extract these parts from a complex number *z*, use ``z.real`` and ``z.imag``. (The standard library includes the additional numeric types :mod:`fractions.Fraction`, for rationals, and :mod:`decimal.Decimal`, for floating-point numbers with user-definable precision.)
tr: Üç farklı sayısal tür vardır: :dfn:`integers`, :dfn:`floating point numbers`, ve :dfn:`complex numbers`. Ayrıca, Booleanlar tam sayıların bir alt türüdür. Tam sayıların kesinliği sınırsızdır. Gerçel sayılar genellikle C dilinde :c:expr:`double` kullanılarak uygulanır; programınızın çalıştığı makine için gerçel sayıların kesinliği ve dahili gösterimi hakkında bilgi :data:`sys.float_info` içinde mevcuttur. Karmaşık sayıların her biri bir gerçel sayı olan gerçek ve sanal birer kısımları vardır. Bu parçaları *z* karmaşık sayısından ayıklamak için ``z.real`` ve ``z.imag`` kullanın. (Standart kütüphane, rasyonel sayılar için :mod:`fractions.Fraction` ve kullanıcı tarafından tanımlanabilen hassasiyete sahip gerçel sayılar için :mod:`decimal.Decimal` ek sayısal türlerini içerir.)

source: Numbers are created by numeric literals or as the result of built-in functions and operators. Unadorned integer literals (including hex, octal and binary numbers) yield integers. Numeric literals containing a decimal point or an exponent sign yield floating point numbers. Appending ``'j'`` or ``'J'`` to a numeric literal yields an imaginary number (a complex number with a zero real part) which you can add to an integer or float to get a complex number with real and imaginary parts.
tr: Sayılar, sayısal değişmezlerle veya, gömülü fonksiyonlar ve operatörlerin sonucu olarak oluşturulur. Sade tam sayı değişmezleri (onaltılı, sekizli ve ikili sayılar dahil) tam sayıları verir. Ondalık nokta veya üs işareti içeren sayısal değişmezler, gerçel sayıları verir. Sayısal bir değişmeze ``'j'`` veya ``'J'`` eklemek, tam veya gerçel bir sayıya eklenince gerçek ve hayali kısımları olan bir karmaşık sayı ortaya çıkaran, hayali bir sayı üretir.

source: Python fully supports mixed arithmetic: when a binary arithmetic operator has operands of different numeric types, the operand with the "narrower" type is widened to that of the other, where integer is narrower than floating point, which is narrower than complex. A comparison between numbers of different types behaves as though the exact values of those numbers were being compared. [2]_
tr: Python karma aritmetiği tam olarak destekler: herhangi bir ikili aritmetik operatörü farklı sayısal türlerde işlenenlere sahip olduğunda, "dar" türe sahip işlenen, tam sayı karmaşık sayıdan daha dar olan gerçel sayıdan daha dar olduğu diğerininkine genişletilir. Farklı türlerdeki sayıların karşılaştırılması, bu sayıların tam değerleri karşılaştırılıyormuş gibi davranır. [2]_

source: The constructors :func:`int`, :func:`float`, and :func:`complex` can be used to produce numbers of a specific type.
tr: :func:`int`, :func:`float` ve :func:`complex` yapıcıları belirli bir türde sayılar üretmek için kullanılabilir.

source: All numeric types (except complex) support the following operations (for priorities of the operations, see :ref:`operator-summary`):
tr: Tüm sayısal türler (karmaşık sayılar hariç) aşağıdaki işlemleri destekler (işlemlerin öncelikleri için bkz. :ref:`operator-summary`):

source: Full documentation
tr: Tam dokümantasyon

source: sum of *x* and *y*
tr: *x* ve *y* 'nin toplamı

source: difference of *x* and *y*
tr: *x* ve *y* 'nin farkı

source: product of *x* and *y*
tr: *x* ve *y* 'nin çarpımı

source: quotient of *x* and *y*
tr: *x* 'in *y* 'ye bölümü

source: floored quotient of *x* and *y*
tr: *x* ve *y* 'nin kat bölümü

source: remainder of ``x / y``
tr: ``x / y`` işleminde kalan

source: *x* negated
tr: *x* 'in negatifi

source: *x* unchanged
tr: *x* 'in değişmemişi

source: absolute value or magnitude of *x*
tr: *x* 'in mutlak değeri

source: *x* converted to integer
tr: *x* 'in integer tam sayıya (integer) dönüştürülmüş hali

source: *x* converted to floating point
tr: *x* 'in gerçel sayıya (float) dönüştürülmüş hali

source: a complex number with real part *re*, imaginary part *im*. *im* defaults to zero.
tr: gerçek kısmı *re*, sanal kısmı *im* olan bir karmaşık sayı. *im* varsayılan olarak sıfırdır.

source: conjugate of the complex number *c*
tr: *c* karmaşık sayısının eşleniği

source: the pair ``(x // y, x % y)``
tr: ``(x // y, x % y)`` ifadesinin ikilisi

source: *x* to the power *y*
tr: *x* üzeri *y*

source: Also referred to as integer division. For operands of type :class:`int`, the result has type :class:`int`. For operands of type :class:`float`, the result has type :class:`float`. In general, the result is a whole integer, though the result's type is not necessarily :class:`int`. The result is always rounded towards minus infinity: ``1//2`` is ``0``, ``(-1)//2`` is ``-1``, ``1//(-2)`` is ``-1``, and ``(-1)//(-2)`` is ``0``.
tr: Tamsayılı bölme olarak da adlandırılır. :class:`int` türündeki işlenenler için sonuç, :class:`int` türüne sahiptir. :class:`float` tipindeki işlenenler için sonuç :class:`float` tipine sahiptir. Genel olarak sonuç bir tam sayıdır, ancak sonucun türünün mutlaka :class:`int` olması gerekmez. Sonuç her zaman eksi sonsuza yuvarlanır: ``1//2`` ``0``, ``(-1)//2`` ``-1``, ``1//(- 2)``,``-1`` ve ``(-1)//(-2)``,``0``.

source: Not for complex numbers. Instead convert to floats using :func:`abs` if appropriate.
tr: Karmaşık sayılar için değil. Bunun yerine uygunsa :func:`abs` kullanarak gerçel sayılara dönüştürün.

source: Conversion from :class:`float` to :class:`int` truncates, discarding the fractional part. See functions :func:`math.floor` and :func:`math.ceil` for alternative conversions.
tr: :class:`float`tan :class:`int`e dönüştürme kesirli kısmı atarak keser. Alternatif dönüşümler için :func:`math.floor` ve :func:`math.ceil` işlevlerine bakın.

source: float also accepts the strings "nan" and "inf" with an optional prefix "+" or "-" for Not a Number (NaN) and positive or negative infinity.
tr: float ayrıca "nan" ve "inf" dizelerini, Sayı Değil ( Not a Number -> NaN) ve pozitif veya negatif sonsuzluk için isteğe bağlı bir "+" veya "-" ön ekiyle kabul eder.

source: Python defines ``pow(0, 0)`` and ``0 ** 0`` to be ``1``, as is common for programming languages.
tr: Python, diğer programlama dillerinde de olduğu gibi ``pow(0, 0)`` = ``1`` ve ``0 ** 0`` = ``1`` şeklinde tanımlar.

source: The numeric literals accepted include the digits ``0`` to ``9`` or any Unicode equivalent (code points with the ``Nd`` property).
tr: Kabul edilen sayısal değişmezler, ``0`` ile ``9`` arasındaki rakamları veya herhangi bir Unicode eş değerini ("Nd" özelliğine sahip kod noktaları) içerir.

source: See `the Unicode Standard <https://unicode.org/Public/UNIDATA/extracted/DerivedNumericType.txt>`_ for a complete list of code points with the ``Nd`` property.
tr: ``Nd`` özelliğine sahip kod noktalarının tam listesi için ``Unicode Standardı <https://unicode.org/Public/UNIDATA/extracted/DerivedNumericType.txt>`_'ye bakın.

source: All :class:`numbers.Real` types (:class:`int` and :class:`float`) also include the following operations:
tr: Tüm :class:`numbers.Real` türleri (:class:`int` ve :class:`float`) ayrıca aşağıdaki işlemleri içerir:

source: *x* truncated to :class:`~numbers.Integral`
tr: *x* :class:`~numbers.Integral` şeklinde kısaltıldı

source: *x* rounded to *n* digits, rounding half to even. If *n* is omitted, it defaults to 0.
tr: *x* *n* haneye yuvarlanır, yarıdan çifte yuvarlanır. *n* atlanırsa, *n* varsayılan olarak 0 olur.

source: the greatest :class:`~numbers.Integral` <= *x*
tr: en büyük :class:`~numbers.Integral` <= *x*

source: the least :class:`~numbers.Integral` >= *x*
tr: en küçük :class:`~numbers.Integral` >= *x*

source: For additional numeric operations see the :mod:`math` and :mod:`cmath` modules.
tr: Ek sayısal işlemler için :mod:`math` ve :mod:`cmath` modüllerine bakın.

source: Bitwise Operations on Integer Types
tr: Tam sayı Türlerinde Bit Düzeyinde İşlemler

source: Bitwise operations only make sense for integers. The result of bitwise operations is calculated as though carried out in two's complement with an infinite number of sign bits.
tr: Bit düzeyinde işlemler yalnızca tam sayılar için anlamlıdır. Bit düzeyinde işlemlerin sonucu, sonsuz sayıda işaret biti ile ikiye tümleyende gerçekleştiriliyormuş gibi hesaplanır.

source: The priorities of the binary bitwise operations are all lower than the numeric operations and higher than the comparisons; the unary operation ``~`` has the same priority as the other unary numeric operations (``+`` and ``-``).
tr: İkili bit düzeyinde işlemlerin öncelikleri, sayısal işlemlerden daha düşük ve karşılaştırmalardan daha yüksektir; ``~`` tekli işlemidiğer tekli sayısal işlemlerle (``+`` ve ``-``) aynı önceliğe sahiptir.

source: This table lists the bitwise operations sorted in ascending priority:
tr: Bu tablo, artan önceliğe göre sıralanmış bit düzeyinde işlemleri listeler:

source: bitwise :dfn:`or` of *x* and *y*
tr: bit düzeyinde *x* :dfn:`or` *y*

source: bitwise :dfn:`exclusive or` of *x* and *y*
tr: bit düzeyinde *x* :dfn:`exclusive or` *y*

source: bitwise :dfn:`and` of *x* and *y*
tr: bit düzeyinde *x* :dfn:`and` *y*

source: *x* shifted left by *n* bits
tr: *x*, *n* bit kadar sola kaydırıldı

source: *x* shifted right by *n* bits
tr: *x*, *n* bit kadar sağa kaydırıldı

source: the bits of *x* inverted
tr: *x* 'in bitleri ters çevrildi

source: Negative shift counts are illegal and cause a :exc:`ValueError` to be raised.
tr: Negatif kaydırma sayıları geçersizdir ve :exc:`ValueError` hatasına sebep olur.

source: A left shift by *n* bits is equivalent to multiplication by ``pow(2, n)``.
tr: *n* bitlik sola kaydırma, ``pow(2, n)`` ile çarpmaya eş değerdir.

source: A right shift by *n* bits is equivalent to floor division by ``pow(2, n)``.
tr: *n* bitlik sağa kaydırma, ``pow(2, n)`` ile kat bölümü işlemine eş değerdir.

source: Performing these calculations with at least one extra sign extension bit in a finite two's complement representation (a working bit-width of ``1 + max(x.bit_length(), y.bit_length())`` or more) is sufficient to get the same result as if there were an infinite number of sign bits.
tr: Bu hesaplamaları, sonlu ikinin tümleyen temsilinde en az bir ekstra işaret uzatma biti ile yapmak ( ``1 + max(x.bit_length(), y.bit_length())`` veya daha fazla çalışan bit genişliği), sonsuz sayıda işaret biti varmış gibi aynı sonucu elde etmek için yeterlidir.

source: Additional Methods on Integer Types
tr: Integer (Tam sayı) Türlerinde Ek Metotlar

source: The int type implements the :class:`numbers.Integral` :term:`abstract base class`. In addition, it provides a few more methods:
tr: Int türü, :class:`numbers.Integral` :term:`abstract base class` 'ı uygular. Ek olarak, birkaç metot daha sağlar:

source: Return the number of bits necessary to represent an integer in binary, excluding the sign and leading zeros::
tr: İşaret ve baştaki sıfırlar hariç, ikili sistemde bir tam sayıyı (integer) temsil etmek için gereken bit sayısını döndürür::

source: More precisely, if ``x`` is nonzero, then ``x.bit_length()`` is the unique positive integer ``k`` such that ``2**(k-1) <= abs(x) < 2**k``. Equivalently, when ``abs(x)`` is small enough to have a correctly rounded logarithm, then ``k = 1 + int(log(abs(x), 2))``. If ``x`` is zero, then ``x.bit_length()`` returns ``0``.
tr: Daha doğrusu, ``x`` sıfırdan farklıysa, ``x.bit_length()``, ``2**(k-1) <= abs(x) < 2**k`` olacak şekilde benzersiz ``k`` pozitif tam sayısıdır. Aynı şekilde, ``abs(x)`` doğru olarak yuvarlatılmış bir logaritmaya sahip olacak kadar küçük olduğunda, ``k = 1 + int(log(abs(x), 2))`` olur. ``x`` sıfır ise, ``x.bit_length()``, ``0`` döndürür.

source: Equivalent to::
tr: Eşittir::

source: Return the number of ones in the binary representation of the absolute value of the integer. This is also known as the population count. Example::
tr: Tam sayının mutlak değerinin ikili gösterimindeki birlerin sayısını döndürür. Buna nüfus sayımı da denir. Örneğin::

source: Return an array of bytes representing an integer.
tr: Bir tam sayıyı temsil eden bir bayt dizisi döndürür.

source: The integer is represented using *length* bytes, and defaults to 1. An :exc:`OverflowError` is raised if the integer is not representable with the given number of bytes.
tr: Tam sayı, *length* bayt kullanılarak temsil edilir ve varsayılan olarak birdir. Tam sayı verilen bayt sayısıyla gösterilemezse :exc:`OverflowError` hatası ortaya çıkar.

source: The *byteorder* argument determines the byte order used to represent the integer, and defaults to ``"big"``. If *byteorder* is ``"big"``, the most significant byte is at the beginning of the byte array. If *byteorder* is ``"little"``, the most significant byte is at the end of the byte array.
tr: *byteorder* argümanı, tam sayıyı temsil etmek için kullanılan bayt sırasını belirler ve varsayılan olarak ``"big"`` 'dir. *byteorder* ``"big"`` ise, en önemli bayt, bayt dizisinin başındadır. *byteorder* ``"little"`` ise, en önemli bayt, bayt dizisinin sonundadır.

source: The *signed* argument determines whether two's complement is used to represent the integer. If *signed* is ``False`` and a negative integer is given, an :exc:`OverflowError` is raised. The default value for *signed* is ``False``.
tr: *signed* argümanı, tam sayıyı temsil etmek için ikinin tümleyeninin kullanılıp kullanılmayacağını belirler. *signed* ``False`` ise ve negatif bir tam sayı verilirse, bir :exc:`OverflowError` hatası ortaya çıkar. *signed* için varsayılan değer ``False`` şeklindedir.

source: The default values can be used to conveniently turn an integer into a single byte object::
tr: Varsayılan değerler, bir tamsayıyı tek baytlık bir nesneye dönüştürmek için kullanılabilir::

source: However, when using the default arguments, don't try to convert a value greater than 255 or you'll get an :exc:`OverflowError`.
tr: Ancak, varsayılan bağımsız değişkenleri kullanırken, 255'ten büyük bir değeri dönüştürmeye çalışmayın, aksi halde :exc:`OverflowError` hatasıyla karşılaşırsınız.

source: Added default argument values for ``length`` and ``byteorder``.
tr: Length`` ve ``byteorder`` için varsayılan bağımsız değişken değerleri eklendi.
