Repository: python/python-docs-tr
Catalog: library/time.po
Languages: tr

source: The following directives can be embedded in the *format* string. They are shown without the optional field width and precision specification, and are replaced by the indicated characters in the :func:`strftime` result:
tr: Aşağıdaki direktifler *format* dizesine gömülebilir. İsteğe bağlı alan genişliği ve kesinlik belirtimi olmadan gösterilirler ve :func:`strftime` sonucunda belirtilen karakterlerle değiştirilirler:

source: Directive
tr: Yönerge

source: Meaning
tr: Anlamı

source: Notes
tr: Notlar

source: Locale's abbreviated weekday name.
tr: Yerel ayarın kısaltılmış hafta içi ismi.

source: Locale's full weekday name.
tr: Yerel ayarın tam hafta içi ismi.

source: Locale's abbreviated month name.
tr: Yerel ayarın kısaltılmış ay ismi.

source: Locale's full month name.
tr: Yerel ayarın tam ay ismi.

source: Locale's appropriate date and time representation.
tr: Yerel ayarın uygun tarih ve zaman gösterimi.

source: Day of the month as a decimal number [01,31].
tr: Onluk sayı şeklinde ayın günü [01,31].

source: Hour (24-hour clock) as a decimal number [00,23].
tr: Onluk sayı şeklinde saat (24-saatlik sistem) [00,23].

source: Hour (12-hour clock) as a decimal number [01,12].
tr: Onluk sayı şeklinde saat (12-saatlik sistem) [01,12].

source: Day of the year as a decimal number [001,366].
tr: Onluk sayı şeklinde yılın günü [001,366].

source: Month as a decimal number [01,12].
tr: Onluk sayı şeklinde ay [01,12].

source: Minute as a decimal number [00,59].
tr: Onluk sayı şeklinde dakika [00,59].

source: Locale's equivalent of either AM or PM.
tr: Yerel ayarın AM veya PM'e göre karşılığı.

source: Second as a decimal number [00,61].
tr: Onluk sayı şeklinde saniye [00,61].

source: Week number of the year (Sunday as the first day of the week) as a decimal number [00,53]. All days in a new year preceding the first Sunday are considered to be in week 0.
tr: Onluk sayı şeklinde yılın (Pazar haftanın ilk günü olacak şekilde) hafta numarası [00,53]. Yeni bir yılın ilk Pazar gününden önceki tüm günleri 0. hafta olarak kabul edilir.

source: Weekday as a decimal number [0(Sunday),6].
tr: Onluk sayı şeklinde hafta içi [0(Sunday),6].

source: Week number of the year (Monday as the first day of the week) as a decimal number [00,53]. All days in a new year preceding the first Monday are considered to be in week 0.
tr: Onluk sayı şeklinde yılın (Pazartesi haftanın ilk günü olacak şekilde) hafta numarası [00,53]. Yeni bir yılın ilk Pazartesi gününden önceki tüm günleri 0. hafta olarak kabul edilir.

source: Locale's appropriate date representation.
tr: Yerel ayarın uygun tarih gösterimi.

source: Locale's appropriate time representation.
tr: Yerel ayarın uygun zaman gösterimi.

source: Year without century as a decimal number [00,99].
tr: Onluk sayı şeklinde yüzyıl olmadan yıl [00,99].

source: Year with century as a decimal number.
tr: Onluk sayı şeklinde yüzyıl ile birlikte yıl.

source: Time zone offset indicating a positive or negative time difference from UTC/GMT of the form +HHMM or -HHMM, where H represents decimal hour digits and M represents decimal minute digits [-23:59, +23:59]. [1]_
tr: +HHMM veya -HHMM biçimindeki UTC/GMT'den pozitif veya negatif bir zaman farkını gösteren saat dilimi farkı, burada H ondalık saat hanelerini ve M ondalık dakika hanelerini temsil eder [-23:59, +23:59]. [1]_

source: Time zone name (no characters if no time zone exists). Deprecated. [1]_
tr: Yerel zaman ismi (yerel zaman bulunmuyorsa karakter girmeyin). Kullanımdan kaldırıldı. [1]_

source: A literal ``'%'`` character.
tr: Gerçek bir ``'%'`` karakteri.

source: Notes:
tr: Notlar:

source: When used with the :func:`strptime` function, the ``%p`` directive only affects the output hour field if the ``%I`` directive is used to parse the hour.
tr: :func:`strptime` işleviyle kullanıldığında, ``%p`` yönergesi yalnızca, saati ayrıştırmak için ``%I`` yönergesi kullanılıyorsa, çıkış saati alanını etkiler.

source: The range really is ``0`` to ``61``; value ``60`` is valid in timestamps representing `leap seconds`_ and value ``61`` is supported for historical reasons.
tr: Aralık gerçekten de ``0``'dan ``61``'e kadardır; ``60`` değeri `leap seconds`_ 'u temsil eden zaman damgalarında geçerlidir ve ``61`` değeriyse tarihsel nedenlerden ötürü desteklenmektedir.

source: When used with the :func:`strptime` function, ``%U`` and ``%W`` are only used in calculations when the day of the week and the year are specified.
tr: ``%U`` ve ``%W`` ifadeleri, :func:`strptime` fonksiyonu ile kullanıldığında, yalnızca haftanın günü ve yıl belirtilmişse hesaplamalarda kullanılır.

source: Here is an example, a format for dates compatible with that specified in the :rfc:`2822` Internet email standard. [1]_ ::
tr: İşte bir örnek, :rfc:`2822` İnternet e-posta standardında belirtilenle uyumlu tarih biçimi. [1]_ ::

source: Additional directives may be supported on certain platforms, but only the ones listed here have a meaning standardized by ANSI C. To see the full set of format codes supported on your platform, consult the :manpage:`strftime(3)` documentation.
tr: Belirli platformlarda ek yönergeler desteklenebilir, ancak yalnızca burada listelenenlerin ANSI C tarafından standartlaştırılmış bir anlamı vardır. Platformunuzda desteklenen tüm biçim kodlarını görmek için :manpage:`strftime(3)` belgelerine bakın.

source: On some platforms, an optional field width and precision specification can immediately follow the initial ``'%'`` of a directive in the following order; this is also not portable. The field width is normally 2 except for ``%j`` where it is 3.
tr: Bazı platformlarda, isteğe bağlı bir alan genişliği ve kesinlik belirtimi, bir yönergenin ilk ``'%'`` ifadesini aşağıdaki sırayla hemen takip edebilir; bu da taşınabilir değil. Alan genişliği, 3 olduğu ``%j`` dışında normalde 2'dir.

source: Parse a string representing a time according to a format. The return value is a :class:`struct_time` as returned by :func:`gmtime` or :func:`localtime`.
tr: Bir biçime göre bir zamanı temsil eden bir dizeyi ayrıştırın. Dönüş değeri, :func:`gmtime` veya :func:`localtime` tarafından döndürülen bir :class:`struct_time` şeklindedir.

source: The *format* parameter uses the same directives as those used by :func:`strftime`; it defaults to ``"%a %b %d %H:%M:%S %Y"`` which matches the formatting returned by :func:`ctime`. If *string* cannot be parsed according to *format*, or if it has excess data after parsing, :exc:`ValueError` is raised. The default values used to fill in any missing data when more accurate values cannot be inferred are ``(1900, 1, 1, 0, 0, 0, 0, 1, -1)``. Both *string* and *format* must be strings.
tr: *format* parametresi, :func:`strftime` tarafından kullanılanlarla aynı yönergeleri kullanır; varsayılan olarak :func:`ctime` tarafından döndürülen biçimlendirmeyle eşleşen ``"%a %b %d %H:%M:%S %Y"`` şeklindedir. *string* *format*'a göre ayrıştırılamazsa veya ayrıştırma sonrasında fazla veriye sahipse :exc:`ValueError` yükseltilir. Daha doğru değerler çıkarılamadığında eksik verileri doldurmak için kullanılan varsayılan değerler ``(1900, 1, 1, 0, 0, 0, 0, 1, -1)`` şeklindedir. Hem *string* hem de *format* dize olmalıdır.

source: For example:
tr: Örnek olarak:

source: Support for the ``%Z`` directive is based on the values contained in ``tzname`` and whether ``daylight`` is true. Because of this, it is platform-specific except for recognizing UTC and GMT which are always known (and are considered to be non-daylight savings timezones).
tr: ``%Z`` yönergesi için destek, ``tzname`` içinde bulunan değerlere ve ``daylight`` ifadesinin doğru olup olmadığına bağlıdır. Bu nedenle, her zaman bilinen (ve gün ışığından yararlanma saat dilimleri olarak kabul edilen) UTC ve GMT'yi tanımak dışında platforma özgüdür.

source: Only the directives specified in the documentation are supported. Because ``strftime()`` is implemented per platform it can sometimes offer more directives than those listed. But ``strptime()`` is independent of any platform and thus does not necessarily support all directives available that are not documented as supported.
tr: Yalnızca belgelerde belirtilen yönergeler desteklenir. ``strftime()`` platform başına uygulandığından, bazen listelenenlerden daha fazla yönerge sunabilir. Ancak ``strptime()`` herhangi bir platformdan bağımsızdır ve bu nedenle desteklendiği belgelenmeyen mevcut tüm yönergeleri desteklemeyebilir.

source: The type of the time value sequence returned by :func:`gmtime`, :func:`localtime`, and :func:`strptime`. It is an object with a :term:`named tuple` interface: values can be accessed by index and by attribute name. The following values are present:
tr: :func:`gmtime`, :func:`localtime` ve :func:`strptime` tarafından döndürülen zaman değeri dizisinin türü. :term:`named tuple` arayüzüne sahip bir nesnedir: değerlere dizin ve öznitelik adıyla erişilebilir. Aşağıdaki değerler mevcuttur:

source: Index
tr: Dizin

source: Attribute
tr: Öznitelik

source: Values
tr: Değerler

source: (for example, 1993)
tr: (örnek olarak, 1993)

source: range [1, 12]
tr: [1, 12] aralığı

source: range [1, 31]
tr: [1, 31] aralığı

source: range [0, 23]
tr: [0, 23] aralığı

source: range [0, 59]
tr: [0, 59] aralığa

source: range [0, 61]; see **(2)** in :func:`strftime` description
tr: [0, 61] aralığı; :func:`strftime` içinde **(2)** açıklamasına göz atın

source: range [0, 6], Monday is 0
tr: [0, 6] aralığı, Pazartesi 0'dır

source: range [1, 366]
tr: [1, 366] aralığı

source: 0, 1 or -1; see below
tr: 0, 1 veya -1; aşağıya bakınız

source: abbreviation of timezone name
tr: saat diliminin adının kısaltması

source: offset east of UTC in seconds
tr: UTC'nin doğusundaki saniye farkı

source: Note that unlike the C structure, the month value is a range of [1, 12], not [0, 11].
tr: C yapısından farklı olarak, ay değerinin menzili [1, 12] arasındadır, [0, 11] değil.

source: In calls to :func:`mktime`, :attr:`tm_isdst` may be set to 1 when daylight savings time is in effect, and 0 when it is not. A value of -1 indicates that this is not known, and will usually result in the correct state being filled in.
tr: :func:`mktime` çağrılarında, :attr:`tm_isdst` yaz saati uygulaması etkinken 1, etkin değilken 0 olarak ayarlanabilir. -1 değeri bunun bilinmediğini gösterir ve genellikle doğru durumun doldurulmasıyla sonuçlanır.

source: When a tuple with an incorrect length is passed to a function expecting a :class:`struct_time`, or having elements of the wrong type, a :exc:`TypeError` is raised.
tr: :class:`struct_time` bekleyen bir fonksiyona yanlış uzunluğa sahip bir demet iletildiğinde, veya yanlış türde elemanlara sahip olmak, bir :exc:`TypeError` yükseltir.

source: Return the time in seconds since the epoch_ as a floating point number. The handling of `leap seconds`_ is platform dependent. On Windows and most Unix systems, the leap seconds are not counted towards the time in seconds since the epoch_. This is commonly referred to as `Unix time <https://en.wikipedia.org/wiki/Unix_time>`_.
tr: epoch_ 'dan bu yana geçen süreyi kayan noktalı bir sayı olarak saniye cinsinden döndürür. `leap seconds`_ 'ın ele alınması platforma bağlıdır. Windows'ta ve çoğu Unix sisteminde, artık saniyeler, epoch_'dan bu yana saniye cinsinden süreye dahil edilmez. Bu genellikle `Unix time <https://en.wikipedia.org/wiki/Unix_time>`_ olarak anılır.

source: Note that even though the time is always returned as a floating point number, not all systems provide time with a better precision than 1 second. While this function normally returns non-decreasing values, it can return a lower value than a previous call if the system clock has been set back between the two calls.
tr: Zamanın her zaman bir kayan noktalı sayı olarak döndürülmesine rağmen, tüm sistemlerin zamanı 1 saniyeden daha iyi kesinlikte sağlamadığını unutmayın. Bu fonksiyon normalde azalmayan değerler döndürürken, sistem saati iki çağrı arasında geri ayarlanmışsa önceki çağrıdan daha düşük bir değer döndürebilir.

source: The number returned by :func:`.time` may be converted into a more common time format (i.e. year, month, day, hour, etc...) in UTC by passing it to :func:`gmtime` function or in local time by passing it to the :func:`localtime` function. In both cases a :class:`struct_time` object is returned, from which the components of the calendar date may be accessed as attributes.
tr: :func:`.time` tarafından döndürülen sayı UTC'de :func:`gmtime` fonksiyonuna geçirerek veya yerel saatte :func:`localtime` fonksiyonuna geçirerek daha yaygın bir zaman biçimine döndürülebilir (yıl, ay, gün, saat vb. gibi). Her iki durumda da, takvim tarihinin bileşenlerine nitelikler olarak erişilebilen bir :class:`struct_time` nesnesi döndürülür.

source: Use :func:`time_ns` to avoid the precision loss caused by the :class:`float` type.
tr: :class:`float` türünden kaynaklanan kesinlik kaybından kaçınmak için :func:`time_ns` kullanınız.

source: Similar to :func:`~time.time` but returns time as an integer number of nanoseconds since the epoch_.
tr: :func:`~time.time`'ye benzer, ancak zamanı, epoch_ 'den bu yana geçen nanosaniyelerin tamsayısı olarak döndürür.

source: Return the value (in fractional seconds) of the sum of the system and user CPU time of the current thread. It does not include time elapsed during sleep. It is thread-specific by definition. The reference point of the returned value is undefined, so that only the difference between the results of two calls in the same thread is valid.
tr: Geçerli iş parçacığının sistem ve kullanıcı CPU zamanının toplamının değerini (kesirli saniye cinsinden) döndürür. Uykuda geçen süreyi dahil etmez. Tanım gereği iş parçacığı çapındadır. Döndürülen değerin referans noktası tanımsızdır, böylece sadece aynı iş parçacığındaki iki çağrının sonuçları arasındaki fark geçerlidir.

source: Use :func:`thread_time_ns` to avoid the precision loss caused by the :class:`float` type.
tr: :class:`float` türünün neden olduğu kesinlik kaybını önlemek için :func:`thread_time_ns` kullanın.

source: Unix systems supporting ``CLOCK_THREAD_CPUTIME_ID``.
tr: Unix sistemler ``CLOCK_THREAD_CPUTIME_ID`` destekliyor.

source: Similar to :func:`thread_time` but return time as nanoseconds.
tr: :func:`thread_time` ile benzer şekilde ama zamanı nanosaniyeler şeklinde döndürür.

source: Reset the time conversion rules used by the library routines. The environment variable :envvar:`TZ` specifies how this is done. It will also set the variables ``tzname`` (from the :envvar:`TZ` environment variable), ``timezone`` (non-DST seconds West of UTC), ``altzone`` (DST seconds west of UTC) and ``daylight`` (to 0 if this timezone does not have any daylight saving time rules, or to nonzero if there is a time, past, present or future when daylight saving time applies).
tr: Kütüphane rutinleri tarafından kullanılan zaman dönüştürme kurallarını sıfırlayın. :envvar:`TZ` ortam değişkeni bunun nasıl yapıldığını belirtir. Ayrıca tzname ( :envvar:`TZ` ortam değişkeninden), ``timezone`` (UTC'nin batısındaki DST olmayan saniyeler), ``altzone`` (UTC'nin batısındaki DST saniyeleri) değişkenlerini de ayarlayacaktır. ) ve ``daylight`` (bu saat diliminde herhangi bir yaz saati uygulaması kuralı yoksa 0'a veya gün ışığından yararlanma saatinin uygulandığı geçmiş, şimdi veya gelecek bir zaman varsa sıfırdan farklı).

source: Although in many cases, changing the :envvar:`TZ` environment variable may affect the output of functions like :func:`localtime` without calling :func:`tzset`, this behavior should not be relied on.
tr: Çoğu durumda, :envvar:`TZ` ortam değişkenini değiştirmek, :func:`localtime` gibi işlevlerin çıktısını :func:`tzset` çağırmadan etkileyebilirse de, bu davranışa güvenilmemelidir.

source: The :envvar:`TZ` environment variable should contain no whitespace.
tr: :envvar:`TZ` çevre değişkeni boşluk karakteri içermemelidir.

source: The standard format of the :envvar:`TZ` environment variable is (whitespace added for clarity)::
tr: :envvar:`TZ` çevre değişkeninin standart biçimi (boşluk karakteri açıklık için eklenmiştir)::

source: Where the components are:
tr: Bileşenlerin olduğu yerde:

source: ``std`` and ``dst``
tr: ``std`` ve ``dst``

source: Three or more alphanumerics giving the timezone abbreviations. These will be propagated into time.tzname
tr: Üç veya daha fazla harfler ve sayılar saat dilimi kısaltmalarını veriyor. Bunlar time.tzname içine yayılacaktır

source: The offset has the form: ``± hh[:mm[:ss]]``. This indicates the value added the local time to arrive at UTC. If preceded by a '-', the timezone is east of the Prime Meridian; otherwise, it is west. If no offset follows dst, summer time is assumed to be one hour ahead of standard time.
tr: Göreli konum şu biçimdedir: ``± hh[:mm[:ss]]``. Bu, UTC'ye varmak için yerel saate eklenen değeri gösterir. Başında '-' varsa, saat dilimi Başlangıç Meridyeni'nin doğusundadır; aksi halde batıdır. dst'yi takip eden herhangi bir sapma yoksa, yaz saatinin standart saatten bir saat ileri olduğu varsayılır.

source: Indicates when to change to and back from DST. The format of the start and end dates are one of the following:
tr: DST'ye ne zaman geçileceğini ve DST'den geri dönüleceğini gösterir. Başlangıç ve bitiş tarihlerinin biçimi aşağıdakilerden biridir:

source: The Julian day *n* (1 <= *n* <= 365). Leap days are not counted, so in all years February 28 is day 59 and March 1 is day 60.
tr: Jülyen günü *n* (1 <= *n* <= 365). Artık günler sayılmaz, yani bütün yıllarda 28 Şubat 59. gün ve 1 Mart 60. gündür.

source: The zero-based Julian day (0 <= *n* <= 365). Leap days are counted, and it is possible to refer to February 29.
tr: Sıfır tabanlı Jülyen günü (0 <= *n* <= 365). Artık günler dahil edilmiştir, ve 29 Şubat'tan bahsetmek mümkündür.

source: The *d*'th day (0 <= *d* <= 6) of week *n* of month *m* of the year (1 <= *n* <= 5, 1 <= *m* <= 12, where week 5 means "the last *d* day in month *m*" which may occur in either the fourth or the fifth week). Week 1 is the first week in which the *d*'th day occurs. Day zero is a Sunday.
tr: Yılın *m* ayının *n* haftasının *d*'inci günü (0 <= *d* <= 6) (1 <= *n* <= 5, 1 <= *m* <= 12, burada 5. hafta "the last *d* day in month *m*" anlamına gelir ve dördüncü veya beşinci haftada olabilir).

source: ``time`` has the same format as ``offset`` except that no leading sign ('-' or '+') is allowed. The default, if time is not given, is 02:00:00.
tr: ``time``, ``offset`` ile ('-' or '+') ön işaretlerine izin verilmemesi haricinde aynı biçime sahiptir. Zaman verilmemişse, varsayılan olarak 02:00:00'dır.

source: On many Unix systems (including \*BSD, Linux, Solaris, and Darwin), it is more convenient to use the system's zoneinfo (:manpage:`tzfile(5)`) database to specify the timezone rules. To do this, set the :envvar:`TZ` environment variable to the path of the required timezone datafile, relative to the root of the systems 'zoneinfo' timezone database, usually located at :file:`/usr/share/zoneinfo`. For example, ``'US/Eastern'``, ``'Australia/Melbourne'``, ``'Egypt'`` or ``'Europe/Amsterdam'``. ::
tr: Bir çok Unix sisteminde (\*BSD, Linux, Solaris, ve Darwin dahil), saat dilimi kurallarını belirlemek için sistemin zoneinfo (:manpage:`tzfile(5)`) veritabanını kullanmak daha uygundur. Bunu yapmak için, :envvar:`TZ` çevre değişkenini gerekli saat dilimi veri dosyasının konumuna ayarlayınız, sistemlerin 'zoneinfo' saat dilimi veritabanının köküne göre, genellikle :file:`/usr/share/zoneinfo` konumunda bulunur. Örnek olarak, ``'US/Eastern'``, ``'Australia/Melbourne'``, ``'Egypt'`` veya ``'Europe/Amsterdam'``. ::

source: Clock ID Constants
tr: Saat Kimliği Sabitleri

source: These constants are used as parameters for :func:`clock_getres` and :func:`clock_gettime`.
tr: Şu sabitler :func:`clock_getres` ve :func:`clock_gettime` için parametre olarak kullanılırlar.

source: Identical to :data:`CLOCK_MONOTONIC`, except it also includes any time that the system is suspended.
tr: :data:`CLOCK_MONOTONIC` ile aynı şekilde, ancak o sistemin askıya alındığı herhangi bir zamanı da içerir.

source: This allows applications to get a suspend-aware monotonic clock without having to deal with the complications of :data:`CLOCK_REALTIME`, which may have discontinuities if the time is changed using ``settimeofday()`` or similar.
tr: Bu, uygulamaların :data:`CLOCK_REALTIME` komplikasyonları ile uğraşmak zorunda kalmadan, zaman ``settimeofday()`` veya benzeri kullanılarak değiştirildiğinde süreksizliklere sahip olabilecek, askıya alma farkında monoton bir saat elde etmelerini sağlar.

source: The Solaris OS has a ``CLOCK_HIGHRES`` timer that attempts to use an optimal hardware source, and may give close to nanosecond resolution. ``CLOCK_HIGHRES`` is the nonadjustable, high-resolution clock.
tr: Solaris OS, en uygun donanım kaynağını kullanmaya çalışan ve nanosaniyeye yakın kesinlik sağlayabilen bir ``CLOCK_HIGHRES`` zamanlayıcıya sahiptir. ``CLOCK_HIGHRES`` ayarlanamaz, yüksek kesinlikli saattir.

source: Clock that cannot be set and represents monotonic time since some unspecified starting point.
tr: Belirsiz başlangıç noktasından beri ayarlanamayan ve monoton zamanı temsil eden saat.

source: Similar to :data:`CLOCK_MONOTONIC`, but provides access to a raw hardware-based time that is not subject to NTP adjustments.
tr: :data:`CLOCK_MONOTONIC` ile benzer, ama NTP ayarlamalarına tabii olmayan donanım bazlı ham zamana erişim sağlar.

source: High-resolution per-process timer from the CPU.
tr: CPU'dan yüksek kesinlikli işlem başına zamanlayıcısı.

source: The system must have a current leap second table in order for this to give the correct answer. PTP or NTP software can maintain a leap second table.
tr: Bunun doğru cevabı verebilmesi için sistemin güncel bir artık saniye tablosuna sahip olması gerekir. PTP veya NTP yazılımı artık saniye tablosunu sürdürebilir.

source: Thread-specific CPU-time clock.
tr: İş parçacığına özgü CPU zamanlayıcı saati.

source: Time whose absolute value is the time the system has been running and not suspended, providing accurate uptime measurement, both absolute and interval.
tr: Mutlak değeri sistemin çalıştığı ve askıya alınmadığı süre olan süre, hem mutlak hem de aralıklı olarak doğru çalışma süresi ölçümü sağlar.

source: Clock that increments monotonically, tracking the time since an arbitrary point, unaffected by frequency or time adjustments and not incremented while the system is asleep.
tr: Monoton bir şekilde artan saat, istenilen bir noktadan itibaren zamanı takip ediyor, sıklıktan ve zaman ayarlamalarından etkilenmiyor ve sistem uykudayken artmıyor.

source: The following constant is the only parameter that can be sent to :func:`clock_settime`.
tr: Aşağıdaki sabit :func:`clock_settime`'a gönderilebilecek tek parametredir.

source: System-wide real-time clock. Setting this clock requires appropriate privileges.
tr: Sistem çapında gerçek zamanlı saat. Bu saati ayarlamak uygun izinleri gerektirir.

source: Timezone Constants
tr: Saat dilimi Sabitleri

source: The offset of the local DST timezone, in seconds west of UTC, if one is defined. This is negative if the local DST timezone is east of UTC (as in Western Europe, including the UK). Only use this if ``daylight`` is nonzero. See note below.
tr: Tanımlanmışsa, yerel DST saat diliminin UTC'nin batısındaki saniye cinsinden farkı. Yerel DST saat dilimi UTC'nin doğusundaysa (Britanya dahil Batı Avrupa'da olduğu gibi) bu negatiftir. Bunu yalnızca ``daylight`` sıfır değilse kullanın. Aşağıdaki nota bakın.

source: Nonzero if a DST timezone is defined. See note below.
tr: Sıfırdan farklı, eğer bir DST saat dilimi tanımlanmışsa. Aşağıdaki nota göz atın.
