Repository: python/python-docs-tr
Catalog: library/time.po
Languages: tr

source: The offset of the local (non-DST) timezone, in seconds west of UTC (negative in most of Western Europe, positive in the US, zero in the UK). See note below.
tr: Yerel (DST olmayan) saat diliminin farkı, UTC'nin batısında saniye cinsinden farkı (Batı Avrupa'nın çoğunda negatif, ABD'de pozitif, Birleşik Krallık'ta sıfır). Aşağıdaki nota bakın.

source: A tuple of two strings: the first is the name of the local non-DST timezone, the second is the name of the local DST timezone. If no DST timezone is defined, the second string should not be used. See note below.
tr: İki dizeden oluşan bir demet: ilki yerel DST olmayan saat diliminin ismi, ikincisi yerel DST saat diliminin ismi. DST saat dilimi tanımlanmamışsa, ikinci dize kullanılmamalı. Aşağıdaki nota bakın.

source: For the above Timezone constants (:data:`altzone`, :data:`daylight`, :data:`timezone`, and :data:`tzname`), the value is determined by the timezone rules in effect at module load time or the last time :func:`tzset` is called and may be incorrect for times in the past. It is recommended to use the :attr:`tm_gmtoff` and :attr:`tm_zone` results from :func:`localtime` to obtain timezone information.
tr: Yukarıdaki Saat Dilimi sabitleri için (:data:`altzone`, :data:`daylight`, :data:`timezone` ve :data:`tzname`), değer, modül yükleme zamanında geçerli olan saat dilimi kurallarına göre belirlenir veya son kez :func:`tzset` çağrılır ve geçmişteki zamanlar için yanlış olabilir. Saat dilimi bilgisi almak için :func:`localtime`'den :attr:`tm_gmtoff` ve :attr:`tm_zone` sonuçlarının kullanılması önerilir.

source: Module :mod:`datetime`
tr: :mod:`datetime` modülü

source: More object-oriented interface to dates and times.
tr: Tarihler ve zamanlar için daha fazla nesne tabanlı arayüz.

source: Module :mod:`locale`
tr: :mod:`locale` modülü

source: Internationalization services. The locale setting affects the interpretation of many format specifiers in :func:`strftime` and :func:`strptime`.
tr: Uluslararasılaştırma servisleri. Yerel ayar, :func:`strftime` ve :func:`strptime` içindeki birçok biçim belirticisinin yorumlanmasını etkiler.

source: Module :mod:`calendar`
tr: :mod:`calendar` modülü

source: General calendar-related functions. :func:`~calendar.timegm` is the inverse of :func:`gmtime` from this module.
tr: Genel takvim ile alakalı fonksiyonlar. :func:`~calendar.timegm` bu modüldeki :func:`gmtime`'in tersidir.

source: Footnotes
tr: Dipnotlar

source: The use of ``%Z`` is now deprecated, but the ``%z`` escape that expands to the preferred hour/minute offset is not supported by all ANSI C libraries. Also, a strict reading of the original 1982 :rfc:`822` standard calls for a two-digit year (``%y`` rather than ``%Y``), but practice moved to 4-digit years long before the year 2000. After that, :rfc:`822` became obsolete and the 4-digit year has been first recommended by :rfc:`1123` and then mandated by :rfc:`2822`.
tr: ``%Z`` kullanımı artık kullanımdan kaldırıldı, ancak tercih edilen saat/dakika farkına genişleyen ``%z`` çıkışı, tüm ANSI C kütüphaneleri tarafından desteklenmez. Ayrıca, orijinal 1982 :rfc:`822` standardının katı bir okuması, iki basamaklı bir yıl gerektirir (``%y`` yerine ``%y``), ancak uygulama 2000 yılından çok önce 4 basamaklı yıllara taşındı. Bundan sonra :rfc:`822` geçerliliğini yitirdi ve 4 basamaklı yıl önce :rfc:`1123` tarafından önerildi ve ardından :rfc:`2822` tarafından zorunlu kılındı.
