Repository: python/python-docs-tr
Catalog: library/time.po
Languages: tr

source: :mod:`time` --- Time access and conversions
tr: :mod:`time` --- Zaman erişimi ve dönüşümleri

source: This module provides various time-related functions. For related functionality, see also the :mod:`datetime` and :mod:`calendar` modules.
tr: Bu modül zamanla alakalı çeşitli fonksiyonlar sağlar. Alakalı fonksiyonellik için, :mod:`datetime` ve :mod:`calendar` modüllerine göz atın.

source: Although this module is always available, not all functions are available on all platforms. Most of the functions defined in this module call platform C library functions with the same name. It may sometimes be helpful to consult the platform documentation, because the semantics of these functions varies among platforms.
tr: Bu modül her zaman kullanılabilir olmasına rağmen, bütün fonksiyonlar bütün platformlarda kullanılamaz. Bu modülde tanımlanmış fonksiyonlar çoğu aynı isimli C platform kütüphanesinin fonksiyonlarını çağırır. Fonksiyonların anlamları platformlar arasında değiştiğinden bazen platform dokümantasyonuna başvurmak yardımcı olabilir.

source: An explanation of some terminology and conventions is in order.
tr: Sırada biraz terminoloji ve kural açıklamaları var.

source: The :dfn:`epoch` is the point where the time starts, the return value of ``time.gmtime(0)``. It is January 1, 1970, 00:00:00 (UTC) on all platforms.
tr: :dfn:`epoch` zamanın başladığı noktadır, ``time.gmtime(0)``'nun dönüş değeridir. Bütün platformlarda 1 Ocak, 1970, 00:00:00 (UTC) şeklindedir.

source: The term :dfn:`seconds since the epoch` refers to the total number of elapsed seconds since the epoch, typically excluding `leap seconds`_. Leap seconds are excluded from this total on all POSIX-compliant platforms.
tr: :dfn:`seconds since the epoch` terimi başlangıçtan beri geçen toplam saniyeyi ifade eder, tipik olarak `leap seconds`_ hariç. Artık saniyeler POSIX-uyumlu tüm platformlardan çıkarılmıştır.

source: The functions in this module may not handle dates and times before the epoch_ or far in the future. The cut-off point in the future is determined by the C library; for 32-bit systems, it is typically in 2038.
tr: Bu modüldeki fonksiyonlar epoch_ 'den önce olan veya çok uzak gelecekte olan tarihleri ve zamanları çalıştıramayabilirler. Sona erme noktası 32-bit sistemler için C kütüphanesi tarafından belirlenmiştir, tipik olarak 2038'dir.

source: Function :func:`strptime` can parse 2-digit years when given ``%y`` format code. When 2-digit years are parsed, they are converted according to the POSIX and ISO C standards: values 69--99 are mapped to 1969--1999, and values 0--68 are mapped to 2000--2068.
tr: :func:`strptime` fonksiyonu ``%y`` biçimi verildiğinde 2 haneli yılları ayrıştırabilir. 2 haneli yıllar ayrıştırıldığında, POSIX ve ISO C standartlarına göre dönüştürülürler; 69--99 değerleri 1969--1999 değerlerine, 0--68 değerleri 2000--2068 değerlerine eşlenirler.

source: UTC is Coordinated Universal Time (formerly known as Greenwich Mean Time, or GMT). The acronym UTC is not a mistake but a compromise between English and French.
tr: UTC, Koordineli Evrensel Zaman (eski haliyle Greenwich Ortalama Zamanı, ya da GMT) anlamına gelir. UTC kısaltması bir hata değil, İngilizce ve Fransızca arasında bir uzlaşmadır.

source: DST is Daylight Saving Time, an adjustment of the timezone by (usually) one hour during part of the year. DST rules are magic (determined by local law) and can change from year to year. The C library has a table containing the local rules (often it is read from a system file for flexibility) and is the only source of True Wisdom in this respect.
tr: DST, Yaz Saati Uygulaması, yılın bir kısmında saat diliminin (genellikle) bir saat ayarlanmasına denir. DST kuralları büyülüdür (yerel yasalar tarafından belirlenir) ve yıldan yıla değişebilir. C kütüphanesi yerel kuralları (genellikle esneklik için bir sistem dosyasından okunur) içeren bir tabloya sahiptir ve Gerçek Bilgeliğin tek kaynağıdır.

source: The precision of the various real-time functions may be less than suggested by the units in which their value or argument is expressed. E.g. on most Unix systems, the clock "ticks" only 50 or 100 times a second.
tr: Çeşitli gerçek-zamanlı fonksiyonların hassasiyeti birimlerin değerlerinin veya argümanlarının ifade edildiği önerilerden daha az olabilir. Örneği çoğu Unix sistemlerinde, saat yalnızca 50 veya 100 defa "çalışır".

source: On the other hand, the precision of :func:`.time` and :func:`sleep` is better than their Unix equivalents: times are expressed as floating point numbers, :func:`.time` returns the most accurate time available (using Unix :c:func:`gettimeofday` where available), and :func:`sleep` will accept a time with a nonzero fraction (Unix :c:func:`select` is used to implement this, where available).
tr: Öte yandan, :func:`.time` ve :func:`sleep` fonksiyonlarının hassasiyetleri diğer Unix karşılıklarından daha iyidir: zamanlar kayan noktalı sayılar olarak ifade edilirler, :func:`.time` mevcut en doğru zamanı döndürür (mevcut olduğu yerde Unix :c:func:`gettimeofday` kullanarak), ve :func:`sleep` sıfıra eşit olmayan kesirli zamanı kabul eder (Unix :c:func:`select`, mümkün olduğunda bunu uygulamak için kullanılır).

source: The time value as returned by :func:`gmtime`, :func:`localtime`, and :func:`strptime`, and accepted by :func:`asctime`, :func:`mktime` and :func:`strftime`, is a sequence of 9 integers. The return values of :func:`gmtime`, :func:`localtime`, and :func:`strptime` also offer attribute names for individual fields.
tr: :func:`gmtime`, :func:`localtime`, ve :func:`strptime`, tarafından döndürülen ve :func:`asctime`, :func:`mktime` ve :func:`strftime`, tarafından kabul edilen zaman değeri 9 tam sayılık bir dizidir. :func:`gmtime`, :func:`localtime`, ve :func:`strptime` tarafından döndürülen değerler ayrıca ayrı alanlar için ayrı öznitelik isimleri sunar.

source: See :class:`struct_time` for a description of these objects.
tr: Bu nesnelerin açıklamalarını görmek için :class:`struct_time`'a göz at.

source: The :class:`struct_time` type was extended to provide the :attr:`tm_gmtoff` and :attr:`tm_zone` attributes when platform supports corresponding ``struct tm`` members.
tr: :class:`struct_time` türü :attr:`tm_gmtoff` ve :attr:`tm_zone` özniteliklerini platform ``struct tm``'e ilişkin üyeleri desteklediğinde sağlayabilmek için genişletilmiştir.

source: The :class:`struct_time` attributes :attr:`tm_gmtoff` and :attr:`tm_zone` are now available on all platforms.
tr: :class:`struct_time` öznitelikleri :attr:`tm_gmtoff` ve :attr:`tm_zone` artık bütün platformlarda mevcut.

source: Use the following functions to convert between time representations:
tr: Zaman temsilleri arasında dönüşüm yapmak için belirtilen fonksiyonları kullanın:

source: From
tr: Den

source: To
tr: Karşı

source: Use
tr: Kullan

source: seconds since the epoch
tr: zamanın başlangıcından beri geçen saniye

source: :class:`struct_time` in UTC
tr: UTC içinde :class:`struct_time`

source: :class:`struct_time` in local time
tr: yerel zaman içinde :class:`struct_time`

source: Functions
tr: Fonksiyonlar

source: Convert a tuple or :class:`struct_time` representing a time as returned by :func:`gmtime` or :func:`localtime` to a string of the following form: ``'Sun Jun 20 23:21:05 1993'``. The day field is two characters long and is space padded if the day is a single digit, e.g.: ``'Wed Jun 9 04:26:40 1993'``.
tr: :func:`gmtime` veya :func:`localtime` tarafından döndürülen bir zamanı temsil eden bir demet veya :class:`struct_time` öğesini şu forma sahip bir dizeye dönüştürün: ``'Sun Jun 20 23:21:05 1993'``. Gün alanı iki karakter uzunluğundadır ve gün tek harfliyse boşluk karakteriyle doldurulur, örnek: ``'Wed Jun 9 04:26:40 1993'``.

source: If *t* is not provided, the current time as returned by :func:`localtime` is used. Locale information is not used by :func:`asctime`.
tr: Eğer *t* sağlanmamışsa, :func:`localtime` tarafından döndürülen şimdiki zaman kullanılır. Yerel bilgi :func:`asctime` tarafından kullanılmaz.

source: Unlike the C function of the same name, :func:`asctime` does not add a trailing newline.
tr: Aynı isimli C fonksiyonunun aksine, :func:`asctime` sona yeni satır eklemez.

source: Return the *clk_id* of the thread-specific CPU-time clock for the specified *thread_id*.
tr: Belirtilen *thread_id* için iş parçacığına özgü CPU-zaman saatinin *clk_id* değerini döndürür.

source: Use :func:`threading.get_ident` or the :attr:`~threading.Thread.ident` attribute of :class:`threading.Thread` objects to get a suitable value for *thread_id*.
tr: *thread_id* için uygun bir değer elde etmek için :func:`threading.get_ident` veya :class:`threading.Thread` nesnelerinin :attr:`~threading.Thread.ident` özniteliğini kullanın.

source: Passing an invalid or expired *thread_id* may result in undefined behavior, such as segmentation fault.
tr: Geçersiz veya süresi geçmiş bir *thread_id* girişi yapmak, bölümleme hatası gibi, tanımlanmamış bir davranış ortaya koyabilir.

source: See the man page for :manpage:`pthread_getcpuclockid(3)` for further information.
tr: Daha fazla bilgi için :manpage:`pthread_getcpuclockid(3)` el kitabına göz atın.

source: Return the resolution (precision) of the specified clock *clk_id*. Refer to :ref:`time-clock-id-constants` for a list of accepted values for *clk_id*.
tr: Belirtilen *clk_id* saatinin netliğini (kesinliğini) döndür. *clk_id*'e uygun değerlerin bir listesi için :ref:`time-clock-id-constants`'a bakınız.

source: Return the time of the specified clock *clk_id*. Refer to :ref:`time-clock-id-constants` for a list of accepted values for *clk_id*.
tr: Belirtilen *clk_id* saatinin zamanını döndür. *clk_id*'e uygun değerlerin bir listesi için :ref:`time-clock-id-constants`'a bakınız.

source: Use :func:`clock_gettime_ns` to avoid the precision loss caused by the :class:`float` type.
tr: :class:`float` türü sebebiyle oluşan kesinlik kaybından kaçınmak için :func:`clock_gettime_ns` kullanın.

source: Similar to :func:`clock_gettime` but return time as nanoseconds.
tr: :func:`clock_gettime`'a benzer şekilde ama zamanı nanosaniyeler şeklinde döndürür.

source: Set the time of the specified clock *clk_id*. Currently, :data:`CLOCK_REALTIME` is the only accepted value for *clk_id*.
tr: Belirtilen *clk_id* saatinin zamanını ayarla. Şu anda, *clk_id* için kabul edilen tek değer :data:`CLOCK_REALTIME`'dır.

source: Use :func:`clock_settime_ns` to avoid the precision loss caused by the :class:`float` type.
tr: :class:`float` türü sebebiyle oluşan kesinlik kaybından kaçınmak için :func:`clock_settime_ns` kullanın.

source: Similar to :func:`clock_settime` but set time with nanoseconds.
tr: :func:`clock_settime`'a benzer şekilde ama zamanı nanosaniyeler ile ayarlar.

source: Convert a time expressed in seconds since the epoch_ to a string of a form: ``'Sun Jun 20 23:21:05 1993'`` representing local time. The day field is two characters long and is space padded if the day is a single digit, e.g.: ``'Wed Jun 9 04:26:40 1993'``.
tr: epoch_ 'dan bu yana saniye cinsinden ifade edilen bir süreyi bir biçim dizisine dönüştürün: yerel zamanı temsil eden ``'Sun Jun 20 23:21:05 1993'``. Gün alanı iki karakter uzunluğundadır ve gün tek basamaklıysa boşluk bırakılır, örneğin: ``'Wed Jun 9 04:26:40 1993'``.

source: If *secs* is not provided or :const:`None`, the current time as returned by :func:`.time` is used. ``ctime(secs)`` is equivalent to ``asctime(localtime(secs))``. Locale information is not used by :func:`ctime`.
tr: *secs* veya :const:`None` sağlanmamışsa, :func:`.time` tarafından döndürülen mevcut zaman kullanılır. ``ctime(secs)`` ``asctime(localtime(secs))``'e karşılıktır. Yerel ayar bilgisi :func:`ctime` tarafından kullanılmaz.

source: Get information on the specified clock as a namespace object. Supported clock names and the corresponding functions to read their value are:
tr: Belirtilen saat için namespace nesnesi şeklinde bilgi edinin. Desteklenen saat isimleri ve onların değerlerini okumaya ilişkin fonksiyonlar şunlardır:

source: The result has the following attributes:
tr: Sonuç şu özniteliklere sahiptir:

source: *adjustable*: ``True`` if the clock can be changed automatically (e.g. by a NTP daemon) or manually by the system administrator, ``False`` otherwise
tr: Saat otomatik bir şekilde (örneğin bir NTP daemon tarafından) veya sistem yöneticisi tarafından değiştirilebiliyorsa *adjustable*: ``True``, tersi için ``False``

source: *implementation*: The name of the underlying C function used to get the clock value. Refer to :ref:`time-clock-id-constants` for possible values.
tr: *implementation*: Saat değerini elde etmek için kullanılan temel C fonksiyonunun ismidir. Muhtemel değerler için :ref:`time-clock-id-constants`'a bakınız.

source: *monotonic*: ``True`` if the clock cannot go backward, ``False`` otherwise
tr: *monotonic*: Saat geriye doğru gidemiyorsa ``True``, aksi halde ``False``

source: *resolution*: The resolution of the clock in seconds (:class:`float`)
tr: *resolution*: Saatin saniyeler halindeki netliği (:class:`float`)

source: Convert a time expressed in seconds since the epoch_ to a :class:`struct_time` in UTC in which the dst flag is always zero. If *secs* is not provided or :const:`None`, the current time as returned by :func:`.time` is used. Fractions of a second are ignored. See above for a description of the :class:`struct_time` object. See :func:`calendar.timegm` for the inverse of this function.
tr: epoch_ 'dan bu yana saniye olarak ifade edilen bir zamanı, dst bayrağının her zaman sıfır olduğu UTC'de bir :class:`struct_time`'a dönüştürün. *secs* sağlanmazsa veya :const:`None`, :func:`.time` tarafından döndürülen geçerli zaman kullanılır. Saniyenin kesirleri dikkate alınmaz. :class:`struct_time` nesnesinin açıklaması için yukarıya bakın. Bu fonksiyonun tersi için :func:`calendar.timegm` konusuna bakın.

source: Like :func:`gmtime` but converts to local time. If *secs* is not provided or :const:`None`, the current time as returned by :func:`.time` is used. The dst flag is set to ``1`` when DST applies to the given time.
tr: :func:`gmtime` gibi ama yerel zamana dönüştürür. Eğer *secs* sağlanmazsa veya :const:`None` ise, :func:`.time` tarafından döndürülen şimdiki zaman kullanılır. Belirli bir süre için DST uygulandığında dst bayrağı ``1`` olarak ayarlanır.

source: :func:`localtime` may raise :exc:`OverflowError`, if the timestamp is outside the range of values supported by the platform C :c:func:`localtime` or :c:func:`gmtime` functions, and :exc:`OSError` on :c:func:`localtime` or :c:func:`gmtime` failure. It's common for this to be restricted to years between 1970 and 2038.
tr: Eğer zaman damgası C :c:func:`localtime` veya :c:func:`gmtime` fonksiyonları tarafından sağlanan değer aralıkları içerisinde değilse :func:`localtime` :exc:`OverflowError` yükseltebilir, ve :c:func:`localtime` üzerinde :exc:`OSError` veya :c:func:`gmtime` hatasını. Bunun 1970 ile 2038 arasındaki yıllarla sınırlı olması yaygın bir durumdur.

source: This is the inverse function of :func:`localtime`. Its argument is the :class:`struct_time` or full 9-tuple (since the dst flag is needed; use ``-1`` as the dst flag if it is unknown) which expresses the time in *local* time, not UTC. It returns a floating point number, for compatibility with :func:`.time`. If the input value cannot be represented as a valid time, either :exc:`OverflowError` or :exc:`ValueError` will be raised (which depends on whether the invalid value is caught by Python or the underlying C libraries). The earliest date for which it can generate a time is platform-dependent.
tr: Bu, :func:`localtime`'ın ters fonksiyonudur. Argümanı :class:`struct_time` veya tam 9-demet (dst bayrağı gerekli olduğundan; bilinmiyorsa dst bayrağı olarak ``-1`` kullanın), zamanı *local* zamanda ifade eder, UTC değil. :func:`.time` ile uyumluluk için bir kayan noktalı sayı döndürür. Giriş değeri geçerli bir zaman olarak gösterilemiyorsa, :exc:`OverflowError` veya :exc:`ValueError` yükseltilir (geçersiz değerin Python veya temel C kitaplıkları tarafından yakalanıp yakalanmadığına bağlıdır). Bir zaman oluşturabileceği en erken tarih, platforma bağlıdır.

source: Return the value (in fractional seconds) of a monotonic clock, i.e. a clock that cannot go backwards. The clock is not affected by system clock updates. The reference point of the returned value is undefined, so that only the difference between the results of two calls is valid.
tr: Monoton bir saatin değerini (kesirli saniye cinsinden) döndürür, yani bir geri gidemeyen bir saat. Saat sistem saat güncellemelerinden etkilenmez. Döndürülen değerin referans noktası tanımlanmamıştır, böylece sadece iki aramanın sonuçları arasındaki fark geçerlidir.

source: Use :func:`monotonic_ns` to avoid the precision loss caused by the :class:`float` type.
tr: :class:`float` türünün sebep olduğu kesinlik kaybından kaçınmak için :func:`monotonic_ns` kullanın.

source: The function is now always available and always system-wide.
tr: Fonksiyon artık her zaman mevcut ve her zaman sistem çapında.

source: On macOS, the function is now system-wide.
tr: macOS için, fonksiyon artık sistem çapında.

source: Similar to :func:`monotonic`, but return time as nanoseconds.
tr: :func:`monotonic`'e benzer şekilde, ama zamanı nanosaniyeler şeklinde döndürür.

source: Return the value (in fractional seconds) of a performance counter, i.e. a clock with the highest available resolution to measure a short duration. It does include time elapsed during sleep and is system-wide. The reference point of the returned value is undefined, so that only the difference between the results of two calls is valid.
tr: Bir performans sayacının değerini (kesirli saniye cinsinden) döndürür, örnek olarak kısa bir süreyi ölçmek için mümkün olan en yüksek kesinliğe sahip bir saat. Uyku sırasında geçen süreyi içerir ve sistem çapındadır. Döndürülen değerin referans noktası tanımsızdır, yani sadece iki çağrının sonuçları arasındaki fark geçerlidir.

source: Use :func:`perf_counter_ns` to avoid the precision loss caused by the :class:`float` type.
tr: :class:`float` türü sebebiyle oluşan kesinlik kaybından kaçınmak için :func:`perf_counter_ns` kullanın.

source: On Windows, the function is now system-wide.
tr: Windows için, fonksiyon artık sistem çapında.

source: Similar to :func:`perf_counter`, but return time as nanoseconds.
tr: :func:`perf_counter`'a benzer şekilde, ama zamanı nanosaniyeler şeklinde döndürür.

source: Return the value (in fractional seconds) of the sum of the system and user CPU time of the current process. It does not include time elapsed during sleep. It is process-wide by definition. The reference point of the returned value is undefined, so that only the difference between the results of two calls is valid.
tr: Geçerli işlemin sistem ve kullanıcı CPU zamanının toplamının değerini (kesirli saniye cinsinden) döndürür. Uykuda geçen süreyi dahil etmez. Tanım gereği işlem çapındadır. Döndürülen değerin referans noktası tanımsızdır, yani sadece iki çağrının sonuçları arasındaki fark geçerlidir.

source: Use :func:`process_time_ns` to avoid the precision loss caused by the :class:`float` type.
tr: :class:`float` türü sebebiyle oluşan kesinlik kaybından kaçınmak için :func:`process_time_ns` kullanın.

source: Similar to :func:`process_time` but return time as nanoseconds.
tr: :func:`process_time`'a benzer şekilde, ama zamanı nanosaniyeler şeklinde döndürür.

source: Suspend execution of the calling thread for the given number of seconds. The argument may be a floating point number to indicate a more precise sleep time.
tr: Çağıran iş parçacığının yürütülmesini verilen saniye sayısı kadar askıya alın. Argüman, daha kesin bir uyku zamanını belirtmek için kayan noktalı bir sayı olabilir.

source: If the sleep is interrupted by a signal and no exception is raised by the signal handler, the sleep is restarted with a recomputed timeout.
tr: Eğer uyku bir sinyal tarafından kesintiye uğrarsa ve sinyal işleyicisi tarafından herhangi bir istisna yükseltilmezse, uyku yeniden hesaplanmış bir zaman aşımıyla tekrar başlar.

source: The suspension time may be longer than requested by an arbitrary amount, because of the scheduling of other activity in the system.
tr: Askıya alma süresi isteğe bağlı bir değer ile istenilenden daha uzun tutulabilir, sebebiyse diğer aktivitelerin sistem içerisindeki planlanmasıdır.

source: On Windows, if *secs* is zero, the thread relinquishes the remainder of its time slice to any other thread that is ready to run. If there are no other threads ready to run, the function returns immediately, and the thread continues execution. On Windows 8.1 and newer the implementation uses a `high-resolution timer <https://docs.microsoft.com/en-us/windows-hardware/drivers/kernel/high-resolution-timers>`_ which provides resolution of 100 nanoseconds. If *secs* is zero, ``Sleep(0)`` is used.
tr: Windows'ta *secs* sıfırsa, iş parçacığı zaman diliminin geri kalanını çalışmaya hazır olan başka bir iş parçacığına bırakır. Çalışmaya hazır başka iş parçacığı yoksa fonksiyon hemen geri döner ve iş parçacığı çalışmaya devam eder. Windows 8.1 ve daha yeni sürümlerde uygulama, 100 nanosaniyenin kesinliğini sağlayan bir `high-resolution timer <https://docs.microsoft.com/en-us/windows-hardware/drivers/kernel/high-Definition-timers>`_ kullanır. *secs* sıfırsa, ``Sleep(0)`` kullanılır.

source: Unix implementation:
tr: Unix uyarlaması:

source: Use ``clock_nanosleep()`` if available (resolution: 1 nanosecond);
tr: Kullanılabilirse ``clock_nanosleep()`` kullanın (netlik: 1 nanosaniye);

source: Or use ``nanosleep()`` if available (resolution: 1 nanosecond);
tr: Ya da kullanılabiliyorsa ``nanosleep()`` kullanın (netlik: 1 nanosaniye);

source: Or use ``select()`` (resolution: 1 microsecond).
tr: Ya da ``select()`` kullanın (netlik: 1 mikrosaniye).

source: On Unix, the ``clock_nanosleep()`` and ``nanosleep()`` functions are now used if available. On Windows, a waitable timer is now used.
tr: Unix'de, ``clock_nanosleep()`` ve ``nanosleep()`` fonksiyonları artık kullanılabiliyor. Windows'da, artık beklenebilir bir zamanlayıcı kullanılıyor.

source: The function now sleeps at least *secs* even if the sleep is interrupted by a signal, except if the signal handler raises an exception (see :pep:`475` for the rationale).
tr: Fonksiyon artık bir sinyal tarafından kesilirse bile *secs* süresince uyur, sinyal işleyicisi tarafından bir istisna yükseltilmesi durumu hariç (açıklaması için :pep:`475`'e göz atın).

source: Convert a tuple or :class:`struct_time` representing a time as returned by :func:`gmtime` or :func:`localtime` to a string as specified by the *format* argument. If *t* is not provided, the current time as returned by :func:`localtime` is used. *format* must be a string. :exc:`ValueError` is raised if any field in *t* is outside of the allowed range.
tr: :func:`gmtime` veya :func:`localtime` tarafından döndürülen bir zamanı temsil eden bir demet veya :class:`struct_time`'ı *format* bağımsız değişkeni tarafından belirtilen bir dizeye dönüştürün. *t* sağlanmazsa, :func:`localtime` tarafından döndürülen geçerli saat kullanılır. *format* bir dize olmalıdır. :exc:`ValueError`, *t* içindeki herhangi bir alan izin verilen aralığın dışındaysa yükseltilir.

source: 0 is a legal argument for any position in the time tuple; if it is normally illegal the value is forced to a correct one.
tr: 0 zaman demeti içerisindeki herhangi bir pozisyon için geçerli bir argümandır; normalde geçersiz ise, değer doğru bir değere zorlanır.
