Repository: python/python-docs-tr
Catalog: distributing/index.po
Languages: tr

source: Distributing Python Modules
tr: Python Modüllerini Dağıtma

source: Email
tr: E-posta

source: As a popular open source development project, Python has an active supporting community of contributors and users that also make their software available for other Python developers to use under open source license terms.
tr: Popüler bir açık kaynak geliştirme projesi olarak Python, yazılımlarını diğer Python geliştiricilerinin açık kaynak lisans koşulları altında kullanmasını sağlayan, aktif destek sağlayan katılımcı (contributor) ve kullanıcı topluluğuna sahiptir.

source: This allows Python users to share and collaborate effectively, benefiting from the solutions others have already created to common (and sometimes even rare!) problems, as well as potentially contributing their own solutions to the common pool.
tr: Bu, Python kullanıcılarının, ortak havuza kendi çözümleriyle potansiyel olarak katkıda bulunmanın yanı sıra, ortak (ve hatta bazen nadir!) sorunlara karşı halihazırda oluşturdukları çözümlerden yararlanarak, Python kullanıcılarının etkin bir şekilde paylaşımda bulunmalarına ve işbirliği yapmalarına olanak tanır.

source: This guide covers the distribution part of the process. For a guide to installing other Python projects, refer to the :ref:`installation guide <installing-index>`.
tr: Bu kılavuz, sürecin dağıtım bölümünü kapsar. Diğer Python projelerini kurmaya yönelik bir kılavuz için :ref:`installation guide <installing-index>` 'e bakın.

source: For corporate and other institutional users, be aware that many organisations have their own policies around using and contributing to open source software. Please take such policies into account when making use of the distribution and installation tools provided with Python.
tr: Kurumsal kullanıcılar için, birçok kuruluşun açık kaynaklı yazılımları kullanma ve bunlara katkıda bulunma konusunda kendi politikaları olduğunu unutmayın. Python ile sağlanan dağıtım ve kurulum araçlarını kullanırken lütfen bu tür politikaları dikkate alın.

source: Key terms
tr: Anahtar terimler

source: the `Python Package Index <https://pypi.org>`__ is a public repository of open source licensed packages made available for use by other Python users
tr: `Python Package Index <https://pypi.org>`__ , diğer Python kullanıcıları tarafından kullanıma sunulan açık kaynaklı lisanslı paketlerin bir yazılım deposudur.

source: the `Python Packaging Authority <https://www.pypa.io/>`__ are the group of developers and documentation authors responsible for the maintenance and evolution of the standard packaging tools and the associated metadata and file format standards. They maintain a variety of tools, documentation and issue trackers on both `GitHub <https://github.com/pypa>`__ and `Bitbucket <https://bitbucket.org/pypa/>`__.
tr: `Python Packaging Authority <https://www.pypa.io/>`__ , standart paketleme araçlarının, ilgili meta verinin ve dosya formatı standartlarının bakımından ve geliştirilmesinden sorumlu geliştiriciler ve dokümantasyon yazarları grubudur. Hem `GitHub <https://github.com/pypa>`__ hem de `Bitbucket <https://bitbucket.org/pypa/>`__ üzerinde çeşitli araçlar, dokümantasyon ve sorun izleyicileri bulundururlar.

source: :mod:`distutils` is the original build and distribution system first added to the Python standard library in 1998. While direct use of :mod:`distutils` is being phased out, it still laid the foundation for the current packaging and distribution infrastructure, and it not only remains part of the standard library, but its name lives on in other ways (such as the name of the mailing list used to coordinate Python packaging standards development).
tr: :mod:`distutils`, Python standart kitaplığına ilk kez 1998 yılında eklenen orijinal derleme ve dağıtım sistemidir. :mod:`distutils` 'in doğrudan kullanımı aşamalı olarak kaldırılırken, halen mevcut paketleme ve dağıtım altyapısının temelini atmıştır. Yalnızca standart kitaplığın bir parçası olmakla kalmaz, adı başka şekillerde de yaşar (Python paketleme standartları geliştirmeyi koordine etmek için kullanılan posta listesinin adı gibi).

source: `setuptools`_ is a (largely) drop-in replacement for :mod:`distutils` first published in 2004. Its most notable addition over the unmodified :mod:`distutils` tools was the ability to declare dependencies on other packages. It is currently recommended as a more regularly updated alternative to :mod:`distutils` that offers consistent support for more recent packaging standards across a wide range of Python versions.
tr: `setuptools`_ ilk olarak 2004'te yayınlanan :mod:`distutils` için (büyük ölçüde) bir eklentidir. Değiştirilmemiş :mod:`distutils` araçlarına göre en dikkate değer ilavesi, diğer paketlere bağımlılıkları bildirme yeteneğiydi. Şu anda, çok çeşitli Python sürümlerinde daha yeni paketleme standartları için tutarlı destek sunan :mod:`distutils` 'e daha düzenli olarak güncellenen bir alternatif olarak önerilmektedir.

source: `wheel`_ (in this context) is a project that adds the ``bdist_wheel`` command to :mod:`distutils`/`setuptools`_. This produces a cross platform binary packaging format (called "wheels" or "wheel files" and defined in :pep:`427`) that allows Python libraries, even those including binary extensions, to be installed on a system without needing to be built locally.
tr: `wheel`_ (bu bağlamda), ``bdist_wheel`` komutunu :mod:`distutils`/`setuptools`_ dizinine ekleyen bir projedir. Bu, Python kütüphanelerinin, (ikili uzantıları içerenlerin bile) bir sisteme yerel olarak kurulmasına gerek kalmadan kurulmasına izin veren bir çapraz platform ikili paketleme biçimi ("wheels" veya "wheel files" olarak adlandırılır ve :pep:`427` 'de tanımlanır) üretir.

source: Open source licensing and collaboration
tr: Açık kaynak lisanslama ve işbirliği

source: In most parts of the world, software is automatically covered by copyright. This means that other developers require explicit permission to copy, use, modify and redistribute the software.
tr: Dünyanın çoğu yerinde, yazılım otomatik olarak telif hakkı kapsamındadır. Bu, diğer geliştiricilerin yazılımı kopyalamak, kullanmak, değiştirmek ve yeniden dağıtmak için açık izne ihtiyaç duyduğu anlamına gelir.

source: Open source licensing is a way of explicitly granting such permission in a relatively consistent way, allowing developers to share and collaborate efficiently by making common solutions to various problems freely available. This leaves many developers free to spend more time focusing on the problems that are relatively unique to their specific situation.
tr: Açık kaynak lisanslama, bu tür bir izni nispeten tutarlı bir şekilde açıkça vermenin bir yoludur ve geliştiricilerin çeşitli sorunlara ücretsiz olarak ortak çözümler sunarak verimli bir şekilde paylaşmasına ve işbirliği yapmasına olanak tanır. Bu, birçok geliştiricinin kendi özel durumlarına nispeten benzersiz olan sorunlara odaklanmak için daha fazla zaman harcamasına izin verir.

source: The distribution tools provided with Python are designed to make it reasonably straightforward for developers to make their own contributions back to that common pool of software if they choose to do so.
tr: Python ile sağlanan dağıtım araçları, geliştiricilerin, isterlerse bu ortak yazılım havuzuna kendi katkılarını yapmalarını makul ölçüde basit hale getirmek için tasarlanmıştır.

source: The same distribution tools can also be used to distribute software within an organisation, regardless of whether that software is published as open source software or not.
tr: Aynı dağıtım araçları, yazılımın açık kaynaklı yazılım olarak yayınlanıp yayınlanmadığına bakılmaksızın, bir kuruluş içinde yazılımı dağıtmak için de kullanılabilir.

source: Installing the tools
tr: Araçları yükleme

source: The standard library does not include build tools that support modern Python packaging standards, as the core development team has found that it is important to have standard tools that work consistently, even on older versions of Python.
tr: Çekirdek geliştirme ekibi, Python'un eski sürümlerinde bile tutarlı bir şekilde çalışan standart araçlara sahip olmanın önemli olduğunu keşfettiğinden, standart kütüphane, modern Python paketleme standartlarını destekleyen derleme araçlarını içermez.

source: The currently recommended build and distribution tools can be installed by invoking the ``pip`` module at the command line::
tr: Şu anda önerilen derleme ve dağıtım araçları, komut satırında ``pip`` modülü çağrılarak kurulabilir::

source: For POSIX users (including macOS and Linux users), these instructions assume the use of a :term:`virtual environment`.
tr: POSIX kullanıcıları için (macOS ve Linux kullanıcıları dahil), bu talimatlar bir :term:`virtual environment` kullanıldığını varsayar.

source: For Windows users, these instructions assume that the option to adjust the system PATH environment variable was selected when installing Python.
tr: Windows kullanıcıları için bu talimatlar, Python'u kurarken sistem PATH ortam değişkenini ayarlama seçeneğinin seçildiğini varsayar.

source: The Python Packaging User Guide includes more details on the `currently recommended tools`_.
tr: Python Packaging Kullanıcı Kılavuzu, `currently recommended tools`_ hakkında daha fazla ayrıntı içerir.

source: Reading the Python Packaging User Guide
tr: Python Paketleme Kullanım Kılavuzunu Okumak

source: The Python Packaging User Guide covers the various key steps and elements involved in creating and publishing a project:
tr: Python Paketleme Kullanıcı Kılavuzu, bir proje oluşturma ve yayınlamayla ilgili çeşitli temel adımları ve öğeleri kapsar:

source: `Project structure`_
tr: `(en) Proje Yapısı <Project structure_>`_ ;

source: `Building and packaging the project`_
tr: `(en) Projeyi inşa etmek ve paketlemek <Building and packaging the project_>`_ ;

source: `Uploading the project to the Python Package Index`_
tr: `(en) Projeyi Python Paket Dizinine yükleme <Uploading the project to the Python Packaging Index_>`_ ;

source: `The .pypirc file`_
tr: `(en) .pypirc dosyası <The .pypirc file_>`_.

source: How do I...?
tr: Nasıl yaparım...?

source: These are quick answers or links for some common tasks.
tr: Bunlar, bazı genel görevler için hızlı yanıtlar veya bağlantılardır.

source: ... choose a name for my project?
tr: ... projem için bir isim seçer misin?

source: This isn't an easy topic, but here are a few tips:
tr: Bu kolay bir başlık değil, ancak işte birkaç ipucu:

source: check the Python Package Index to see if the name is already in use
tr: adın zaten kullanımda olup olmadığını görmek için Python Paket Dizini'ni kontrol edin

source: check popular hosting sites like GitHub, Bitbucket, etc to see if there is already a project with that name
tr: Bu ada sahip bir proje olup olmadığını görmek için GitHub, Bitbucket vb. gibi popüler barındırma sitelerini kontrol edin.

source: check what comes up in a web search for the name you're considering
tr: düşündüğünüz isim için bir web aramasında ne çıktığını kontrol edin

source: avoid particularly common words, especially ones with multiple meanings, as they can make it difficult for users to find your software when searching for it
tr: kullanıcıların yazılımınızı ararken bulmasını zorlaştırabileceğinden, özellikle birden çok anlamı olan yaygın sözcüklerden kaçının

source: ... create and distribute binary extensions?
tr: ... ikili uzantılar oluşturup dağıtmak?

source: This is actually quite a complex topic, with a variety of alternatives available depending on exactly what you're aiming to achieve. See the Python Packaging User Guide for more information and recommendations.
tr: Bu aslında oldukça karmaşık bir konudur ve tam olarak neyi başarmayı amaçladığınıza bağlı olarak çeşitli alternatifler mevcuttur. Daha fazla bilgi ve öneriler için Python Paketleme Kullanıcı Kılavuzuna bakın.

source: `Python Packaging User Guide: Binary Extensions <https://packaging.python.org/guides/packaging-binary-extensions/>`__
tr: `Python Paketleme Kullanıcı Kılavuzu: İkili Uzantılar <https://packaging.python.org/guides/packaging-binary-extensions/>`__
