Repository: python/python-docs-tr
Catalog: install/index.po
Languages: tr

source: The advantage of using this scheme compared to the other ones described below is that the user site-packages directory is under normal conditions always included in :data:`sys.path` (see :mod:`site` for more information), which means that there is no additional step to perform after running the :file:`setup.py` script to finalize the installation.
tr: Aşağıda açıklanan diğerlerine kıyasla bu şemayı kullanmanın avantajı, normal koşullar altında kullanıcı site paketleri dizininin her zaman :data:`sys.path` (daha fazla bilgi için :mod:`site` bölümüne bakın) içinde bulunmasıdır. bu, kurulumu tamamlamak için :file:`setup.py` betiğini çalıştırdıktan sonra gerçekleştirilecek ek bir adım olmadığı anlamına gelir.

source: The :command:`build_ext` command also has a ``--user`` option to add :file:`{userbase}/include` to the compiler search path for header files and :file:`{userbase}/lib` to the compiler search path for libraries as well as to the runtime search path for shared C libraries (rpath).
tr: :command:`build_ext` komutu ayrıca başlık dosyaları ve :file:`{userbase}/lib` için derleyici arama yoluna :file:`{userbase}/include` eklemek için bir ``--user`` seçeneğine sahiptir. kütüphaneler için derleyici arama yolunun yanı sıra paylaşılan C kütüphaneleri (rpath) için çalışma zamanı arama yoluna.

source: Alternate installation: the home scheme
tr: Alternatif kurulum: ev şeması

source: The idea behind the "home scheme" is that you build and maintain a personal stash of Python modules. This scheme's name is derived from the idea of a "home" directory on Unix, since it's not unusual for a Unix user to make their home directory have a layout similar to :file:`/usr/` or :file:`/usr/local/`. This scheme can be used by anyone, regardless of the operating system they are installing for.
tr: "Ev planı"nın arkasındaki fikir, Python modüllerinin kişisel bir zulasını oluşturmanız ve sürdürmenizdir. Bu şemanın adı, Unix'teki bir "ev" dizini fikrinden türetilmiştir, çünkü bir Unix kullanıcısının ev dizininin :file:`/usr/` veya :file:`/usr'ye benzer bir düzene sahip olması alışılmadık bir durum değildir. /yerel/`. Bu şema, yükledikleri işletim sistemi ne olursa olsun herkes tarafından kullanılabilir.

source: Installing a new module distribution is as simple as ::
tr: Yeni bir modül dağıtımı kurmak şu kadar basittir ::

source: where you can supply any directory you like for the :option:`!--home` option. On Unix, lazy typists can just type a tilde (``~``); the :command:`install` command will expand this to your home directory::
tr: burada :option:`!--home` seçeneği için istediğiniz dizini sağlayabilirsiniz. Unix'te tembel daktilo yazarları yalnızca bir yaklaşık işareti (``~``) yazabilir; :command:`install` komutu bunu ana dizininize genişletecektir::

source: To make Python find the distributions installed with this scheme, you may have to :ref:`modify Python's search path <inst-search-path>` or edit :mod:`sitecustomize` (see :mod:`site`) to call :func:`site.addsitedir` or edit :data:`sys.path`.
tr: Python'un bu şema ile kurulu dağıtımları bulmasını sağlamak için, :ref:`modify Python's search path <inst-search-path>` değiştirmeniz veya aramak için :mod:`sitecustomize` (bkz. :mod:`site`) düzenlemeniz gerekebilir. :func:`site.addsitedir` veya :data:`sys.path` düzenleyin.

source: The :option:`!--home` option defines the installation base directory. Files are installed to the following directories under the installation base as follows:
tr: :option:`!--home` seçeneği, kurulum temel dizinini tanımlar. Dosyalar, kurulum tabanının altındaki aşağıdaki dizinlere aşağıdaki şekilde kurulur:

source: (Mentally replace slashes with backslashes if you're on Windows.)
tr: (Windows kullanıyorsanız, eğik çizgileri zihinsel olarak ters eğik çizgiyle değiştirin.)

source: Alternate installation: Unix (the prefix scheme)
tr: Alternatif kurulum: Unix (ön ek (prefix) şeması)

source: The "prefix scheme" is useful when you wish to use one Python installation to perform the build/install (i.e., to run the setup script), but install modules into the third-party module directory of a different Python installation (or something that looks like a different Python installation). If this sounds a trifle unusual, it is---that's why the user and home schemes come before. However, there are at least two known cases where the prefix scheme will be useful.
tr: "Prefix şeması", oluşturma/kurulum işlemini gerçekleştirmek için (yani kurulum komut dosyasını çalıştırmak için) bir Python kurulumu kullanmak istediğinizde, ancak modülleri farklı bir Python kurulumunun (veya farklı bir Python kurulumuna benziyor). Bu kulağa biraz olağandışı geliyorsa, bu--kullanıcı ve ev şemalarının önce gelmesinin nedeni budur. Bununla birlikte, prefix şemasının yararlı olacağı bilinen en az iki durum vardır.

source: First, consider that many Linux distributions put Python in :file:`/usr`, rather than the more traditional :file:`/usr/local`. This is entirely appropriate, since in those cases Python is part of "the system" rather than a local add-on. However, if you are installing Python modules from source, you probably want them to go in :file:`/usr/local/lib/python2.{X}` rather than :file:`/usr/lib/python2.{X}`. This can be done with ::
tr: İlk olarak, birçok Linux dağıtımının Python'u daha geleneksel :file:`/usr/local` yerine :file:`/usr` içine koyduğunu düşünün. Bu tamamen uygundur, çünkü bu durumlarda Python yerel bir eklentiden ziyade "sistemin" bir parçasıdır. Ancak, Python modüllerini kaynaktan kuruyorsanız, muhtemelen bunların :file:`/usr/lib/python2 yerine :file:`/usr/local/lib/python2.{X}` içine girmesini istersiniz.{X }`. Şu şekilde yapılabilir ::

source: Another possibility is a network filesystem where the name used to write to a remote directory is different from the name used to read it: for example, the Python interpreter accessed as :file:`/usr/local/bin/python` might search for modules in :file:`/usr/local/lib/python2.{X}`, but those modules would have to be installed to, say, :file:`/mnt/{@server}/export/lib/python2.{X}`. This could be done with ::
tr: Başka bir olasılık, uzak bir dizine yazmak için kullanılan adın onu okumak için kullanılan addan farklı olduğu bir ağ dosya sistemidir: örneğin, :file:`/usr/local/bin/python` olarak erişilen Python yorumlayıcısı için arama yapabilir. modüller :file:`/usr/local/lib/python2.{X}` dizinindedir, ancak bu modüllerin örneğin :file:`/mnt/{@server}/export/lib/python2 konumuna yüklenmesi gerekir. {X}`. Şu şekilde yapılabilir ::

source: In either case, the :option:`!--prefix` option defines the installation base, and the :option:`!--exec-prefix` option defines the platform-specific installation base, which is used for platform-specific files. (Currently, this just means non-pure module distributions, but could be expanded to C libraries, binary executables, etc.) If :option:`!--exec-prefix` is not supplied, it defaults to :option:`!--prefix`. Files are installed as follows:
tr: Her iki durumda da, :option:`!--prefix` seçeneği kurulum tabanını tanımlar ve :option:`!--exec-prefix` seçeneği platforma özel dosyalar için kullanılan platforma özel kurulum tabanını tanımlar. . (Şu anda, bu yalnızca saf olmayan modül dağıtımları anlamına gelir, ancak C kütüphanelerine, ikili yürütülebilir dosyalara vb. genişletilebilir.) :option:`!--exec-prefix` sağlanmazsa, varsayılan olarak :option:`! --prefix`. Dosyalar aşağıdaki gibi yüklenir:

source: Python modules
tr: Python modülleri

source: extension modules
tr: extension (uzatma) modülleri

source: There is no requirement that :option:`!--prefix` or :option:`!--exec-prefix` actually point to an alternate Python installation; if the directories listed above do not already exist, they are created at installation time.
tr: :option:`!--prefix` veya :option:`!--exec-prefix` 'in aslında alternatif bir Python kurulumuna işaret etmesi gerekliliği yoktur; yukarıda listelenen dizinler zaten mevcut değilse, kurulum sırasında oluşturulurlar.

source: Incidentally, the real reason the prefix scheme is important is simply that a standard Unix installation uses the prefix scheme, but with :option:`!--prefix` and :option:`!--exec-prefix` supplied by Python itself as ``sys.prefix`` and ``sys.exec_prefix``. Thus, you might think you'll never use the prefix scheme, but every time you run ``python setup.py install`` without any other options, you're using it.
tr: Bu arada, önek şemasının önemli olmasının gerçek nedeni, standart bir Unix kurulumunun örnek şemasını kullanmasıdır, ancak :option:`!--prefix` ve :option:`!--exec-prefix` Python'un kendisi tarafından sağlanır. ``sys.prefix`` ve ``sys.exec_prefix``. Bu nedenle, önek şemasını asla kullanmayacağınızı düşünebilirsiniz, ancak ``python setup.py install`` dosyasını başka bir seçenek olmadan her çalıştırdığınızda, onu kullanıyorsunuz.

source: Note that installing extensions to an alternate Python installation has no effect on how those extensions are built: in particular, the Python header files (:file:`Python.h` and friends) installed with the Python interpreter used to run the setup script will be used in compiling extensions. It is your responsibility to ensure that the interpreter used to run extensions installed in this way is compatible with the interpreter used to build them. The best way to do this is to ensure that the two interpreters are the same version of Python (possibly different builds, or possibly copies of the same build). (Of course, if your :option:`!--prefix` and :option:`!--exec-prefix` don't even point to an alternate Python installation, this is immaterial.)
tr: Alternatif bir Python kurulumuna uzantı yüklemenin, bu uzantıların nasıl oluşturulduğu üzerinde hiçbir etkisi olmadığını unutmayın: özellikle, kurulum komut dosyasını çalıştırmak için kullanılan Python yorumlayıcısı ile yüklenen Python başlık dosyaları (:file:`Python.h` ve arkadaşları) uzantıların derlenmesinde kullanılabilir. Bu şekilde yüklenen uzantıları çalıştırmak için kullanılan yorumlayıcının, bunları oluşturmak için kullanılan yorumlayıcıyla uyumlu olmasını sağlamak sizin sorumluluğunuzdadır. Bunu yapmanın en iyi yolu, iki yorumlayıcının aynı Python sürümü (muhtemelen farklı yapılar veya muhtemelen aynı yapının kopyaları) olduğundan emin olmaktır. (Elbette, :option:`!--prefix` ve :option:`!--exec-prefix` öğeleriniz alternatif bir Python kurulumuna işaret etmiyorsa, bu önemsizdir.)

source: Alternate installation: Windows (the prefix scheme)
tr: Alternatif kurulum: Windows (ön ek şeması)

source: Windows has no concept of a user's home directory, and since the standard Python installation under Windows is simpler than under Unix, the :option:`!--prefix` option has traditionally been used to install additional packages in separate locations on Windows. ::
tr: Windows'ta bir kullanıcının ev dizini kavramı yoktur ve Windows altında standart Python kurulumu Unix'e göre daha basit olduğundan, :option:`!--prefix` seçeneği geleneksel olarak Windows'ta ayrı konumlara ek paketler kurmak için kullanılmıştır. ::

source: to install modules to the :file:`\\Temp\\Python` directory on the current drive.
tr: modülleri geçerli sürücüdeki :file:`\\Temp\\Python` dizinine kurmak için.

source: The installation base is defined by the :option:`!--prefix` option; the :option:`!--exec-prefix` option is not supported under Windows, which means that pure Python modules and extension modules are installed into the same location. Files are installed as follows:
tr: Kurulum tabanı :option:`!--prefix` seçeneği ile tanımlanır; :option:`!--exec-prefix` seçeneği Windows'ta desteklenmez, bu da saf Python modüllerinin ve genişletme modüllerinin aynı konuma kurulu olduğu anlamına gelir. Dosyalar aşağıdaki gibi yüklenir:

source: Custom Installation
tr: Özel Kurulum

source: Sometimes, the alternate installation schemes described in section :ref:`inst-alt-install` just don't do what you want. You might want to tweak just one or two directories while keeping everything under the same base directory, or you might want to completely redefine the installation scheme. In either case, you're creating a *custom installation scheme*.
tr: Bazen, :ref:`inst-alt-install` bölümünde açıklanan alternatif kurulum şemaları istediğinizi yapmaz. Her şeyi aynı temel dizin altında tutarken yalnızca bir veya iki dizinde ince ayar yapmak veya kurulum şemasını tamamen yeniden tanımlamak isteyebilirsiniz. Her iki durumda da *özel bir yükleme şeması* oluşturuyorsunuz.

source: To create a custom installation scheme, you start with one of the alternate schemes and override some of the installation directories used for the various types of files, using these options:
tr: Özel bir kurulum şeması oluşturmak için, alternatif şemalardan biriyle başlarsınız ve aşağıdaki seçenekleri kullanarak çeşitli dosya türleri için kullanılan bazı kurulum dizinlerini geçersiz kılarsınız:

source: Override option
tr: Geçersiz kılma seçeneği

source: all modules
tr: tüm modüller

source: These override options can be relative, absolute, or explicitly defined in terms of one of the installation base directories. (There are two installation base directories, and they are normally the same---they only differ when you use the Unix "prefix scheme" and supply different ``--prefix`` and ``--exec-prefix`` options; using ``--install-lib`` will override values computed or given for ``--install-purelib`` and ``--install-platlib``, and is recommended for schemes that don't make a difference between Python and extension modules.)
tr: Bu geçersiz kılma seçenekleri göreli, mutlak veya kurulum temel dizinlerinden biri açısından açıkça tanımlanmış olabilir. (İki kurulum temel dizini vardır ve bunlar normalde aynıdır -- yalnızca Unix "ön ek şeması" kullandığınızda ve farklı ``--prefix`` ve ``--exec-prefix`` seçenekleri sağladığınızda farklılık gösterirler; ``--install-lib`` kullanmak, ``--install-purelib`` ve ``--install-platlib`` için hesaplanan veya verilen değerleri geçersiz kılar ve fark yaratmayan şemalar için Python ve uzatma modülleri arasında önerilir.)

source: For example, say you're installing a module distribution to your home directory under Unix---but you want scripts to go in :file:`~/scripts` rather than :file:`~/bin`. As you might expect, you can override this directory with the :option:`!--install-scripts` option; in this case, it makes most sense to supply a relative path, which will be interpreted relative to the installation base directory (your home directory, in this case)::
tr: Örneğin, Unix altında ana dizininize bir modül dağıtımı kurduğunuzu, ancak komut dosyalarının :file:`~/bin` yerine :file:`~/scripts` içine girmesini istediğinizi varsayalım. Tahmin edebileceğiniz gibi, bu dizini :option:`!--install-scripts` seçeneği ile geçersiz kılabilirsiniz; bu durumda, kurulum temel dizinine (bu durumda ana dizininiz) göre yorumlanacak olan bir göreli yol sağlamak en mantıklısı olur:

source: Another Unix example: suppose your Python installation was built and installed with a prefix of :file:`/usr/local/python`, so under a standard installation scripts will wind up in :file:`/usr/local/python/bin`. If you want them in :file:`/usr/local/bin` instead, you would supply this absolute directory for the :option:`!--install-scripts` option::
tr: Başka bir Unix örneği: Python kurulumunuzun :file:`/usr/local/python` ön ekiyle oluşturulduğunu ve kurulduğunu varsayalım, bu nedenle standart bir kurulum komut dosyaları altında :file:`/usr/local/python/bin` olarak kurulacaktır. Bunların yerine :file:`/usr/local/bin` içinde olmasını istiyorsanız, :option:`!--install-scripts` seçeneği için bu mutlak dizini sağlarsınız:

source: (This performs an installation using the "prefix scheme", where the prefix is whatever your Python interpreter was installed with--- :file:`/usr/local/python` in this case.)
tr: (Bu, "ön ek şemasını" kullanarak bir yükleme gerçekleştirir; burada önek, bu durumda Python yorumlayıcınız-- :file:`/usr/local/python` ile birlikte yüklenir.)

source: If you maintain Python on Windows, you might want third-party modules to live in a subdirectory of :file:`{prefix}`, rather than right in :file:`{prefix}` itself. This is almost as easy as customizing the script installation directory---you just have to remember that there are two types of modules to worry about, Python and extension modules, which can conveniently be both controlled by one option::
tr: Python'u Windows'ta kullanıyorsanız, üçüncü taraf modüllerin doğrudan :file:`{prefix}` içinde değil, :file:`{prefix}` alt dizininde yaşamasını isteyebilirsiniz. Bu neredeyse komut dosyası yükleme dizinini özelleştirmek kadar kolaydır -- endişelenmeniz gereken iki tür modül olduğunu hatırlamanız yeterlidir: Python ve genişletme modülleri, her ikisi de tek bir seçenekle kolayca kontrol edilebilir:

source: The specified installation directory is relative to :file:`{prefix}`. Of course, you also have to ensure that this directory is in Python's module search path, such as by putting a :file:`.pth` file in a site directory (see :mod:`site`). See section :ref:`inst-search-path` to find out how to modify Python's search path.
tr: Belirtilen kurulum dizini :file:`{prefix}` ile ilişkilidir. Elbette, örneğin bir site dizinine bir :file:`.pth` dosyası koyarak (bkz. :mod:`site`) bu dizinin Python'un modül arama yolunda olduğundan emin olmalısınız. Python'un arama yolunu nasıl değiştireceğinizi öğrenmek için :ref:`inst-search-path` bölümüne bakın.

source: If you want to define an entire installation scheme, you just have to supply all of the installation directory options. The recommended way to do this is to supply relative paths; for example, if you want to maintain all Python module-related files under :file:`python` in your home directory, and you want a separate directory for each platform that you use your home directory from, you might define the following installation scheme::
tr: Tüm bir kurulum şemasını tanımlamak istiyorsanız, tüm kurulum dizini seçeneklerini sağlamanız yeterlidir. Bunu yapmanın önerilen yolu, göreli yollar sağlamaktır; örneğin, Python modülü ile ilgili tüm dosyaları ana dizininizde :file:`python` altında tutmak istiyorsanız ve ana dizininizi kullandığınız her platform için ayrı bir dizin istiyorsanız, aşağıdaki kurulum şemasını tanımlayabilirsiniz. ::

source: or, equivalently, ::
tr: veya eş değer olarak, ::

source: ``$PLAT`` is not (necessarily) an environment variable---it will be expanded by the Distutils as it parses your command line options, just as it does when parsing your configuration file(s).
tr: ``$PLAT`` (zorunlu olarak) bir ortam değişkeni değildir -- yapılandırma dosya(lar)ınızı ayrıştırırken yaptığı gibi, komut satırı seçeneklerinizi ayrıştırırken Distutils tarafından genişletilecektir.

source: Obviously, specifying the entire installation scheme every time you install a new module distribution would be very tedious. Thus, you can put these options into your Distutils config file (see section :ref:`inst-config-files`):
tr: Açıkçası, her yeni modül dağıtımı kurduğunuzda tüm kurulum şemasını belirtmek çok sıkıcı olacaktır. Böylece, bu seçenekleri Distutils yapılandırma dosyanıza koyabilirsiniz (bkz. :ref:`inst-config-files` bölümü):

source: or, equivalently,
tr: veya eş değer olarak,

source: Note that these two are *not* equivalent if you supply a different installation base directory when you run the setup script. For example, ::
tr: Kurulum komut dosyasını çalıştırırken farklı bir kurulum temel dizini sağlarsanız, bu ikisinin eş değer *değil* olduğunu unutmayın. Örneğin, ::

source: would install pure modules to :file:`/tmp/python/lib` in the first case, and to :file:`/tmp/lib` in the second case. (For the second case, you probably want to supply an installation base of :file:`/tmp/python`.)
tr: saf modülleri ilk durumda :file:`/tmp/python/lib` dizinine ve ikinci durumda :file:`/tmp/lib` dizinine kurardı. (İkinci durum için, muhtemelen bir :file:`/tmp/python` kurulum tabanı sağlamak istersiniz.)

source: You probably noticed the use of ``$HOME`` and ``$PLAT`` in the sample configuration file input. These are Distutils configuration variables, which bear a strong resemblance to environment variables. In fact, you can use environment variables in config files on platforms that have such a notion but the Distutils additionally define a few extra variables that may not be in your environment, such as ``$PLAT``. (And of course, on systems that don't have environment variables, such as Mac OS 9, the configuration variables supplied by the Distutils are the only ones you can use.) See section :ref:`inst-config-files` for details.
tr: Örnek yapılandırma dosyası girişinde ``$HOME`` ve ``$PLAT`` kullanıldığını muhtemelen fark etmişsinizdir. Bunlar, ortam değişkenlerine güçlü bir benzerlik gösteren Distutils yapılandırma değişkenleridir. Aslında, ortam değişkenlerini böyle bir kavramı olan platformlarda yapılandırma dosyalarında kullanabilirsiniz, ancak Distutils ek olarak ``$PLAT`` gibi ortamınızda olmayabilecek birkaç ekstra değişken tanımlar. Ve elbette, Mac OS 9 gibi ortam değişkenlerine sahip olmayan sistemlerde, yalnızca Distutils tarafından sağlanan yapılandırma değişkenlerini kullanabilirsiniz. Bkz. :ref:`inst-config-files`.

source: When a :ref:`virtual environment <venv-def>` is activated, any options that change the installation path will be ignored from all distutils configuration files to prevent inadvertently installing projects outside of the virtual environment.
tr: Bir :ref:`virtual environment <venv-def>` etkinleştirildiğinde, projelerin yanlışlıkla sanal ortamın dışına kurulmasını önlemek için kurulum yolunu değiştiren tüm seçenekler tüm distutils yapılandırma dosyalarından yok sayılır.

source: Modifying Python's Search Path
tr: Python'un Arama Yolunu Değiştirme

source: When the Python interpreter executes an :keyword:`import` statement, it searches for both Python code and extension modules along a search path. A default value for the path is configured into the Python binary when the interpreter is built. You can determine the path by importing the :mod:`sys` module and printing the value of ``sys.path``. ::
tr: Python yorumlayıcısı bir :keyword:`import` ifadesini çalıştırdığında, bir arama yolu boyunca hem Python kodunu hem de uzantı modüllerini arar. Yorumlayıcı oluşturulduğunda, yol için varsayılan bir değer Python ikili dosyasında yapılandırılır. :mod:`sys` modülünü içe aktararak ve ``sys.path`` değerini yazdırarak yolu belirleyebilirsiniz. ::

source: The null string in ``sys.path`` represents the current working directory.
tr: ``sys.path`` içindeki boş dize, geçerli çalışma dizinini temsil eder.

source: The expected convention for locally installed packages is to put them in the :file:`{...}/site-packages/` directory, but you may want to install Python modules into some arbitrary directory. For example, your site may have a convention of keeping all software related to the web server under :file:`/www`. Add-on Python modules might then belong in :file:`/www/python`, and in order to import them, this directory must be added to ``sys.path``. There are several different ways to add the directory.
tr: Yerel olarak kurulmuş paketler için beklenen kural, onları :file:`{...}/site-packages/` dizinine koymaktır, ancak Python modüllerini rastgele bir dizine kurmak isteyebilirsiniz. Örneğin, sitenizin web sunucusuyla ilgili tüm yazılımları :file:`/www` altında tutma kuralı olabilir. Eklenti Python modülleri daha sonra :file:`/www/python` klasörüne ait olabilir ve bunları içe aktarmak için bu dizinin ``sys.path`` klasörüne eklenmesi gerekir. Dizini eklemenin birkaç farklı yolu vardır.
