Repository: python/python-docs-tr
Catalog: install/index.po
Languages: tr

source: This section describes the necessary steps to use Distutils with the GNU C/C++ compilers in their Cygwin and MinGW distributions. [#]_ For a Python interpreter that was built with Cygwin, everything should work without any of these following steps.
tr: Bu bölüm, Distutils'i GNU C/C++ derleyicileriyle Cygwin ve MinGW dağıtımlarında kullanmak için gerekli adımları açıklar. [#]_ Cygwin ile oluşturulmuş bir Python yorumlayıcısı için, aşağıdaki adımlardan herhangi biri olmadan her şey çalışmalıdır.

source: Not all extensions can be built with MinGW or Cygwin, but many can. Extensions most likely to not work are those that use C++ or depend on Microsoft Visual C extensions.
tr: Tüm uzantılar MinGW veya Cygwin ile oluşturulamaz, ancak çoğu yapılabilir. Çalışmama olasılığı en yüksek olan uzantılar, C++ kullanan veya Microsoft Visual C uzantılarına bağlı olanlardır.

source: To let Distutils compile your extension with Cygwin you have to type::
tr: Distutils'in uzantınızı Cygwin ile derlemesine izin vermek için şunu yazmanız gerekir::

source: and for Cygwin in no-cygwin mode [#]_ or for MinGW type::
tr: ve Cygwin olmayan modda [#]_ Cygwin için veya MinGW tipi için::

source: If you want to use any of these options/compilers as default, you should consider writing it in your personal or system-wide configuration file for Distutils (see section :ref:`inst-config-files`.)
tr: Bu seçeneklerden/derleyicilerden herhangi birini varsayılan olarak kullanmak istiyorsanız, bunu Distutils için kişisel veya sistem genelindeki yapılandırma dosyanıza yazmayı düşünmelisiniz (bkz. :ref:`inst-config-files`.)

source: Older Versions of Python and MinGW
tr: Python ve MinGW'nin Eski Sürümleri

source: The following instructions only apply if you're using a version of Python inferior to 2.4.1 with a MinGW inferior to 3.0.0 (with binutils-2.13.90-20030111-1).
tr: Aşağıdaki talimatlar yalnızca, MinGW'si 3.0.0'dan düşük (binutils-2.13.90-20030111-1 ile) 2.4.1'den düşük bir Python sürümü kullanıyorsanız geçerlidir.

source: These compilers require some special libraries. This task is more complex than for Borland's C++, because there is no program to convert the library. First you have to create a list of symbols which the Python DLL exports. (You can find a good program for this task at https://sourceforge.net/projects/mingw/files/MinGW/Extension/pexports/).
tr: Bu derleyiciler bazı özel kütüphaneler gerektirir. Bu görev, Borland'ın C++'ından daha karmaşıktır çünkü kitaplığı dönüştürecek bir program yoktur. Öncelikle Python DLL'nin dışa aktardığı bir sembol listesi oluşturmalısınız. (Bu görev için iyi bir program https://sourceforge.net/projects/mingw/files/MinGW/Extension/pexports/ adresinde bulabilirsiniz).

source: The location of an installed :file:`python25.dll` will depend on the installation options and the version and language of Windows. In a "just for me" installation, it will appear in the root of the installation directory. In a shared installation, it will be located in the system directory.
tr: Yüklü bir :file:`python25.dll` dosyasının konumu, yükleme seçeneklerine ve Windows sürümüne ve diline bağlı olacaktır. "Sadece benim için" kurulumda, kurulum dizininin kökünde görünecektir. Paylaşılan bir kurulumda, sistem dizininde bulunur.

source: Then you can create from these information an import library for gcc. ::
tr: Ardından bu bilgilerden gcc için bir içe aktarma kitaplığı oluşturabilirsiniz. ::

source: The resulting library has to be placed in the same directory as :file:`python25.lib`. (Should be the :file:`libs` directory under your Python installation directory.)
tr: Ortaya çıkan kütüphane, :file:`python25.lib` ile aynı dizine yerleştirilmelidir. (Python kurulum dizininizin altındaki :file:`libs` dizini olmalıdır.)

source: If your extension uses other libraries (zlib,...) you might have to convert them too. The converted files have to reside in the same directories as the normal libraries do.
tr: Uzantınız başka kütüphaneler (zlib,…) kullanıyorsa, onları da dönüştürmeniz gerekebilir. Dönüştürülen dosyalar, normal kütüphanelerde olduğu gibi aynı dizinlerde bulunmalıdır.

source: `Building Python modules on MS Windows platform with MinGW <https://old.zope.dev/Members/als/tips/win32_mingw_modules>`_
tr: `MinGW ile MS Windows platformunda Python modülleri oluşturma <https://old.zope.org/Members/als/tips/win32_mingw_modules>`_

source: Information about building the required libraries for the MinGW environment.
tr: MinGW ortamı için gerekli kütüphaneleri oluşturmaya ilişkin bilgiler.

source: Footnotes
tr: Dipnotlar

source: This also means you could replace all existing COFF-libraries with OMF-libraries of the same name.
tr: Bu aynı zamanda mevcut tüm COFF-kütüphanelerini aynı adı taşıyan OMF-kütüphaneleriyle değiştirebileceğiniz anlamına gelir.

source: Check https://www.sourceware.org/cygwin/ for more information
tr: Daha fazla bilgi için https://www.sourceware.org/cygwin/ adresini kontrol edin

source: Then you have no POSIX emulation available, but you also don't need :file:`cygwin1.dll`.
tr: O zaman kullanılabilir POSIX öykünmesine sahip değilsiniz, ancak :file:`cygwin1.dll` 'e de ihtiyacınız yok.
