Repository: python/python-docs-tr
Catalog: install/index.po
Languages: tr

source: Installing Python Modules (Legacy version)
tr: Python Modüllerini Yükleme (Eski sürüm)

source: Author
tr: Yazar

source: The entire ``distutils`` package has been deprecated and will be removed in Python 3.12. This documentation is retained as a reference only, and will be removed with the package. See the :ref:`What's New <distutils-deprecated>` entry for more information.
tr: Tüm ``distutils`` paketi kullanımdan kaldırıldı ve Python 3.12'de kaldırılacak. Bu belgeler yalnızca referans olarak tutulur ve paketle birlikte kaldırılacaktır. Daha fazla bilgi için :ref:`What's New <distutils-deprecated>` girişine bakın.

source: The up to date module installation documentation. For regular Python usage, you almost certainly want that document rather than this one.
tr: Güncel modül kurulum belgeleri. Normal Python kullanımı için, neredeyse kesinlikle bu belgeden ziyade o belgeyi istersiniz.

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
tr: Bu belge yalnızca https://setuptools.readthedocs.io/en/latest/setuptools.html adresindeki ``setuptools`` belgeleri burada bulunan ilgili tüm bilgileri bağımsız olarak kapsayana kadar saklanacaktır.

source: This guide only covers the basic tools for building and distributing extensions that are provided as part of this version of Python. Third party tools offer easier to use and more secure alternatives. Refer to the `quick recommendations section <https://packaging.python.org/guides/tool-recommendations/>`__ in the Python Packaging User Guide for more information.
tr: Bu kılavuz yalnızca, Python'un bu sürümünün bir parçası olarak sağlanan uzantıları oluşturmaya ve dağıtmaya yönelik temel araçları kapsar. Üçüncü taraf araçlar, kullanımı daha kolay ve daha güvenli alternatifler sunar. Daha fazla bilgi için Python Paketleme Kullanıcı Kılavuzundaki `hızlı öneriler bölümüne <https://packaging.python.org/guides/tool-recommendations/>`__ bakın.

source: Introduction
tr: Giriş

source: In Python 2.0, the ``distutils`` API was first added to the standard library. This provided Linux distro maintainers with a standard way of converting Python projects into Linux distro packages, and system administrators with a standard way of installing them directly onto target systems.
tr: Python 2.0'da ``distutils`` API'ı ilk olarak standart kitaplığa eklendi. Bu, Linux dağıtım yöneticilerine Python projelerini Linux dağıtım paketlerine dönüştürmenin standart bir yolunu ve sistem yöneticilerine bunları doğrudan hedef sistemlere yüklemenin standart bir yolunu sağladı.

source: In the many years since Python 2.0 was released, tightly coupling the build system and package installer to the language runtime release cycle has turned out to be problematic, and it is now recommended that projects use the ``pip`` package installer and the ``setuptools`` build system, rather than using ``distutils`` directly.
tr: Python 2.0'ın piyasaya sürülmesinden bu yana geçen uzun yıllardan bu yana, yapı sistemi ve paket yükleyiciyi dil çalışma zamanı sürüm döngüsüne sıkı bir şekilde bağlamak sorunlu hale geldi ve artık projelerin ``pip`` paket yükleyicisini ve doğrudan ``distutils`` kullanmak yerine ``setuptools`` yapı sistemi.

source: See :ref:`installing-index` and :ref:`distributing-index` for more details.
tr: Daha fazla ayrıntı için :ref:`installing-index` ve :ref:`distributing-index` 'e bakın.

source: This legacy documentation is being retained only until we're confident that the ``setuptools`` documentation covers everything needed.
tr: Bu eski belgeler, yalnızca ``setuptools`` belgelerinin gereken her şeyi kapsadığından emin olana kadar tutulur.

source: Distutils based source distributions
tr: Distutils tabanlı kaynak dağıtımları

source: If you download a module source distribution, you can tell pretty quickly if it was packaged and distributed in the standard way, i.e. using the Distutils. First, the distribution's name and version number will be featured prominently in the name of the downloaded archive, e.g. :file:`foo-1.0.tar.gz` or :file:`widget-0.9.7.zip`. Next, the archive will unpack into a similarly named directory: :file:`foo-1.0` or :file:`widget-0.9.7`. Additionally, the distribution will contain a setup script :file:`setup.py`, and a file named :file:`README.txt` or possibly just :file:`README`, which should explain that building and installing the module distribution is a simple matter of running one command from a terminal::
tr: Bir modül kaynak dağıtımı indirirseniz, bunun standart bir şekilde, yani Distutils kullanılarak paketlenip dağıtılmadığını oldukça hızlı bir şekilde anlayabilirsiniz. İlk olarak, dağıtımın adı ve sürüm numarası, indirilen arşivin adında belirgin bir şekilde yer alacaktır, ör. :file:`foo-1.0.tar.gz` veya :file:`widget-0.9.7.zip`. Ardından, arşiv benzer adlı bir dizine açılır: :file:`foo-1.0` veya :file:`widget-0.9.7`. Ek olarak, dağıtım bir kurulum komut dosyası :file:`setup.py` ve :file:`README.txt` veya muhtemelen sadece :file:`README` adlı bir dosya içerecek ve modül dağıtımının oluşturulması ve kurulmasınının bir terminalden bir komut çalıştırmanın basit bir meselesi olduğunu açıklamalıdır::

source: For Windows, this command should be run from a command prompt window (:menuselection:`Start --> Accessories`)::
tr: Windows için bu komut bir komut istemi penceresinden çalıştırılmalıdır (:menuselection:`Start --> Accessories`)::

source: If all these things are true, then you already know how to build and install the modules you've just downloaded: Run the command above. Unless you need to install things in a non-standard way or customize the build process, you don't really need this manual. Or rather, the above command is everything you need to get out of this manual.
tr: Tüm bunlar doğruysa, yeni indirdiğiniz modülleri nasıl oluşturacağınızı ve kuracağınızı zaten biliyorsunuzdur: Yukarıdaki komutu çalıştırın. Standart olmayan bir şekilde bir şeyler kurmanız veya oluşturma sürecini özelleştirmeniz gerekmiyorsa, bu kılavuza gerçekten ihtiyacınız yoktur. Veya daha doğrusu, yukarıdaki komut, bu kılavuzdan çıkmanız için ihtiyacınız olan her şeydir.

source: Standard Build and Install
tr: Standart Derleme ve Yükleme

source: As described in section :ref:`inst-new-standard`, building and installing a module distribution using the Distutils is usually one simple command to run from a terminal::
tr: :ref:`inst-new-standard` bölümünde açıklandığı gibi, Distutils kullanarak bir modül dağıtımı oluşturmak ve kurmak genellikle bir terminalden çalıştırılacak basit bir komuttur::

source: Platform variations
tr: Platform varyasyonları

source: You should always run the setup command from the distribution root directory, i.e. the top-level subdirectory that the module source distribution unpacks into. For example, if you've just downloaded a module source distribution :file:`foo-1.0.tar.gz` onto a Unix system, the normal thing to do is::
tr: Kurulum komutunu her zaman dağıtım kök dizininden, yani modül kaynak dağıtımının paketini açtığı en üst düzey alt dizinden çalıştırmalısınız. Örneğin, bir Unix sistemine yeni bir kaynak dağıtımı :file:`foo-1.0.tar.gz` indirdiyseniz, yapmanız gereken normal şey:

source: On Windows, you'd probably download :file:`foo-1.0.zip`. If you downloaded the archive file to :file:`C:\\Temp`, then it would unpack into :file:`C:\\Temp\\foo-1.0`; you can use either an archive manipulator with a graphical user interface (such as WinZip) or a command-line tool (such as :program:`unzip` or :program:`pkunzip`) to unpack the archive. Then, open a command prompt window and run::
tr: Windows'ta muhtemelen :file:`foo-1.0.zip` dosyasını indirirsiniz. Arşiv dosyasını :file:`C:\\Temp` konumuna indirdiyseniz, paketinden :file:`C:\\Temp\\foo-1.0`; arşivi açmak için grafiksel kullanıcı arabirimli bir arşiv manipülatörü (WinZip gibi) veya bir komut satırı aracı (örneğin :program:`unzip` veya :program:`pkunzip`) kullanabilirsiniz. Ardından, bir komut istemi penceresi açın ve şunu çalıştırın::

source: Splitting the job up
tr: İşi bölmek

source: Running ``setup.py install`` builds and installs all modules in one run. If you prefer to work incrementally---especially useful if you want to customize the build process, or if things are going wrong---you can use the setup script to do one thing at a time. This is particularly helpful when the build and install will be done by different users---for example, you might want to build a module distribution and hand it off to a system administrator for installation (or do it yourself, with super-user privileges).
tr: ``setup.py install`` çalıştırıldığında, tüm modüller tek bir çalıştırmada oluşturulur ve kurulur. Kademeli olarak çalışmayı tercih ediyorsanız -- özellikle oluşturma sürecini özelleştirmek istiyorsanız veya işler ters gidiyorsa kullanışlıdır -- her seferinde bir şey yapmak için kurulum komut dosyasını kullanabilirsiniz. Bu, özellikle derleme ve yükleme farklı kullanıcılar tarafından yapılacaksa yararlıdır -- örneğin, bir modül dağıtımı oluşturmak ve yükleme için bir sistem yöneticisine teslim etmek (veya süper kullanıcı ayrıcalıklarıyla kendiniz yapmak) isteyebilirsiniz. ).

source: For example, you can build everything in one step, and then install everything in a second step, by invoking the setup script twice::
tr: Örneğin, her şeyi bir adımda oluşturabilir ve ardından kurulum komut dosyasını iki kez çağırarak her şeyi ikinci bir adımda yükleyebilirsiniz:

source: If you do this, you will notice that running the :command:`install` command first runs the :command:`build` command, which---in this case---quickly notices that it has nothing to do, since everything in the :file:`build` directory is up-to-date.
tr: Bunu yaparsanız, :command:`install` komutunu çalıştırmanın önce :command:`build` komutunu çalıştırdığını fark edeceksiniz, bu komut --bu durumda --hızlı bir şekilde ilgisi olmadığını fark edecek, çünkü her şey :file:`build` dizini günceldir.

source: You may not need this ability to break things down often if all you do is install modules downloaded off the 'net, but it's very handy for more advanced tasks. If you get into distributing your own Python modules and extensions, you'll run lots of individual Distutils commands on their own.
tr: Tek yapmanız gereken ağdan indirilen modülleri kurmaksa, işleri parçalamak için bu yeteneğe ihtiyacınız olmayabilir, ancak daha gelişmiş görevler için çok kullanışlıdır. Kendi Python modüllerinizi ve uzantılarınızı dağıtmaya başlarsanız, birçok Distutils komutunu kendi başlarına çalıştıracaksınız.

source: How building works
tr: Building nasıl çalışır

source: As implied above, the :command:`build` command is responsible for putting the files to install into a *build directory*. By default, this is :file:`build` under the distribution root; if you're excessively concerned with speed, or want to keep the source tree pristine, you can change the build directory with the :option:`!--build-base` option. For example::
tr: Yukarıda belirtildiği gibi, :command:`build` komutu, kurulacak dosyaların bir *build directory* ye yerleştirilmesinden sorumludur. Varsayılan olarak, bu, dağıtım kökünün altındaki :file:`build` 'dir; Hızla aşırı derecede ilgileniyorsanız veya kaynak ağacı bozulmamış tutmak istiyorsanız, derleme dizinini :option:`!--build-base` seçeneğiyle değiştirebilirsiniz. Örneğin::

source: (Or you could do this permanently with a directive in your system or personal Distutils configuration file; see section :ref:`inst-config-files`.) Normally, this isn't necessary.
tr: (Ya da bunu sisteminizdeki veya kişisel Distutils yapılandırma dosyanızdaki bir yönerge ile kalıcı olarak yapabilirsiniz; bkz. bölüm :ref:`inst-config-files`.) Normalde, bu gerekli değildir.

source: The default layout for the build tree is as follows::
tr: Derleme ağacının varsayılan düzeni aşağıdaki gibidir:

source: where ``<plat>`` expands to a brief description of the current OS/hardware platform and Python version. The first form, with just a :file:`lib` directory, is used for "pure module distributions"---that is, module distributions that include only pure Python modules. If a module distribution contains any extensions (modules written in C/C++), then the second form, with two ``<plat>`` directories, is used. In that case, the :file:`temp.{plat}` directory holds temporary files generated by the compile/link process that don't actually get installed. In either case, the :file:`lib` (or :file:`lib.{plat}`) directory contains all Python modules (pure Python and extensions) that will be installed.
tr: burada ``<plat>`` mevcut işletim sistemi/donanım platformunun ve Python sürümünün kısa bir açıklamasına genişler. Yalnızca bir :file:`lib` dizini içeren ilk biçim, "saf modül dağıtımları" için kullanılır---yani, yalnızca salt Python modüllerini içeren modül dağıtımları. Bir modül dağıtımı herhangi bir uzantı içeriyorsa (C/C++ ile yazılmış modüller), o zaman iki ``<plat>`` dizinli ikinci form kullanılır. Bu durumda, :file:`temp.{plat}` dizini, derleme/bağlantı işlemi tarafından oluşturulan ve aslında yüklenmeyen geçici dosyaları tutar. Her iki durumda da, :file:`lib` (veya :file:`lib.{plat}`) dizini, kurulacak tüm Python modüllerini (saf Python ve uzantıları) içerir.

source: In the future, more directories will be added to handle Python scripts, documentation, binary executables, and whatever else is needed to handle the job of installing Python modules and applications.
tr: Gelecekte, Python komut dosyalarını, belgeleri, ikili yürütülebilir dosyaları ve Python modüllerini ve uygulamalarını yükleme işini yürütmek için gereken diğer her şeyi işlemek için daha fazla dizin eklenecektir.

source: How installation works
tr: Kurulum nasıl çalışır

source: After the :command:`build` command runs (whether you run it explicitly, or the :command:`install` command does it for you), the work of the :command:`install` command is relatively simple: all it has to do is copy everything under :file:`build/lib` (or :file:`build/lib.{plat}`) to your chosen installation directory.
tr: :command:`build` komutu çalıştırıldıktan sonra (ister açık bir şekilde çalıştırın, ister :command:`install` komutu sizin için yapar), :command:`install` komutunun çalışması nispeten basittir: sahip olduğu tek şey yapılacak şey :file:`build/lib` (veya :file:`build/lib.{plat}`) altındaki her şeyi seçtiğiniz kurulum dizinine kopyalamaktır.

source: If you don't choose an installation directory---i.e., if you just run ``setup.py install``\ ---then the :command:`install` command installs to the standard location for third-party Python modules. This location varies by platform and by how you built/installed Python itself. On Unix (and macOS, which is also Unix-based), it also depends on whether the module distribution being installed is pure Python or contains extensions ("non-pure"):
tr: Bir kurulum dizini seçmezseniz -- yani, sadece ``setup.py install``\ komutunu çalıştırırsanız -- o zaman :command:`install` komutu üçüncü taraf Python modülleri için standart konuma yüklenir . Bu konum, platforma ve Python'un kendisini nasıl oluşturduğunuza/kurduğunuza göre değişir. Unix'te (ve aynı zamanda Unix tabanlı olan macOS'ta), yüklenen modül dağıtımının saf Python olup olmadığına veya uzantılar ("non pürse") içerip içermediğine de bağlıdır:

source: Standard installation location
tr: Standart kurulum lokasyonu

source: Default value
tr: Varsayılan değer

source: Notes
tr: Notlar

source: Notes:
tr: Notlar:

source: Most Linux distributions include Python as a standard part of the system, so :file:`{prefix}` and :file:`{exec-prefix}` are usually both :file:`/usr` on Linux. If you build Python yourself on Linux (or any Unix-like system), the default :file:`{prefix}` and :file:`{exec-prefix}` are :file:`/usr/local`.
tr: Çoğu Linux dağıtımı Python'u sistemin standart bir parçası olarak içerir, bu nedenle :file:`{prefix}` ve :file:`{exec-prefix}` genellikle Linux'ta :file:`/usr` 'dır. Python'u Linux'ta (veya herhangi bir Unix benzeri sistemde) kendiniz kurarsanız, varsayılan :file:`{prefix}` ve :file:`{exec-prefix}` :file:`/usr/local` şeklindedir.

source: The default installation directory on Windows was :file:`C:\\Program Files\\Python` under Python 1.6a1, 1.5.2, and earlier.
tr: Windows'ta varsayılan kurulum dizini Python 1.6a1, 1.5.2 ve önceki sürümlerde :file:`C:\\Program Files\\Python` idi.

source: :file:`{prefix}` and :file:`{exec-prefix}` stand for the directories that Python is installed to, and where it finds its libraries at run-time. They are always the same under Windows, and very often the same under Unix and macOS. You can find out what your Python installation uses for :file:`{prefix}` and :file:`{exec-prefix}` by running Python in interactive mode and typing a few simple commands. Under Unix, just type ``python`` at the shell prompt. Under Windows, choose :menuselection:`Start --> Programs --> Python X.Y --> Python (command line)`. Once the interpreter is started, you type Python code at the prompt. For example, on my Linux system, I type the three Python statements shown below, and get the output as shown, to find out my :file:`{prefix}` and :file:`{exec-prefix}`:
tr: :file:`{prefix}` ve :file:`{exec-prefix}` Python'un kurulu olduğu dizinleri ve çalışma zamanında kütüphanelerini nerede bulduğunu gösterir. Windows altında her zaman aynıdırlar ve çoğu zaman Unix ve macOS altında aynıdırlar. Python kurulumunuzun :file:`{prefix}` ve :file:`{exec-prefix}` için ne kullandığını Python'u etkileşimli modda çalıştırarak ve birkaç basit komut yazarak öğrenebilirsiniz. Unix altında, kabuk istemine ``python`` yazmanız yeterlidir. Windows altında, :menuselection:`Başlat --> Programlar --> Python X.Y --> Python (komut satırı)` öğesini seçin. Yorumlayıcı başlatıldığında, komut istemine Python kodunu yazarsınız. Örneğin, Linux sistemimde, :file:`{prefix}` ve :file:`{exec-prefix}` i bulmak için aşağıda gösterilen üç Python ifadesini yazıyorum ve gösterildiği gibi çıktı alıyorum:

source: A few other placeholders are used in this document: :file:`{X.Y}` stands for the version of Python, for example ``3.2``; :file:`{abiflags}` will be replaced by the value of :data:`sys.abiflags` or the empty string for platforms which don't define ABI flags; :file:`{distname}` will be replaced by the name of the module distribution being installed. Dots and capitalization are important in the paths; for example, a value that uses ``python3.2`` on UNIX will typically use ``Python32`` on Windows.
tr: Bu belgede birkaç başka yer tutucu kullanılmıştır: :file:`{X.Y}` Python sürümünü temsil eder, örneğin ``3.2``; :file:`{abiflags}`, :data:`sys.abiflags` değeri veya ABI bayrakları tanımlamayan platformlar için boş dize ile değiştirilecektir; :file:`{distname}`, kurulmakta olan modül dağıtımının adıyla değiştirilecektir. Yollarda noktalar ve büyük harf kullanımı önemlidir; örneğin, UNIX'te ``python3.2`` 'yi kullanan bir değer, Windows'ta genellikle ``Python32`` 'yi kullanır.

source: If you don't want to install modules to the standard location, or if you don't have permission to write there, then you need to read about alternate installations in section :ref:`inst-alt-install`. If you want to customize your installation directories more heavily, see section :ref:`inst-custom-install` on custom installations.
tr: Modülleri standart konuma kurmak istemiyorsanız veya oraya yazma izniniz yoksa, alternatif kurulumlar hakkında :ref:`inst-alt-install` bölümünde okumanız gerekir. Kurulum dizinlerinizi daha yoğun bir şekilde özelleştirmek istiyorsanız, özel kurulumlarla ilgili :ref:`inst-custom-install` bölümüne bakın.

source: Alternate Installation
tr: Alternatif Kurulum

source: Often, it is necessary or desirable to install modules to a location other than the standard location for third-party Python modules. For example, on a Unix system you might not have permission to write to the standard third-party module directory. Or you might wish to try out a module before making it a standard part of your local Python installation. This is especially true when upgrading a distribution already present: you want to make sure your existing base of scripts still works with the new version before actually upgrading.
tr: Çoğu zaman, modüllerin üçüncü taraf Python modülleri için standart konumdan farklı bir konuma kurulması gerekli veya istenir. Örneğin, bir Unix sisteminde standart üçüncü taraf modül dizinine yazma izniniz olmayabilir. Veya bir modülü yerel Python kurulumunuzun standart bir parçası yapmadan önce denemek isteyebilirsiniz. Bu özellikle halihazırda mevcut olan bir dağıtımı yükseltirken geçerlidir: gerçekten yükseltmeden önce mevcut komut dosyası tabanınızın yeni sürümle hala çalıştığından emin olmak istersiniz.

source: The Distutils :command:`install` command is designed to make installing module distributions to an alternate location simple and painless. The basic idea is that you supply a base directory for the installation, and the :command:`install` command picks a set of directories (called an *installation scheme*) under this base directory in which to install files. The details differ across platforms, so read whichever of the following sections applies to you.
tr: Distutils :command:`install` komutu, modül dağıtımlarını alternatif bir konuma yüklemeyi basit ve zahmetsiz hale getirmek için tasarlanmıştır. Temel fikir, kurulum için bir temel dizin sağlamanız ve :command:`install` komutunun, dosyaların kurulacağı bu temel dizin altında bir dizi dizini (*installation scheme* olarak adlandırılır) seçmesidir. Ayrıntılar platformlar arasında farklılık gösterir, bu nedenle aşağıdaki bölümlerden hangisi size uyuyorsa onu okuyun.

source: Note that the various alternate installation schemes are mutually exclusive: you can pass ``--user``, or ``--home``, or ``--prefix`` and ``--exec-prefix``, or ``--install-base`` and ``--install-platbase``, but you can't mix from these groups.
tr: Çeşitli alternatif kurulum şemalarının birbirini dışladığını unutmayın: ``--user`` veya ``--home`` veya ``--prefix`` ve ``--exec-prefix`` iletebilirsiniz, veya ``--install-base`` ve ``--install-platbase``, ancak bu gruplardan karıştıramazsınız.

source: Alternate installation: the user scheme
tr: Alternatif kurulum: kullanıcı şeması

source: This scheme is designed to be the most convenient solution for users that don't have write permission to the global site-packages directory or don't want to install into it. It is enabled with a simple option::
tr: Bu şema, global site paketleri dizinine yazma izni olmayan veya içine yüklemek istemeyen kullanıcılar için en uygun çözüm olacak şekilde tasarlanmıştır. Basit bir seçenekle etkinleştirilir::

source: Files will be installed into subdirectories of :data:`site.USER_BASE` (written as :file:`{userbase}` hereafter). This scheme installs pure Python modules and extension modules in the same location (also known as :data:`site.USER_SITE`). Here are the values for UNIX, including macOS:
tr: Dosyalar :data:`site.USER_BASE` (bundan sonra :file:`{userbase}` şeklinde yazılacaktır) alt dizinlerine kurulacaktır. Bu şema, saf Python modüllerini ve uzantı modüllerini aynı konuma kurar (ayrıca :data:`site.USER_SITE` olarak da bilinir). İşte macOS dahil UNIX değerleri:

source: Type of file
tr: Dosya tipi

source: Installation directory
tr: Kurulum dizini

source: modules
tr: modüller

source: scripts
tr: scriptler

source: C headers
tr: C başlıkları

source: And here are the values used on Windows:
tr: Windows'ta kullanılan değerler:
