Repository: python/python-docs-tr
Catalog: install/index.po
Languages: tr

source: The most convenient way is to add a path configuration file to a directory that's already on Python's path, usually to the :file:`.../site-packages/` directory. Path configuration files have an extension of :file:`.pth`, and each line must contain a single path that will be appended to ``sys.path``. (Because the new paths are appended to ``sys.path``, modules in the added directories will not override standard modules. This means you can't use this mechanism for installing fixed versions of standard modules.)
tr: En uygun yol, zaten Python'un yolunda bulunan bir dizine, genellikle :file:`…/site-packages/` dizinine bir yol yapılandırma dosyası eklemektir. Yol yapılandırma dosyalarının uzantısı :file:`.pth` 'dir ve her satırda ``sys.path`` dosyasına eklenecek tek bir yol bulunmalıdır. (Yeni yollar ``sys.path`` dizinine eklendiğinden, eklenen dizinlerdeki modüller standart modülleri geçersiz kılmaz. Bu, standart modüllerin sabit sürümlerini kurmak için bu mekanizmayı kullanamayacağınız anlamına gelir.)

source: Paths can be absolute or relative, in which case they're relative to the directory containing the :file:`.pth` file. See the documentation of the :mod:`site` module for more information.
tr: Yollar mutlak veya göreli olabilir, bu durumda :file:`.pth` dosyasını içeren dizine göredirler. Daha fazla bilgi için :mod:`site` modülünün belgelerine bakın.

source: A slightly less convenient way is to edit the :file:`site.py` file in Python's standard library, and modify ``sys.path``. :file:`site.py` is automatically imported when the Python interpreter is executed, unless the :option:`-S` switch is supplied to suppress this behaviour. So you could simply edit :file:`site.py` and add two lines to it:
tr: Biraz daha az kullanışlı bir yol, Python'un standart kitaplığındaki :file:`site.py` dosyasını düzenlemek ve ``sys.path`` değiştirmektir. Bu davranışı bastırmak için :option:`-S` anahtarı sağlanmadıkça, Python yorumlayıcısı çalıştırıldığında :file:`site.py` otomatik olarak içe aktarılır. Böylece :file:`site.py` dosyasını düzenleyebilir ve ona iki satır ekleyebilirsiniz:

source: However, if you reinstall the same major version of Python (perhaps when upgrading from 2.2 to 2.2.2, for example) :file:`site.py` will be overwritten by the stock version. You'd have to remember that it was modified and save a copy before doing the installation.
tr: Ancak, Python'un aynı ana sürümünü yeniden yüklerseniz (örneğin, 2.2'den 2.2.2'ye yükseltme yaparken) :file:`site.py` stok sürümü tarafından üzerine yazılır. Kurulumu yapmadan önce değiştirildiğini hatırlamanız ve bir kopyasını kaydetmeniz gerekir.

source: There are two environment variables that can modify ``sys.path``. :envvar:`PYTHONHOME` sets an alternate value for the prefix of the Python installation. For example, if :envvar:`PYTHONHOME` is set to ``/www/python``, the search path will be set to ``['', '/www/python/lib/pythonX.Y/', '/www/python/lib/pythonX.Y/plat-linux2', ...]``.
tr: ``sys.path`` değiştirebilen iki ortam değişkeni vardır. :envvar:`PYTHONHOME` Python kurulumunun öneki için alternatif bir değer ayarlar. Örneğin, :envvar:`PYTHONHOME`, ``/www/python`` olarak ayarlanırsa, arama yolu ``['', '/www/python/lib/pythonX.Y/', '/www/python/lib/pythonX.Y/plat-linux2', ...]`` olarak ayarlanır.

source: The :envvar:`PYTHONPATH` variable can be set to a list of paths that will be added to the beginning of ``sys.path``. For example, if :envvar:`PYTHONPATH` is set to ``/www/python:/opt/py``, the search path will begin with ``['/www/python', '/opt/py']``. (Note that directories must exist in order to be added to ``sys.path``; the :mod:`site` module removes paths that don't exist.)
tr: :envvar:`PYTHONPATH` değişkeni, ``sys.path`` başına eklenecek bir yol listesine ayarlanabilir. Örneğin, :envvar:`PYTHONPATH`, ``/www/python:/opt/py`` olarak ayarlanırsa, arama yolu ``['/www/python', '/opt/py']`` ile başlar. (``sys.path`` klasörüne eklenmek için dizinlerin var olması gerektiğini unutmayın; :mod:`site` modülü var olmayan yolları kaldırır.)

source: Finally, ``sys.path`` is just a regular Python list, so any Python application can modify it by adding or removing entries.
tr: Son olarak, ``sys.path`` sadece normal bir Python listesidir, bu nedenle herhangi bir Python uygulaması, girdiler ekleyerek veya çıkararak onu değiştirebilir.

source: Distutils Configuration Files
tr: Distutils Yapılandırma Dosyaları

source: As mentioned above, you can use Distutils configuration files to record personal or site preferences for any Distutils options. That is, any option to any command can be stored in one of two or three (depending on your platform) configuration files, which will be consulted before the command-line is parsed. This means that configuration files will override default values, and the command-line will in turn override configuration files. Furthermore, if multiple configuration files apply, values from "earlier" files are overridden by "later" files.
tr: Yukarıda bahsedildiği gibi, herhangi bir Distutils seçeneği için kişisel veya site tercihlerini kaydetmek için Distutils konfigürasyon dosyalarını kullanabilirsiniz. Yani, herhangi bir komutun herhangi bir seçeneği, komut satırı ayrıştırılmadan önce danışılacak olan (platformunuza bağlı olarak) iki veya üç yapılandırma dosyasından birinde saklanabilir. Bu, yapılandırma dosyalarının varsayılan değerleri geçersiz kılacağı ve komut satırının da yapılandırma dosyalarını geçersiz kılacağı anlamına gelir. Ayrıca, birden fazla yapılandırma dosyası geçerliyse, "önceki" dosyalardan alınan değerler "sonraki" dosyalar tarafından geçersiz kılınır.

source: Location and names of config files
tr: Yapılandırma dosyalarının konumu ve adları

source: The names and locations of the configuration files vary slightly across platforms. On Unix and macOS, the three configuration files (in the order they are processed) are:
tr: Yapılandırma dosyalarının adları ve konumları platformlar arasında biraz farklılık gösterir. Unix ve macOS'ta üç yapılandırma dosyası (işlendikleri sırayla):

source: Location and filename
tr: Konum ve dosya adı

source: And on Windows, the configuration files are:
tr: Ve Windows'ta yapılandırma dosyaları şunlardır:

source: On all platforms, the "personal" file can be temporarily disabled by passing the ``--no-user-cfg`` option.
tr: Tüm platformlarda, ``--no-user-cfg`` seçeneği geçilerek "kişisel" dosya geçici olarak devre dışı bırakılabilir.

source: Strictly speaking, the system-wide configuration file lives in the directory where the Distutils are installed; under Python 1.6 and later on Unix, this is as shown. For Python 1.5.2, the Distutils will normally be installed to :file:`{prefix}/lib/python1.5/site-packages/distutils`, so the system configuration file should be put there under Python 1.5.2.
tr: Kesin olarak söylemek gerekirse, sistem genelindeki yapılandırma dosyası Distutils'in kurulu olduğu dizinde bulunur; Python 1.6 altında ve daha sonra Unix'te bu gösterildiği gibidir. Python 1.5.2 için, Distutils normalde :file:`{prefix}/lib/python1.5/site-packages/distutils` konumuna yüklenecektir, bu nedenle sistem yapılandırma dosyası oraya Python 1.5.2 altına yerleştirilmelidir.

source: On Unix, if the :envvar:`HOME` environment variable is not defined, the user's home directory will be determined with the :func:`getpwuid` function from the standard :mod:`pwd` module. This is done by the :func:`os.path.expanduser` function used by Distutils.
tr: Unix'te, :envvar:`HOME` ortam değişkeni tanımlı değilse, kullanıcının ana dizini standart :mod:`pwd` modülünden :func:`getpwuid` işleviyle belirlenir. Bu, Distutils tarafından kullanılan :func:`os.path.expanduser` işlevi tarafından yapılır.

source: I.e., in the current directory (usually the location of the setup script).
tr: Yani, geçerli dizinde (genellikle kurulum komut dosyasının konumu).

source: (See also note (1).) Under Python 1.6 and later, Python's default "installation prefix" is :file:`C:\\Python`, so the system configuration file is normally :file:`C:\\Python\\Lib\\distutils\\distutils.cfg`. Under Python 1.5.2, the default prefix was :file:`C:\\Program Files\\Python`, and the Distutils were not part of the standard library---so the system configuration file would be :file:`C:\\Program Files\\Python\\distutils\\distutils.cfg` in a standard Python 1.5.2 installation under Windows.
tr: (Ayrıca not (1)'e bakın.) Python 1.6 ve sonraki sürümlerde, Python'un varsayılan "kurulum öneki" :file:`C:\\Python` şeklindedir, bu nedenle sistem yapılandırma dosyası normalde :file:`C:\\Python\ şeklindedir. \Lib\\distutils\\distutils.cfg`. Python 1.5.2 altında, varsayılan önek :file:`C:\\Program Files\\Python` idi ve Distutils standart kitaplığın parçası değildi -- bu nedenle sistem yapılandırma dosyası :file:`C olacaktır. :\\Program Files\\Python\\distutils\\distutils.cfg` Windows altında standart bir Python 1.5.2 kurulumunda.

source: On Windows, if the :envvar:`HOME` environment variable is not defined, :envvar:`USERPROFILE` then :envvar:`HOMEDRIVE` and :envvar:`HOMEPATH` will be tried. This is done by the :func:`os.path.expanduser` function used by Distutils.
tr: Windows'ta, :envvar:`HOME` ortam değişkeni tanımlı değilse, :envvar:`USERPROFILE` :envvar:`HOMEDRIVE` ve :envvar:`HOMEPATH` denenecektir. Bu, Distutils tarafından kullanılan :func:`os.path.expanduser` işlevi tarafından yapılır.

source: Syntax of config files
tr: Yapılandırma dosyalarının Syntax'ı (sözdizimi)

source: The Distutils configuration files all have the same syntax. The config files are grouped into sections. There is one section for each Distutils command, plus a ``global`` section for global options that affect every command. Each section consists of one option per line, specified as ``option=value``.
tr: Distutils yapılandırma dosyalarının tümü aynı Syntax'a sahiptir. Yapılandırma dosyaları bölümlere ayrılmıştır. Her Distutils komutu için bir bölüm ve ayrıca her komutu etkileyen genel seçenekler için bir ``global`` bölüm vardır. Her bölüm, satır başına ``seçenek=değer`` olarak belirtilen bir seçenekten oluşur.

source: For example, the following is a complete config file that just forces all commands to run quietly by default:
tr: Örneğin, aşağıdaki, tüm komutları varsayılan olarak sessizce çalışmaya zorlayan eksiksiz bir yapılandırma dosyasıdır:

source: If this is installed as the system config file, it will affect all processing of any Python module distribution by any user on the current system. If it is installed as your personal config file (on systems that support them), it will affect only module distributions processed by you. And if it is used as the :file:`setup.cfg` for a particular module distribution, it affects only that distribution.
tr: Bu, sistem yapılandırma dosyası olarak kurulursa, mevcut sistemdeki herhangi bir kullanıcı tarafından herhangi bir Python modülü dağıtımının tüm işlemlerini etkileyecektir. Kişisel yapılandırma dosyanız olarak kurulursa (onları destekleyen sistemlerde), yalnızca sizin tarafınızdan işlenen modül dağıtımlarını etkiler. Ve belirli bir modül dağıtımı için :file:`setup.cfg` olarak kullanılırsa, yalnızca bu dağıtımı etkiler.

source: You could override the default "build base" directory and make the :command:`build\*` commands always forcibly rebuild all files with the following:
tr: Varsayılan "temel oluşturma" dizinini geçersiz kılabilir ve :command:`build\*` komutlarını aşağıdakilerle tüm dosyaları her zaman zorla yeniden oluşturabilirsiniz:

source: which corresponds to the command-line arguments ::
tr: hangi komut satırı argümanlarına karşılık gelir ::

source: except that including the :command:`build` command on the command-line means that command will be run. Including a particular command in config files has no such implication; it only means that if the command is run, the options in the config file will apply. (Or if other commands that derive values from it are run, they will use the values in the config file.)
tr: :command:`build` komutunun komut satırına eklenmesi, komutun çalıştırılacağı anlamına gelir. Yapılandırma dosyalarına belirli bir komutu dahil etmenin böyle bir anlamı yoktur; bu yalnızca komut çalıştırılırsa yapılandırma dosyasındaki seçeneklerin uygulanacağı anlamına gelir. (Ya da ondan değer türeten başka komutlar çalıştırılırsa, yapılandırma dosyasındaki değerleri kullanırlar.)

source: You can find out the complete list of options for any command using the :option:`!--help` option, e.g.::
tr: :option:`!--help` seçeneğini kullanarak herhangi bir komut için seçeneklerin tam listesini bulabilirsiniz, ör.::

source: and you can find out the complete list of global options by using :option:`!--help` without a command::
tr: ve komut olmadan :option:`!--help` kullanarak global seçeneklerin tam listesini bulabilirsiniz::

source: See also the "Reference" section of the "Distributing Python Modules" manual.
tr: Ayrıca "Python Modüllerini Dağıtma" kılavuzunun "Referans" bölümüne bakın.

source: Building Extensions: Tips and Tricks
tr: Bina Uzantıları: İpuçları ve Püf Noktaları

source: Whenever possible, the Distutils try to use the configuration information made available by the Python interpreter used to run the :file:`setup.py` script. For example, the same compiler and linker flags used to compile Python will also be used for compiling extensions. Usually this will work well, but in complicated situations this might be inappropriate. This section discusses how to override the usual Distutils behaviour.
tr: Mümkün olduğunda, Distutils, :file:`setup.py` komut dosyasını çalıştırmak için kullanılan Python yorumlayıcısı tarafından sağlanan yapılandırma bilgilerini kullanmaya çalışır. Örneğin, Python'u derlemek için kullanılan aynı derleyici ve bağlayıcı bayrakları, uzantıları derlemek için de kullanılacaktır. Genellikle bu iyi çalışır, ancak karmaşık durumlarda bu uygun olmayabilir. Bu bölüm, olağan Distutils davranışının nasıl geçersiz kılınacağını tartışır.

source: Tweaking compiler/linker flags
tr: Derleyici/bağlayıcı bayraklarında ince ayar yapma

source: Compiling a Python extension written in C or C++ will sometimes require specifying custom flags for the compiler and linker in order to use a particular library or produce a special kind of object code. This is especially true if the extension hasn't been tested on your platform, or if you're trying to cross-compile Python.
tr: C veya C++ ile yazılmış bir Python uzantısını derlemek, bazen belirli bir kitaplığı kullanmak veya özel bir tür nesne kodu üretmek için derleyici ve bağlayıcı için özel bayraklar belirtmeyi gerektirir. Bu, özellikle uzantı platformunuzda test edilmemişse veya Python'u çapraz derlemeye çalışıyorsanız geçerlidir.

source: In the most general case, the extension author might have foreseen that compiling the extensions would be complicated, and provided a :file:`Setup` file for you to edit. This will likely only be done if the module distribution contains many separate extension modules, or if they often require elaborate sets of compiler flags in order to work.
tr: En genel durumda, uzantı yazarı, uzantıları derlemenin karmaşık olacağını öngörmüş ve düzenlemeniz için bir :file:`Setup` dosyası sağlamış olabilir. Bu muhtemelen yalnızca modül dağıtımı birçok ayrı genişletme modülü içeriyorsa veya çalışmak için genellikle ayrıntılı derleyici bayrakları gerektiriyorsa yapılacaktır.

source: A :file:`Setup` file, if present, is parsed in order to get a list of extensions to build. Each line in a :file:`Setup` describes a single module. Lines have the following structure::
tr: Bir :file:`Setup` dosyası varsa, oluşturulacak uzantıların bir listesini almak için ayrıştırılır. :file:`Setup` içindeki her satır tek bir modülü tanımlar. Hatlar aşağıdaki yapıya sahiptir:

source: Let's examine each of the fields in turn.
tr: Alanların her birini sırayla inceleyelim.

source: *module* is the name of the extension module to be built, and should be a valid Python identifier. You can't just change this in order to rename a module (edits to the source code would also be needed), so this should be left alone.
tr: *module*, oluşturulacak uzantı modülünün adıdır ve geçerli bir Python tanımlayıcısı olmalıdır. Bunu sadece bir modülü yeniden adlandırmak için değiştiremezsiniz (kaynak kodunda da düzenlemeler yapılması gerekir), bu yüzden bu yalnız bırakılmalıdır.

source: *sourcefile* is anything that's likely to be a source code file, at least judging by the filename. Filenames ending in :file:`.c` are assumed to be written in C, filenames ending in :file:`.C`, :file:`.cc`, and :file:`.c++` are assumed to be C++, and filenames ending in :file:`.m` or :file:`.mm` are assumed to be in Objective C.
tr: *sourcefile*, en azından dosya adına bakılırsa, kaynak kod dosyası olması muhtemel herhangi bir şeydir. :file:`.c` ile biten dosya adlarının C ile yazıldığı, :file:`.C`, :file:`.cc` ve :file:`.c++` ile biten dosya adlarının C++ olduğu varsayılır. ve :file:`.m` veya :file:`.mm` ile biten dosya adlarının Amaç C'de olduğu varsayılır.

source: *cpparg* is an argument for the C preprocessor, and is anything starting with :option:`!-I`, :option:`!-D`, :option:`!-U` or :option:`!-C`.
tr: *cpparg*, C önişlemcisi için bir argümandır ve :option:`!-I`, :option:`!-D`, :option:`!-U` veya :option:`!-C` ile başlayan herhangi bir şeydir.

source: If a particular platform requires a special library on your platform, you can add it by editing the :file:`Setup` file and running ``python setup.py build``. For example, if the module defined by the line ::
tr: Belirli bir platform, platformunuzda özel bir kütüphane gerektiriyorsa, bunu :file:`Setup` dosyasını düzenleyerek ve ``python setup.py build`` çalıştırarak ekleyebilirsiniz. Örneğin, modül satır ile tamamlanırsa ::

source: must be linked with the math library :file:`libm.a` on your platform, simply add :option:`!-lm` to the line::
tr: platformunuzdaki matematik kitaplığı :file:`libm.a` ile bağlantılı olmalıdır, sadece :option:`!-lm` satırına ekleyin::

source: Arbitrary switches intended for the compiler or the linker can be supplied with the :option:`!-Xcompiler` *arg* and :option:`!-Xlinker` *arg* options::
tr: Derleyici veya bağlayıcıya yönelik keyfi anahtarlar :option:`!-Xcompiler` *arg* ve :option:`!-Xlinker` *arg* seçenekleriyle sağlanabilir::

source: The next option after :option:`!-Xcompiler` and :option:`!-Xlinker` will be appended to the proper command line, so in the above example the compiler will be passed the :option:`!-o32` option, and the linker will be passed :option:`!-shared`. If a compiler option requires an argument, you'll have to supply multiple :option:`!-Xcompiler` options; for example, to pass ``-x c++`` the :file:`Setup` file would have to contain ``-Xcompiler -x -Xcompiler c++``.
tr: :option:`!-Xcompiler` ve :option:`!-Xlinker` 'dan sonraki sonraki seçenek uygun komut satırına eklenecektir, bu nedenle yukarıdaki örnekte derleyiciye :option:`!-o32` seçeneği geçilecektir. , ve bağlayıcı geçirilir :option:`!-shared`. Derleyici seçeneği bir argüman gerektiriyorsa, birden çok :option:`!-Xcompiler` seçeneği sağlamanız gerekir; örneğin, ``-x c++`` geçmek için :file:`Setup` dosyasının ``-Xcompiler -x -Xcompiler c++`` içermesi gerekir.

source: Compiler flags can also be supplied through setting the :envvar:`CFLAGS` environment variable. If set, the contents of :envvar:`CFLAGS` will be added to the compiler flags specified in the :file:`Setup` file.
tr: Derleyici bayrakları, :envvar:`CFLAGS` ortam değişkeni ayarlanarak da sağlanabilir. Ayarlanırsa, :envvar:`CFLAGS` içeriği :file:`Setup` dosyasında belirtilen derleyici bayraklarına eklenecektir.

source: Using non-Microsoft compilers on Windows
tr: Windows'ta Microsoft'a ait olmayan derleyicileri kullanma

source: This subsection describes the necessary steps to use Distutils with the Borland C++ compiler version 5.5. First you have to know that Borland's object file format (OMF) is different from the format used by the Python version you can download from the Python or ActiveState web site. (Python is built with Microsoft Visual C++, which uses COFF as the object file format.) For this reason you have to convert Python's library :file:`python25.lib` into the Borland format. You can do this as follows:
tr: Bu alt bölüm, Distutils'i Borland C++ derleyici sürüm 5.5 ile kullanmak için gerekli adımları açıklar. Öncelikle Borland'ın nesne dosya formatının (OMF), Python veya ActiveState web sitesinden indirebileceğiniz Python sürümünün kullandığı formattan farklı olduğunu bilmelisiniz. (Python, nesne dosya formatı olarak COFF kullanan Microsoft Visual C++ ile oluşturulmuştur.) Bu nedenle Python'un :file:`python25.lib` kütüphanesini Borland formatına dönüştürmeniz gerekmektedir. Bunu aşağıdaki gibi yapabilirsiniz:

source: The :file:`coff2omf` program comes with the Borland compiler. The file :file:`python25.lib` is in the :file:`Libs` directory of your Python installation. If your extension uses other libraries (zlib, ...) you have to convert them too.
tr: :file:`coff2omf` programı Borland derleyicisiyle birlikte gelir. :file:`python25.lib` dosyası, Python kurulumunuzun :file:`Libs` dizinindedir. Uzantınız başka kütüphaneler (zlib, …) kullanıyorsa, onları da dönüştürmeniz gerekir.

source: The converted files have to reside in the same directories as the normal libraries.
tr: Dönüştürülen dosyalar, normal kütüphanelerle aynı dizinlerde bulunmalıdır.

source: How does Distutils manage to use these libraries with their changed names? If the extension needs a library (eg. :file:`foo`) Distutils checks first if it finds a library with suffix :file:`_bcpp` (eg. :file:`foo_bcpp.lib`) and then uses this library. In the case it doesn't find such a special library it uses the default name (:file:`foo.lib`.) [#]_
tr: Distutils, bu kütüphaneleri değişen adlarıyla kullanmayı nasıl başarıyor? Uzantının bir kitaplığa ihtiyacı varsa (örn. :file:`foo`) Distutils önce :file:`_bcpp` (örn. :file:`foo_bcpp.lib`) sonekine sahip bir kütüphane bulup bulmadığını kontrol eder ve ardından bu kitaplığı kullanır. Böyle özel bir kütüphane bulamazsa, varsayılan adı kullanır (:file:`foo.lib`.) [#]_

source: To let Distutils compile your extension with Borland C++ you now have to type::
tr: Distutils'in uzantınızı Borland C++ ile derlemesine izin vermek için şimdi şunu yazmanız gerekir::

source: If you want to use the Borland C++ compiler as the default, you could specify this in your personal or system-wide configuration file for Distutils (see section :ref:`inst-config-files`.)
tr: Borland C++ derleyicisini varsayılan olarak kullanmak istiyorsanız, bunu Distutils için kişisel veya sistem genelindeki yapılandırma dosyanızda belirtebilirsiniz (bkz. :ref:`inst-config-files`.)

source: Information about the free C++ compiler from Borland, including links to the download pages.
tr: İndirme sayfalarına bağlantılar da dahil olmak üzere Borland'ın ücretsiz C++ derleyicisi hakkında bilgiler.

source: `Creating Python Extensions Using Borland's Free Compiler <http://www.cyberus.ca/~g_will/pyExtenDL.shtml>`_
tr: `Borland'ın Ücretsiz Derleyicisini Kullanarak Python Uzantıları Oluşturma <http://www.cyberus.ca/~g_will/pyExtenDL.shtml>`_

source: Document describing how to use Borland's free command-line C++ compiler to build Python.
tr: Python'u oluşturmak için Borland'ın ücretsiz komut satırı C++ derleyicisinin nasıl kullanılacağını açıklayan belge.
