Repository: python/python-docs-tr
Catalog: howto/clinic.po
Languages: tr

source: In a nutshell, the syntax for Argument Clinic (non-legacy) converters looks like a Python function call. However, if there are no explicit arguments to the function (all functions take their default values), you may omit the parentheses. Thus ``bool`` and ``bool()`` are exactly the same converters.
tr: Özetle, Argüman Kliniği (eski olmayan) dönüştürücüler için sözdizimi bir Python işlev çağrısı gibi görünür. Ancak, fonksiyon için açık bir argüman yoksa (tüm fonksiyonlar varsayılan değerlerini alır), parantezleri atlayabilirsiniz. Böylece ``bool`` ve ``bool()`` tamamen aynı dönüştürücülerdir.

source: All arguments to Argument Clinic converters are keyword-only. All Argument Clinic converters accept the following arguments:
tr: Argüman Kliniği dönüştürücülerinin tüm bağımsız değişkenleri yalnızca anahtar sözcüktür. Tüm Argüman Kliniği dönüştürücüleri aşağıdaki bağımsız değişkenleri kabul eder:

source: The default value for this parameter when defined in C. Specifically, this will be the initializer for the variable declared in the "parse function". See :ref:`the section on default values <default_values>` for how to use this. Specified as a string.
tr: C'de tanımlandığında bu parametre için varsayılan değer. Özellikle, bu "parse fonksiyonu" içinde bildirilen değişken için başlatıcı olacaktır. Bunun nasıl kullanılacağını öğrenmek için :ref:`varsayılan değerler <default_values>` bölümüne bakınız. Bir dize olarak belirtilir.

source: The annotation value for this parameter. Not currently supported, because :pep:`8` mandates that the Python library may not use annotations.
tr: Bu parametre için ek açıklama değeri. Şu anda desteklenmemektedir, çünkü :pep:`8` Python kütüphanesinin ek açıklamaları kullanamayacağını belirtmektedir.

source: In addition, some converters accept additional arguments. Here is a list of these arguments, along with their meanings:
tr: Buna ek olarak, bazı dönüştürücüler ek bağımsız değişkenler kabul eder. İşte anlamlarıyla birlikte bu bağımsız değişkenlerin bir listesi:

source: A set of Python types (and possibly pseudo-types); this restricts the allowable Python argument to values of these types. (This is not a general-purpose facility; as a rule it only supports specific lists of types as shown in the legacy converter table.)
tr: Bir Python türleri (ve muhtemelen sözde türler) kümesi; bu, izin verilen Python argümanını bu türlerin değerleriyle sınırlar. (Bu genel amaçlı bir olanak değildir; kural olarak yalnızca eski dönüştürücü tablosunda gösterilen belirli tür listelerini destekler).

source: To accept ``None``, add ``NoneType`` to this set.
tr: ``None`` kabul etmek için bu kümeye ``NoneType`` ekleyin.

source: Only supported for unsigned integers. The native integer value of this Python argument will be written to the parameter without any range checking, even for negative values.
tr: Yalnızca işaretsiz tamsayılar için desteklenir. Bu Python argümanının doğal tamsayı değeri, negatif değerler için bile herhangi bir aralık kontrolü yapılmadan parametreye yazılacaktır.

source: Only supported by the ``object`` converter. Specifies the name of a :ref:`C "converter function" <o_ampersand>` to use to convert this object to a native type.
tr: Sadece ``object`` dönüştürücü tarafından desteklenir. Bu nesneyi yerel bir türe dönüştürmek için kullanılacak :ref:`C "converter function" <o_ampersand>` adını belirtir.

source: Only supported for strings. Specifies the encoding to use when converting this string from a Python str (Unicode) value into a C ``char *`` value.
tr: Yalnızca dizeler için desteklenir. Bu dizeyi bir Python str (Unicode) değerinden bir C ``char *`` değerine dönüştürürken kullanılacak kodlamayı belirtir.

source: Only supported for the ``object`` converter. Requires that the Python value be a subclass of a Python type, as expressed in C.
tr: Yalnızca ``object`` dönüştürücü için desteklenir. Python değerinin C'de ifade edildiği gibi bir Python türünün alt sınıfı olmasını gerektirir.

source: Only supported for the ``object`` and ``self`` converters. Specifies the C type that will be used to declare the variable. Default value is ``"PyObject *"``.
tr: Sadece ``object`` ve ``self`` dönüştürücüleri için desteklenir. Değişkeni bildirmek için kullanılacak C türünü belirtir. Varsayılan değer ``"PyObject *"`` şeklindedir.

source: Only supported for strings. If true, embedded NUL bytes (``'\\0'``) are permitted inside the value. The length of the string will be passed in to the impl function, just after the string parameter, as a parameter named ``<parameter_name>_length``.
tr: Yalnızca dizeler için desteklenir. Eğer true ise, değerin içinde gömülü NUL baytlarına (``'\\0'``) izin verilir. Dizenin uzunluğu impl fonksiyonuna, dize parametresinden hemen sonra, ``<parameter_name>_length`` adlı bir parametre olarak aktarılır.

source: Please note, not every possible combination of arguments will work. Usually these arguments are implemented by specific ``PyArg_ParseTuple`` *format units*, with specific behavior. For example, currently you cannot call ``unsigned_short`` without also specifying ``bitwise=True``. Although it's perfectly reasonable to think this would work, these semantics don't map to any existing format unit. So Argument Clinic doesn't support it. (Or, at least, not yet.)
tr: Lütfen her olası argüman kombinasyonunun çalışmayacağını unutmayın. Genellikle bu argümanlar belirli davranışlara sahip belirli ``PyArg_ParseTuple`` *format birimleri* tarafından uygulanır. Örneğin, şu anda ``bitwise=True`` belirtmeden ``unsigned_short`` çağıramazsınız. Bunun işe yarayacağını düşünmek tamamen mantıklı olsa da, bu anlamlar mevcut herhangi bir biçim birimiyle eşleşmez. Bu yüzden Argüman Kliniği bunu desteklemez. (Ya da, en azından, henüz değil.)

source: Below is a table showing the mapping of legacy converters into real Argument Clinic converters. On the left is the legacy converter, on the right is the text you'd replace it with.
tr: Aşağıda, eski dönüştürücülerin gerçek Argüman Kliniği dönüştürücülerine eşlenmesini gösteren bir tablo bulunmaktadır. Solda eski dönüştürücü, sağda ise onu değiştireceğiniz metin yer almaktadır.

source: As an example, here's our sample ``pickle.Pickler.dump`` using the proper converter::
tr: Örnek olarak, uygun dönüştürücüyü kullanan ``pickle.Pickler.dump`` örneğimiz::

source: One advantage of real converters is that they're more flexible than legacy converters. For example, the ``unsigned_int`` converter (and all the ``unsigned_`` converters) can be specified without ``bitwise=True``. Their default behavior performs range checking on the value, and they won't accept negative numbers. You just can't do that with a legacy converter!
tr: Gerçek dönüştürücülerin bir avantajı, eski dönüştürücülere göre daha esnek olmalarıdır. Örneğin, ``unsigned_int`` dönüştürücüsü (ve tüm ``unsigned_`` dönüştürücüleri) ``bitwise=True`` olmadan belirtilebilir. Varsayılan davranışları değer üzerinde aralık denetimi yapar ve negatif sayıları kabul etmezler. Bunu eski bir dönüştürücü ile yapamazsınız!

source: Argument Clinic will show you all the converters it has available. For each converter it'll show you all the parameters it accepts, along with the default value for each parameter. Just run ``Tools/clinic/clinic.py --converters`` to see the full list.
tr: Argüman Kliniği size mevcut tüm dönüştürücüleri gösterecektir. Her dönüştürücü için, kabul ettiği tüm parametreleri ve her parametre için varsayılan değeri gösterecektir. Tam listeyi görmek için ``Tools/clinic/clinic.py --converters`` komutunu çalıştırmanız yeterlidir.

source: When using the ``Py_buffer`` converter (or the ``'s*'``, ``'w*'``, ``'*y'``, or ``'z*'`` legacy converters), you *must* not call :c:func:`PyBuffer_Release` on the provided buffer. Argument Clinic generates code that does it for you (in the parsing function).
tr: ``Py_buffer`` dönüştürücüsünü (veya ``'s*'``, ``'w*'``, ``'*y'`` veya ``'z*'`` eski dönüştürücülerini) kullanırken, sağlanan tampon üzerinde :c:func:`PyBuffer_Release` çağrısı yapmamanız gerekir. Argument Clinic bunu sizin için yapan kodu üretir (ayrıştırma işlevinde).

source: Advanced converters
tr: Gelişmiş dönüştürücüler

source: Remember those format units you skipped for your first time because they were advanced? Here's how to handle those too.
tr: İlk seferinizde ileri düzey oldukları için atladığınız format ünitelerini hatırlıyor musunuz? İşte onları da nasıl halledeceğiniz.

source: The trick is, all those format units take arguments—either conversion functions, or types, or strings specifying an encoding. (But "legacy converters" don't support arguments. That's why we skipped them for your first function.) The argument you specified to the format unit is now an argument to the converter; this argument is either ``converter`` (for ``O&``), ``subclass_of`` (for ``O!``), or ``encoding`` (for all the format units that start with ``e``).
tr: İşin püf noktası, tüm bu format birimlerinin argüman almasıdır - ya dönüştürme fonksiyonları, ya tipler ya da kodlama belirten dizeler. (Ancak "eski dönüştürücüler" argümanları desteklemez. Bu yüzden ilk fonksiyonunuz için onları atladık). Biçim birimine belirttiğiniz argüman artık dönüştürücünün bir argümanıdır; bu argüman ya ``converter`` (``O&`` için), ``subclass_of`` (``O!`` için) ya da ``encoding`` (``e`` ile başlayan tüm biçim birimleri için) şeklindedir.

source: When using ``subclass_of``, you may also want to use the other custom argument for ``object()``: ``type``, which lets you set the type actually used for the parameter. For example, if you want to ensure that the object is a subclass of ``PyUnicode_Type``, you probably want to use the converter ``object(type='PyUnicodeObject *', subclass_of='&PyUnicode_Type')``.
tr: ``subclass_of`` kullanırken, ``object()`` için diğer özel bağımsız değişkeni de kullanmak isteyebilirsiniz: ``type``, parametre için gerçekte kullanılan türü ayarlamanızı sağlar. Örneğin, nesnenin ``PyUnicode_Type`` türünün bir alt sınıfı olduğundan emin olmak istiyorsanız, muhtemelen ``object(type='PyUnicodeObject *', subclass_of='&PyUnicode_Type')`` dönüştürücüsünü kullanmak istersiniz.

source: One possible problem with using Argument Clinic: it takes away some possible flexibility for the format units starting with ``e``. When writing a ``PyArg_Parse`` call by hand, you could theoretically decide at runtime what encoding string to pass in to :c:func:`PyArg_ParseTuple`. But now this string must be hard-coded at Argument-Clinic-preprocessing-time. This limitation is deliberate; it made supporting this format unit much easier, and may allow for future optimizations. This restriction doesn't seem unreasonable; CPython itself always passes in static hard-coded encoding strings for parameters whose format units start with ``e``.
tr: Argüman Kliniği kullanımıyla ilgili olası bir sorun: ``e`` ile başlayan biçim birimleri için bazı olası esneklikleri ortadan kaldırır. Elle bir ``PyArg_Parse`` çağrısı yazarken, teorik olarak :c:func:`PyArg_ParseTuple`'a hangi kodlama dizgesini aktaracağınıza çalışma zamanında karar verebilirsiniz. Ancak şimdi bu dizge Argüman Kliniği-önişleme zamanında sabit kodlanmalıdır. Bu sınırlama kasıtlıdır; bu format birimini desteklemeyi çok daha kolay hale getirdi ve gelecekteki optimizasyonlara izin verebilir. Bu kısıtlama mantıksız görünmüyor; CPython'un kendisi, biçim birimleri ``e`` ile başlayan parametreler için her zaman statik sabit kodlu kodlama dizeleri geçirir.

source: Parameter default values
tr: Parametre varsayılan değerleri

source: Default values for parameters can be any of a number of values. At their simplest, they can be string, int, or float literals:
tr: Parametreler için varsayılan değerler bir dizi değerden herhangi biri olabilir. En basit haliyle string, int veya float değişmezleri olabilirler:

source: They can also use any of Python's built-in constants:
tr: Python'un yerleşik sabitlerinden herhangi birini de kullanabilirler:

source: There's also special support for a default value of ``NULL``, and for simple expressions, documented in the following sections.
tr: Ayrıca ``NULL`` varsayılan değeri ve aşağıdaki bölümlerde belgelenen basit ifadeler için özel bir destek de vardır.

source: The ``NULL`` default value
tr: Varsayılan değer ``NULL``

source: For string and object parameters, you can set them to ``None`` to indicate that there's no default. However, that means the C variable will be initialized to ``Py_None``. For convenience's sakes, there's a special value called ``NULL`` for just this reason: from Python's perspective it behaves like a default value of ``None``, but the C variable is initialized with ``NULL``.
tr: Dize ve nesne parametreleri için, varsayılan olmadığını belirtmek için bunları ``None`` olarak ayarlayabilirsiniz. Ancak bu, C değişkeninin ``Py_None`` olarak başlatılacağı anlamına gelir. Kolaylık olması açısından, sadece bu nedenle ``NULL`` adında özel bir değer vardır: Python'un bakış açısından varsayılan değer ``None`` gibi davranır, ancak C değişkeni ``NULL`` ile başlatılır.

source: Expressions specified as default values
tr: Varsayılan değerler olarak belirtilen ifadeler

source: The default value for a parameter can be more than just a literal value. It can be an entire expression, using math operators and looking up attributes on objects. However, this support isn't exactly simple, because of some non-obvious semantics.
tr: Bir parametre için varsayılan değer, gerçek bir değerden daha fazlası olabilir. Matematik operatörlerini kullanan ve nesnelerdeki öznitelikleri arayan bütün bir ifade olabilir. Ancak bu destek, bazı açık olmayan anlamlar nedeniyle tam olarak basit değildir.

source: Consider the following example:
tr: Aşağıdaki örneği ele alalım:

source: ``sys.maxsize`` can have different values on different platforms. Therefore Argument Clinic can't simply evaluate that expression locally and hard-code it in C. So it stores the default in such a way that it will get evaluated at runtime, when the user asks for the function's signature.
tr: ``sys.maxsize`` farklı platformlarda farklı değerlere sahip olabilir. Bu nedenle Argument Clinic bu ifadeyi yerel olarak değerlendiremez ve C'de sabit kodlayamaz. Bu nedenle varsayılanı, kullanıcı işlevin imzasını istediğinde çalışma zamanında değerlendirilecek şekilde saklar.

source: What namespace is available when the expression is evaluated? It's evaluated in the context of the module the builtin came from. So, if your module has an attribute called "``max_widgets``", you may simply use it:
tr: İfade değerlendirildiğinde hangi ad alanı kullanılabilir? Yerleşik öğenin geldiği modül bağlamında değerlendirilir. Dolayısıyla, modülünüzün "``max_widgets``" adlı bir niteliği varsa, bunu kullanabilirsiniz:

source: If the symbol isn't found in the current module, it fails over to looking in ``sys.modules``. That's how it can find ``sys.maxsize`` for example. (Since you don't know in advance what modules the user will load into their interpreter, it's best to restrict yourself to modules that are preloaded by Python itself.)
tr: Eğer sembol mevcut modülde bulunamazsa, ``sys.modules`` içinde aramaya devam eder. Örneğin ``sys.maxsize`` bu şekilde bulunabilir. (Kullanıcının yorumlayıcısına hangi modülleri yükleyeceğini önceden bilemeyeceğiniz için, kendinizi Python'un kendisi tarafından önceden yüklenmiş modüllerle sınırlamak en iyisidir).

source: Evaluating default values only at runtime means Argument Clinic can't compute the correct equivalent C default value. So you need to tell it explicitly. When you use an expression, you must also specify the equivalent expression in C, using the ``c_default`` parameter to the converter:
tr: Varsayılan değerlerin yalnızca çalışma zamanında değerlendirilmesi, Argüman Kliniği'nin doğru eşdeğer C varsayılan değerini hesaplayamayacağı anlamına gelir. Bu yüzden ona açıkça söylemeniz gerekir. Bir ifade kullandığınızda, dönüştürücüye ``c_default`` parametresini kullanarak C'deki eşdeğer ifadeyi de belirtmeniz gerekir:

source: Another complication: Argument Clinic can't know in advance whether or not the expression you supply is valid. It parses it to make sure it looks legal, but it can't *actually* know. You must be very careful when using expressions to specify values that are guaranteed to be valid at runtime!
tr: Başka bir komplikasyon: Argüman Kliniği, sağladığınız ifadenin geçerli olup olmadığını önceden bilemez. Yasal göründüğünden emin olmak için ayrıştırır, ancak *gerçekten* bilemez. Çalışma zamanında geçerli olacağı garanti edilen değerleri belirtmek için ifadeleri kullanırken çok dikkatli olmalısınız!

source: Finally, because expressions must be representable as static C values, there are many restrictions on legal expressions. Here's a list of Python features you're not permitted to use:
tr: Son olarak, ifadelerin statik C değerleri olarak gösterilebilir olması gerektiğinden, yasal ifadeler üzerinde birçok kısıtlama vardır. İşte kullanmanıza izin verilmeyen Python özelliklerinin bir listesi:

source: Function calls.
tr: Fonksiyon çağrıları.

source: Inline if statements (``3 if foo else 5``).
tr: Satır içi if ifadeleri (``3 if foo else 5``).

source: Automatic sequence unpacking (``*[1, 2, 3]``).
tr: Otomatik dizi açma (``*[1, 2, 3]``).

source: List/set/dict comprehensions and generator expressions.
tr: Liste/set/dict kavramaları ve üretici ifadeleri.

source: Tuple/list/set/dict literals.
tr: Tuple/list/set/dict değişmezleri.

source: Using a return converter
tr: Dönüş dönüştürücüsü kullanma

source: By default the impl function Argument Clinic generates for you returns ``PyObject *``. But your C function often computes some C type, then converts it into the ``PyObject *`` at the last moment. Argument Clinic handles converting your inputs from Python types into native C types—why not have it convert your return value from a native C type into a Python type too?
tr: Argüman Kliniği'nin sizin için oluşturduğu impl fonksiyonu varsayılan olarak ``PyObject *`` döndürür. Ancak C fonksiyonunuz genellikle bir C tipini hesaplar, sonra son anda onu ``PyObject *``'e dönüştürür. Argüman Kliniği girdilerinizi Python türlerinden yerel C türlerine dönüştürür - neden dönüş değerinizi de yerel bir C türünden bir Python türüne dönüştürmesin?

source: That's what a "return converter" does. It changes your impl function to return some C type, then adds code to the generated (non-impl) function to handle converting that value into the appropriate ``PyObject *``.
tr: "Dönüş dönüştürücüsü" de bunu yapar. Bir C tipi döndürmek için impl fonksiyonunuzu değiştirir, ardından bu değeri uygun ``PyObject *``'e dönüştürmek için oluşturulan (impl olmayan) fonksiyona kod ekler.

source: The syntax for return converters is similar to that of parameter converters. You specify the return converter like it was a return annotation on the function itself. Return converters behave much the same as parameter converters; they take arguments, the arguments are all keyword-only, and if you're not changing any of the default arguments you can omit the parentheses.
tr: Dönüş dönüştürücüleri için sözdizimi parametre dönüştürücülerine benzer. Dönüş dönüştürücüsünü fonksiyonun kendisindeki bir dönüş ek açıklaması gibi belirtirsiniz. Dönüş dönüştürücüleri parametre dönüştürücüleriyle aynı şekilde davranır; argüman alırlar, argümanların tümü yalnızca anahtar sözcüktür ve varsayılan argümanlardan herhangi birini değiştirmiyorsanız parantezleri atlayabilirsiniz.

source: (If you use both ``"as"`` *and* a return converter for your function, the ``"as"`` should come before the return converter.)
tr: (Fonksiyonunuz için hem ``"as"`` * hem de * return dönüştürücü kullanıyorsanız, ``"as"`` return dönüştürücüden önce gelmelidir.)

source: There's one additional complication when using return converters: how do you indicate an error has occurred? Normally, a function returns a valid (non-``NULL``) pointer for success, and ``NULL`` for failure. But if you use an integer return converter, all integers are valid. How can Argument Clinic detect an error? Its solution: each return converter implicitly looks for a special value that indicates an error. If you return that value, and an error has been set (``PyErr_Occurred()`` returns a true value), then the generated code will propagate the error. Otherwise it will encode the value you return like normal.
tr: Geri dönüş dönüştürücülerini kullanırken ek bir karmaşıklık vardır: bir hata oluştuğunu nasıl belirtirsiniz? Normalde, bir fonksiyon başarı için geçerli (``NULL`` olmayan) bir işaretçi döndürür ve başarısızlık için ``NULL`` döndürür. Ancak bir tamsayı dönüş dönüştürücüsü kullanırsanız, tüm tamsayılar geçerlidir. Argüman Kliniği bir hatayı nasıl tespit edebilir? Çözümü: her geri dönüş dönüştürücüsü örtük olarak bir hatayı gösteren özel bir değer arar. Bu değeri döndürürseniz ve bir hata ayarlanmışsa (``PyErr_Occurred()`` doğru bir değer döndürür), oluşturulan kod hatayı yayacaktır. Aksi takdirde, döndürdüğünüz değeri normal şekilde kodlayacaktır.

source: Currently Argument Clinic supports only a few return converters:
tr: Şu anda Argüman Kliniği yalnızca birkaç dönüş dönüştürücüsünü desteklemektedir:

source: None of these take parameters. For the first three, return -1 to indicate error. For ``DecodeFSDefault``, the return type is ``const char *``; return a ``NULL`` pointer to indicate an error.
tr: Bunların hiçbiri parametre almaz. İlk üçü için, hatayı belirtmek üzere -1 döndürülür. ``DecodeFSDefault`` için dönüş türü ``const char *``'dır; bir hata belirtmek için ``NULL`` işaretçisi döndürür.

source: (There's also an experimental ``NoneType`` converter, which lets you return ``Py_None`` on success or ``NULL`` on failure, without having to increment the reference count on ``Py_None``. I'm not sure it adds enough clarity to be worth using.)
tr: (Ayrıca, ``Py_None`` referans sayısını artırmak zorunda kalmadan, başarı durumunda ``Py_None`` veya başarısızlık durumunda ``NULL`` döndürmenizi sağlayan deneysel bir ``NoneType`` dönüştürücü de vardır. Kullanmaya değecek kadar netlik kattığından emin değilim.)

source: To see all the return converters Argument Clinic supports, along with their parameters (if any), just run ``Tools/clinic/clinic.py --converters`` for the full list.
tr: Argüman Kliniği'nin desteklediği tüm dönüş dönüştürücülerini parametreleriyle (varsa) birlikte görmek için, tam liste için ``Tools/clinic/clinic.py --converters`` komutunu çalıştırmanız yeterlidir.

source: Cloning existing functions
tr: Mevcut fonksiyonları klonlama

source: If you have a number of functions that look similar, you may be able to use Clinic's "clone" feature. When you clone an existing function, you reuse:
tr: Birbirine benzeyen çok sayıda fonksiyonunuz varsa, Kliniğin "clone" özelliğini kullanabilirsiniz. Mevcut bir işlevi klonladığınızda, yeniden kullanırsınız:

source: its parameters, including
tr: parametreleri, dahil olmak üzere

source: their names,
tr: isimleri,

source: their converters, with all parameters,
tr: dönüştürücüleri, tüm parametrelerle birlikte,

source: their default values,
tr: varsayılan değerleri,

source: their per-parameter docstrings,
tr: parametre başına dokümanları,

source: their *kind* (whether they're positional only, positional or keyword, or keyword only), and
tr: türleri* (yalnızca konumsal, konumsal veya anahtar sözcük ya da yalnızca anahtar sözcük olup olmadıkları) ve

source: its return converter.
tr: dönüş dönüştürücüsü.

source: The only thing not copied from the original function is its docstring; the syntax allows you to specify a new docstring.
tr: Orijinal fonksiyondan kopyalanmayan tek şey onun docstring'idir; sözdizimi yeni bir docstring belirtmenize izin verir.

source: Here's the syntax for cloning a function::
tr: Bir fonksiyonu klonlamak için sözdizimi şöyledir::
