Repository: python/python-docs-tr
Catalog: howto/clinic.po
Languages: tr

source: Argument Clinic How-To
tr: Argüman Kliniği Nasıl Yapılır

source: author
tr: yazar

source: Abstract
tr: Soyut

source: Argument Clinic is a preprocessor for CPython C files. Its purpose is to automate all the boilerplate involved with writing argument parsing code for "builtins". This document shows you how to convert your first C function to work with Argument Clinic, and then introduces some advanced topics on Argument Clinic usage.
tr: Argüman Kliniği CPython C dosyaları için bir ön işlemcidir. Amacı, "builtins" için argüman ayrıştırma kodunun yazılmasıyla ilgili tüm boilerplate'i otomatikleştirmektir. Bu dokümantasyon size ilk C fonksiyonunuzu Argüman Kliniği ile çalışacak şekilde nasıl dönüştüreceğinizi gösterir ve ardından Argüman Kliniği kullanımıyla ilgili bazı ileri düzey konuları tanıtır.

source: Currently Argument Clinic is considered internal-only for CPython. Its use is not supported for files outside CPython, and no guarantees are made regarding backwards compatibility for future versions. In other words: if you maintain an external C extension for CPython, you're welcome to experiment with Argument Clinic in your own code. But the version of Argument Clinic that ships with the next version of CPython *could* be totally incompatible and break all your code.
tr: Şu anda Argüman Kliniği CPython için dahili olarak kabul edilmektedir. CPython dışındaki dosyalar için kullanımı desteklenmemektedir ve gelecek sürümler için geriye dönük uyumluluk konusunda herhangi bir garanti verilmemektedir. Başka bir deyişle: CPython için harici bir C uzantısına sahipseniz, Argüman Kliniği'ni kendi kodunuzda deneyebilirsiniz. Ancak CPython'un bir sonraki sürümüyle birlikte gelen Argüman Kliniği sürümü * tamamen uyumsuz olabilir ve tüm kodunuzu bozabilir.

source: The Goals Of Argument Clinic
tr: Argüman Kliniğinin Hedefleri

source: Argument Clinic's primary goal is to take over responsibility for all argument parsing code inside CPython. This means that, when you convert a function to work with Argument Clinic, that function should no longer do any of its own argument parsing—the code generated by Argument Clinic should be a "black box" to you, where CPython calls in at the top, and your code gets called at the bottom, with ``PyObject *args`` (and maybe ``PyObject *kwargs``) magically converted into the C variables and types you need.
tr: Argüman Kliniği'nin birincil amacı CPython içindeki tüm argüman ayrıştırma kodunun sorumluluğunu üstlenmektir. Bu, bir fonksiyonu Argüman Kliniği ile çalışacak şekilde dönüştürdüğünüzde, bu fonksiyonun artık kendi argüman ayrıştırmasını yapmaması gerektiği anlamına gelir - Argüman Kliniği tarafından üretilen kod sizin için bir "kara kutu" olmalıdır, CPython üstte çağırır ve kodunuz altta çağrılır, ``PyObject *args`` (ve belki ``PyObject *kwargs``) sihirli bir şekilde ihtiyacınız olan C değişkenlerine ve türlerine dönüştürülür.

source: In order for Argument Clinic to accomplish its primary goal, it must be easy to use. Currently, working with CPython's argument parsing library is a chore, requiring maintaining redundant information in a surprising number of places. When you use Argument Clinic, you don't have to repeat yourself.
tr: Argüman Kliniği'nin birincil amacına ulaşabilmesi için kullanımının kolay olması gerekir. Şu anda, CPython'un argüman ayrıştırma kütüphanesi ile çalışmak, şaşırtıcı sayıda yerde gereksiz bilgileri korumayı gerektiren bir angarya. Argüman Kliniği'ni kullandığınızda, kendinizi tekrar etmek zorunda kalmazsınız.

source: Obviously, no one would want to use Argument Clinic unless it's solving their problem—and without creating new problems of its own. So it's paramount that Argument Clinic generate correct code. It'd be nice if the code was faster, too, but at the very least it should not introduce a major speed regression. (Eventually Argument Clinic *should* make a major speedup possible—we could rewrite its code generator to produce tailor-made argument parsing code, rather than calling the general-purpose CPython argument parsing library. That would make for the fastest argument parsing possible!)
tr: Açıkçası, hiç kimse Argüman Kliniği'ni kendi sorununu çözmedikçe ve kendi başına yeni sorunlar yaratmadıkça kullanmak istemeyecektir. Bu yüzden Argüman Kliniği'nin doğru kod üretmesi çok önemlidir. Kodun daha hızlı olması da güzel olurdu, ancak en azından büyük bir hız gerilemesi getirmemelidir. (Sonunda Argüman Kliniği *büyük bir hızlanmayı mümkün kılmalıdır* - genel amaçlı CPython argüman ayrıştırma kütüphanesini çağırmak yerine, özel argüman ayrıştırma kodu üretmek için kod oluşturucusunu yeniden yazabiliriz. Bu, mümkün olan en hızlı argüman ayrıştırmasını sağlayacaktır!)

source: Additionally, Argument Clinic must be flexible enough to work with any approach to argument parsing. Python has some functions with some very strange parsing behaviors; Argument Clinic's goal is to support all of them.
tr: Ek olarak, Argüman Kliniği argüman ayrıştırmaya yönelik herhangi bir yaklaşımla çalışabilecek kadar esnek olmalıdır. Python'un çok garip ayrıştırma davranışlarına sahip bazı fonksiyonları vardır; Argüman Kliniği'nin amacı bunların hepsini desteklemektir.

source: Finally, the original motivation for Argument Clinic was to provide introspection "signatures" for CPython builtins. It used to be, the introspection query functions would throw an exception if you passed in a builtin. With Argument Clinic, that's a thing of the past!
tr: Son olarak, Argüman Kliniği'nin asıl motivasyonu CPython yerleşik bileşenleri için iç gözlem "imzaları" sağlamaktı. Eskiden, iç gözlem sorgu işlevleri, bir yerleşik geçerseniz bir istisna atardı. Argüman Kliniği ile bu geçmişte kaldı!

source: One idea you should keep in mind, as you work with Argument Clinic: the more information you give it, the better job it'll be able to do. Argument Clinic is admittedly relatively simple right now. But as it evolves it will get more sophisticated, and it should be able to do many interesting and smart things with all the information you give it.
tr: Argüman Kliniği ile çalışırken aklınızda tutmanız gereken bir fikir var: Ona ne kadar çok bilgi verirseniz, o kadar iyi iş çıkaracaktır. Argüman Kliniği kuşkusuz şu anda nispeten basittir. Ancak geliştikçe daha sofistike hale gelecek ve ona verdiğiniz tüm bilgilerle birçok ilginç ve akıllıca şey yapabilecektir.

source: Basic Concepts And Usage
tr: Temel Kavramlar ve Kullanım

source: Argument Clinic ships with CPython; you'll find it in ``Tools/clinic/clinic.py``. If you run that script, specifying a C file as an argument:
tr: Argüman Kliniği CPython ile birlikte gelir; ``Tools/clinic/clinic.py`` içinde bulabilirsiniz. Bu dizeyi çalıştırırsanız, argüman olarak bir C dosyası belirtirseniz:

source: Argument Clinic will scan over the file looking for lines that look exactly like this:
tr: Argüman Kliniği dosyayı tarayarak tam olarak buna benzeyen satırları arayacaktır:

source: When it finds one, it reads everything up to a line that looks exactly like this:
tr: Bir tane bulduğunda, tam olarak buna benzeyen bir satıra kadar her şeyi okur:

source: Everything in between these two lines is input for Argument Clinic. All of these lines, including the beginning and ending comment lines, are collectively called an Argument Clinic "block".
tr: Bu iki satır arasındaki her şey Argüman Kliniği için girdidir. Başlangıç ve bitiş yorum satırları da dahil olmak üzere tüm bu satırlara topluca Argüman Kliniği "bloğu" denir.

source: When Argument Clinic parses one of these blocks, it generates output. This output is rewritten into the C file immediately after the block, followed by a comment containing a checksum. The Argument Clinic block now looks like this:
tr: Argüman Kliniği bu bloklardan birini ayrıştırdığında çıktı üretir. Bu çıktı, bloktan hemen sonra C dosyasına yeniden yazılır ve ardından bir sağlama toplamı içeren bir yorum eklenir. Argüman Kliniği bloğu şimdi şöyle görünür:

source: If you run Argument Clinic on the same file a second time, Argument Clinic will discard the old output and write out the new output with a fresh checksum line. However, if the input hasn't changed, the output won't change either.
tr: Argüman Kliniği'ni aynı dosya üzerinde ikinci kez çalıştırırsanız, Argüman Kliniği eski çıktıyı atacak ve yeni çıktıyı yeni bir sağlama toplamı satırıyla birlikte yazacaktır. Ancak, girdi değişmemişse, çıktı da değişmeyecektir.

source: You should never modify the output portion of an Argument Clinic block. Instead, change the input until it produces the output you want. (That's the purpose of the checksum—to detect if someone changed the output, as these edits would be lost the next time Argument Clinic writes out fresh output.)
tr: Bir Argüman Kliniği bloğunun çıktı kısmını asla değiştirmemelisiniz. Bunun yerine, istediğiniz çıktıyı üretene kadar girdiyi değiştirin. (Sağlama toplamının amacı budur - birisinin çıktıyı değiştirip değiştirmediğini tespit etmek, çünkü bu düzenlemeler Argüman Kliniği bir sonraki sefer yeni çıktı yazdığında kaybolacaktır)

source: For the sake of clarity, here's the terminology we'll use with Argument Clinic:
tr: Açıklık getirmek adına, Argüman Kliniği ile ilgili kullanacağımız terminolojiyi burada bulabilirsiniz:

source: The first line of the comment (``/*[clinic input]``) is the *start line*.
tr: Yorumun ilk satırı (``/*[clinic input]``) *başlangıç satırıdır*.

source: The last line of the initial comment (``[clinic start generated code]*/``) is the *end line*.
tr: İlk yorumun son satırı (``[clinic start generated code]*/``) *son satırdır*.

source: The last line (``/*[clinic end generated code: checksum=...]*/``) is the *checksum line*.
tr: Son satır (``/*[clinic end generated code: checksum=...]*/``) *checksum line*.

source: In between the start line and the end line is the *input*.
tr: Yorumun ilk satırı (``/*[clinic input]``) *başlangıç satırıdır*.

source: In between the end line and the checksum line is the *output*.
tr: Bitiş satırı ile sağlama toplamı satırı arasında *çıktı* bulunur.

source: All the text collectively, from the start line to the checksum line inclusively, is the *block*. (A block that hasn't been successfully processed by Argument Clinic yet doesn't have output or a checksum line, but it's still considered a block.)
tr: Başlangıç satırından sağlama toplamı satırına kadar tüm metin toplu olarak *blok*'tur. (Argüman Kliniği tarafından henüz başarılı bir şekilde işlenmemiş bir bloğun çıktısı veya sağlama satırı yoktur, ancak yine de bir blok olarak kabul edilir)

source: Converting Your First Function
tr: İlk Fonksiyonunuzu Dönüştürme

source: The best way to get a sense of how Argument Clinic works is to convert a function to work with it. Here, then, are the bare minimum steps you'd need to follow to convert a function to work with Argument Clinic. Note that for code you plan to check in to CPython, you really should take the conversion farther, using some of the advanced concepts you'll see later on in the document (like "return converters" and "self converters"). But we'll keep it simple for this walkthrough so you can learn.
tr: Argüman Kliniği'nin nasıl çalıştığını anlamanın en iyi yolu, bir fonksiyonu onunla çalışacak şekilde dönüştürmektir. O halde burada, bir fonksiyonu Argüman Kliniği ile çalışacak şekilde dönüştürmek için izlemeniz gereken asgari adımlar yer almaktadır. CPython'da kontrol etmeyi planladığınız kod için, belgede daha sonra göreceğiniz bazı gelişmiş kavramları ("dönüş dönüştürücüler" ve "öz dönüştürücüler" gibi) kullanarak dönüştürmeyi gerçekten daha ileri götürmeniz gerektiğini unutmayın. Ancak öğrenebilmeniz için bu kılavuz için basit tutacağız.

source: Let's dive in!
tr: Hadi dalalım!

source: Make sure you're working with a freshly updated checkout of the CPython trunk.
tr: CPython trunk'ın yeni güncellenmiş bir checkout'u ile çalıştığınızdan emin olun.

source: Find a Python builtin that calls either :c:func:`PyArg_ParseTuple` or :c:func:`PyArg_ParseTupleAndKeywords`, and hasn't been converted to work with Argument Clinic yet. For my example I'm using ``_pickle.Pickler.dump()``.
tr: :c:func:`PyArg_ParseTuple` veya :c:func:`PyArg_ParseTupleAndKeywords` çağıran ve henüz Argüman Kliniği ile çalışmak üzere dönüştürülmemiş bir Python yerleşik bileşeni bulun. Benim örneğim için ``_pickle.Pickler.dump()`` kullanıyorum.

source: If the call to the ``PyArg_Parse`` function uses any of the following format units:
tr: Eğer ``PyArg_Parse`` fonksiyonuna yapılan çağrı aşağıdaki format birimlerinden herhangi birini kullanıyorsa:

source: or if it has multiple calls to :c:func:`PyArg_ParseTuple`, you should choose a different function. Argument Clinic *does* support all of these scenarios. But these are advanced topics—let's do something simpler for your first function.
tr: veya :c:func:`PyArg_ParseTuple` için birden fazla çağrı varsa, farklı bir işlev seçmelisiniz. Argüman Kliniği bu senaryoların tümünü *destekler*. Ancak bunlar ileri düzey konulardır - ilk fonksiyonunuz için daha basit bir şey yapalım.

source: Also, if the function has multiple calls to :c:func:`PyArg_ParseTuple` or :c:func:`PyArg_ParseTupleAndKeywords` where it supports different types for the same argument, or if the function uses something besides PyArg_Parse functions to parse its arguments, it probably isn't suitable for conversion to Argument Clinic. Argument Clinic doesn't support generic functions or polymorphic parameters.
tr: Ayrıca, fonksiyonun aynı argüman için farklı türleri desteklediği :c:func:`PyArg_ParseTuple` veya :c:func:`PyArg_ParseTupleAndKeywords` için birden fazla çağrısı varsa veya fonksiyon argümanlarını ayrıştırmak için PyArg_Parse fonksiyonları dışında bir şey kullanıyorsa, muhtemelen Argüman Kliniğine dönüştürmek için uygun değildir. Argüman Kliniği genel fonksiyonları veya çok biçimli parametreleri desteklemez.

source: Add the following boilerplate above the function, creating our block::
tr: Bloğumuzu oluşturmak için fonksiyonun üzerine aşağıdaki şablonu ekleyin::

source: Cut the docstring and paste it in between the ``[clinic]`` lines, removing all the junk that makes it a properly quoted C string. When you're done you should have just the text, based at the left margin, with no line wider than 80 characters. (Argument Clinic will preserve indents inside the docstring.)
tr: Doküman dizesini kesin ve ``[clinic]`` satırları arasına yapıştırın, düzgün bir şekilde alıntılanmış bir C dizesi haline getiren tüm gereksiz şeyleri kaldırın. İşiniz bittiğinde, 80 karakterden daha geniş bir satır olmadan, sol kenar boşluğuna dayalı olarak yalnızca metne sahip olmalısınız. (Argüman Kliniği, doküman dizesi içindeki girintileri koruyacaktır.)

source: If the old docstring had a first line that looked like a function signature, throw that line away. (The docstring doesn't need it anymore—when you use ``help()`` on your builtin in the future, the first line will be built automatically based on the function's signature.)
tr: Eğer eski dokümanda fonksiyon imzasına benzeyen bir ilk satır varsa, o satırı atın. (Doküman dizesinin artık buna ihtiyacı yoktur - gelecekte yerleşik öğenizde ``help()`` kullandığınızda, ilk satır işlevin imzasına göre otomatik olarak oluşturulacaktır).

source: Sample::
tr: Örnek::

source: If your docstring doesn't have a "summary" line, Argument Clinic will complain. So let's make sure it has one. The "summary" line should be a paragraph consisting of a single 80-column line at the beginning of the docstring.
tr: Eğer doküman dizinizde bir "özet" satırı yoksa Argüman Kliniği şikayet edecektir. Bu yüzden bir tane olduğundan emin olalım. "Özet" satırı, doküman dizesinin başında 80 sütunlu tek bir satırdan oluşan bir paragraf olmalıdır.

source: (Our example docstring consists solely of a summary line, so the sample code doesn't have to change for this step.)
tr: (Örnek doküman dizimiz yalnızca bir özet satırından oluşmaktadır, bu nedenle örnek kodun bu adım için değişmesi gerekmez.)

source: Above the docstring, enter the name of the function, followed by a blank line. This should be the Python name of the function, and should be the full dotted path to the function—it should start with the name of the module, include any sub-modules, and if the function is a method on a class it should include the class name too.
tr: Döküman dizisinin üstüne fonksiyonun adını girin ve ardından boş bir satır ekleyin. Bu, işlevin Python adı olmalı ve işlevin tam noktalı yolu olmalıdır - modülün adıyla başlamalı, tüm alt modülleri içermeli ve işlev bir sınıf üzerindeki bir yöntemse sınıf adını da içermelidir.

source: If this is the first time that module or class has been used with Argument Clinic in this C file, you must declare the module and/or class. Proper Argument Clinic hygiene prefers declaring these in a separate block somewhere near the top of the C file, in the same way that include files and statics go at the top. (In our sample code we'll just show the two blocks next to each other.)
tr: Eğer bu modül veya sınıf bu C dosyasında Argüman Kliniği ile ilk kez kullanılıyorsa, modülü ve/veya sınıfı bildirmeniz gerekir. Uygun Argüman Kliniği hijyeni, bunları C dosyasının üst kısmına yakın bir yerde ayrı bir blokta bildirmeyi tercih eder, aynı şekilde include dosyaları ve statikler de en üstte yer alır. (Örnek kodumuzda sadece iki bloğu yan yana göstereceğiz).

source: The name of the class and module should be the same as the one seen by Python. Check the name defined in the :c:type:`PyModuleDef` or :c:type:`PyTypeObject` as appropriate.
tr: Sınıfın ve modülün adı Python tarafından görülenle aynı olmalıdır. :c:type:`PyModuleDef` veya :c:type:`PyTypeObject` içinde tanımlanan ismi kontrol edin.

source: When you declare a class, you must also specify two aspects of its type in C: the type declaration you'd use for a pointer to an instance of this class, and a pointer to the :c:type:`PyTypeObject` for this class.
tr: Bir sınıfı bildirdiğinizde, C'deki türünün iki yönünü de belirtmeniz gerekir: bu sınıfın bir örneğine bir işaretçi için kullanacağınız tür bildirimi ve bu sınıf için :c:type:`PyTypeObject` işaretçisi.

source: Declare each of the parameters to the function. Each parameter should get its own line. All the parameter lines should be indented from the function name and the docstring.
tr: Her bir parametreyi fonksiyona ilan edin. Her parametre kendi satırını almalıdır. Tüm parametre satırları fonksiyon adından ve döküman dizisinden girintili olmalıdır.

source: The general form of these parameter lines is as follows:
tr: Bu parametre satırlarının genel formu aşağıdaki gibidir:

source: If the parameter has a default value, add that after the converter:
tr: Parametrenin varsayılan bir değeri varsa, bunu dönüştürücüden sonra ekleyin:

source: Argument Clinic's support for "default values" is quite sophisticated; please see :ref:`the section below on default values <default_values>` for more information.
tr: Argüman Kliniğinin "varsayılan değerler" desteği oldukça karmaşıktır; daha fazla bilgi için lütfen :ref:`the section below on default values <default_values>` bölümüne bakın.

source: Add a blank line below the parameters.
tr: Parametrelerin altına boş bir satır ekleyin.

source: What's a "converter"? It establishes both the type of the variable used in C, and the method to convert the Python value into a C value at runtime. For now you're going to use what's called a "legacy converter"—a convenience syntax intended to make porting old code into Argument Clinic easier.
tr: "Dönüştürücü" nedir? Hem C'de kullanılan değişkenin türünü hem de Python değerini çalışma zamanında C değerine dönüştürme yöntemini belirler. Şimdilik "eski dönüştürücü" denilen şeyi kullanacaksınız - eski kodu Argüman Kliniği'ne taşımayı kolaylaştırmak için tasarlanmış bir kolaylık dizesi.

source: For each parameter, copy the "format unit" for that parameter from the ``PyArg_Parse()`` format argument and specify *that* as its converter, as a quoted string. ("format unit" is the formal name for the one-to-three character substring of the ``format`` parameter that tells the argument parsing function what the type of the variable is and how to convert it. For more on format units please see :ref:`arg-parsing`.)
tr: Her parametre için, ``PyArg_Parse()`` format argümanından o parametrenin "format birimini" kopyalayın ve dönüştürücü olarak *bunu* tırnaklı bir dize olarak belirtin. ("format unit", ``format`` parametresinin bir ila üç karakterlik alt dizesinin resmi adıdır ve argüman ayrıştırma fonksiyonuna değişkenin türünün ne olduğunu ve nasıl dönüştürüleceğini söyler. Biçim birimleri hakkında daha fazla bilgi için lütfen :ref:`arg-parsing` bölümüne bakın)

source: For multicharacter format units like ``z#``, use the entire two-or-three character string.
tr: ``z#`` gibi çok karakterli format birimleri için iki veya üç karakterli dizenin tamamını kullanın.

source: If your function has ``|`` in the format string, meaning some parameters have default values, you can ignore it. Argument Clinic infers which parameters are optional based on whether or not they have default values.
tr: Eğer fonksiyonunuzun biçim dizesinde ``|`` varsa, yani bazı parametrelerin varsayılan değerleri varsa, bunu yok sayabilirsiniz. Argüman Kliniği, varsayılan değerlere sahip olup olmadıklarına göre hangi parametrelerin isteğe bağlı olduğunu çıkarır.

source: If your function has ``$`` in the format string, meaning it takes keyword-only arguments, specify ``*`` on a line by itself before the first keyword-only argument, indented the same as the parameter lines.
tr: İşlevinizin biçim dizesinde ``$`` varsa, yani yalnızca anahtar sözcüklerden oluşan bağımsız değişkenler alıyorsa, ``*`` ifadesini yalnızca anahtar sözcüklerden oluşan ilk bağımsız değişkenden önce, parametre satırlarıyla aynı şekilde girintili olarak tek başına bir satırda belirtin.

source: (``_pickle.Pickler.dump`` has neither, so our sample is unchanged.)
tr: (``_pickle.Pickler.dump`` ikisine de sahip değildir, bu nedenle örneğimiz değişmemiştir.)

source: If the existing C function calls :c:func:`PyArg_ParseTuple` (as opposed to :c:func:`PyArg_ParseTupleAndKeywords`), then all its arguments are positional-only.
tr: Eğer mevcut C fonksiyonu :c:func:`PyArg_ParseTuple` (:c:func:`PyArg_ParseTupleAndKeywords` yerine) çağrısı yapıyorsa, tüm argümanları sadece konumsaldır.

source: To mark all parameters as positional-only in Argument Clinic, add a ``/`` on a line by itself after the last parameter, indented the same as the parameter lines.
tr: Argüman Kliniğinde tüm parametreleri sadece konumsal olarak işaretlemek için, son parametreden sonra tek başına bir satıra parametre satırlarıyla aynı şekilde girintili bir ``/`` ekleyin.

source: Currently this is all-or-nothing; either all parameters are positional-only, or none of them are. (In the future Argument Clinic may relax this restriction.)
tr: Şu anda bu ya hep ya hiçtir; ya tüm parametreler yalnızca konumsaldır ya da hiçbiri değildir. (Gelecekte Argüman Kliniği bu kısıtlamayı gevşetebilir)

source: It's helpful to write a per-parameter docstring for each parameter. But per-parameter docstrings are optional; you can skip this step if you prefer.
tr: Her parametre için parametre başına bir doküman yazmak faydalıdır. Ancak parametre başına dokümanlar isteğe bağlıdır; isterseniz bu adımı atlayabilirsiniz.
