Repository: python/python-docs-tr
Catalog: howto/clinic.po
Languages: tr

source: (The functions can be in different modules or classes. I wrote ``module.class`` in the sample just to illustrate that you must use the full path to *both* functions.)
tr: (Fonksiyonlar farklı modüllerde veya sınıflarda olabilir. Örnekte ``module.class`` yazdım, sadece *her iki* fonksiyon için de tam yolu kullanmanız gerektiğini göstermek için.)

source: Sorry, there's no syntax for partially cloning a function, or cloning a function then modifying it. Cloning is an all-or nothing proposition.
tr: Üzgünüz, bir fonksiyonu kısmen klonlamak veya bir fonksiyonu klonladıktan sonra değiştirmek için bir sözdizimi yoktur. Klonlama bir ya hep ya hiç önermesidir.

source: Also, the function you are cloning from must have been previously defined in the current file.
tr: Ayrıca, klonladığınız fonksiyonun mevcut dosyada daha önce tanımlanmış olması gerekir.

source: Calling Python code
tr: Python kodunu çağırma

source: The rest of the advanced topics require you to write Python code which lives inside your C file and modifies Argument Clinic's runtime state. This is simple: you simply define a Python block.
tr: İleri düzey konuların geri kalanı, C dosyanızın içinde yaşayan ve Argüman Kliniği'nin çalışma zamanı durumunu değiştiren Python kodu yazmanızı gerektirir. Bu basittir: sadece bir Python bloğu tanımlarsınız.

source: A Python block uses different delimiter lines than an Argument Clinic function block. It looks like this::
tr: Bir Python bloğu, Argüman Kliniği işlev bloğundan farklı sınırlayıcı satırlar kullanır. Şöyle görünür::

source: All the code inside the Python block is executed at the time it's parsed. All text written to stdout inside the block is redirected into the "output" after the block.
tr: Python bloğunun içindeki tüm kod ayrıştırıldığı anda çalıştırılır. Blok içinde stdout'a yazılan tüm metin, bloktan sonra "çıktı "ya yönlendirilir.

source: As an example, here's a Python block that adds a static integer variable to the C code::
tr: Örnek olarak, işte C koduna statik bir tamsayı değişkeni ekleyen bir Python bloğu::

source: Using a "self converter"
tr: "Kendi kendine dönüştürücü" kullanma

source: Argument Clinic automatically adds a "self" parameter for you using a default converter. It automatically sets the ``type`` of this parameter to the "pointer to an instance" you specified when you declared the type. However, you can override Argument Clinic's converter and specify one yourself. Just add your own ``self`` parameter as the first parameter in a block, and ensure that its converter is an instance of ``self_converter`` or a subclass thereof.
tr: Argüman Kliniği, varsayılan bir dönüştürücü kullanarak sizin için otomatik olarak bir "self" parametresi ekler. Bu parametrenin ``type`` değerini otomatik olarak, türü bildirirken belirttiğiniz "bir örneğe işaretçi" olarak ayarlar. Ancak, Argüman Kliniği'nin dönüştürücüsünü geçersiz kılabilir ve kendiniz bir dönüştürücü belirleyebilirsiniz. Sadece kendi ``self`` parametrenizi bir bloktaki ilk parametre olarak ekleyin ve dönüştürücüsünün ``self_converter`` veya onun bir alt sınıfının bir örneği olduğundan emin olun.

source: What's the point? This lets you override the type of ``self``, or give it a different default name.
tr: Ne anlamı var? Bu, ``self`` türünü geçersiz kılmanıza veya ona farklı bir varsayılan ad vermenize olanak tanır.

source: How do you specify the custom type you want to cast ``self`` to? If you only have one or two functions with the same type for ``self``, you can directly use Argument Clinic's existing ``self`` converter, passing in the type you want to use as the ``type`` parameter::
tr: ``self`` için döküm yapmak istediğiniz özel türü nasıl belirlersiniz? Eğer ``self`` için aynı tipe sahip sadece bir veya iki fonksiyonunuz varsa, kullanmak istediğiniz tipi ``type`` parametresi olarak girerek Argüman Kliniğinin mevcut ``self`` dönüştürücüsünü doğrudan kullanabilirsiniz::

source: On the other hand, if you have a lot of functions that will use the same type for ``self``, it's best to create your own converter, subclassing ``self_converter`` but overwriting the ``type`` member::
tr: Öte yandan, ``self`` için aynı türü kullanacak çok sayıda işleviniz varsa, en iyisi ``self_converter`` alt sınıfını kullanarak, ancak ``type`` üyesinin üzerine yazarak kendi dönüştürücünüzü oluşturmaktır::

source: Using a "defining class" converter
tr: "Sınıf tanımlama" dönüştürücüsü kullanma

source: Argument Clinic facilitates gaining access to the defining class of a method. This is useful for :ref:`heap type <heap-types>` methods that need to fetch module level state. Use :c:func:`PyType_FromModuleAndSpec` to associate a new heap type with a module. You can now use :c:func:`PyType_GetModuleState` on the defining class to fetch the module state, for example from a module method.
tr: Argüman Kliniği, bir metodun tanımlayıcı sınıfına erişim sağlamayı kolaylaştırır. Bu, modül düzeyinde durum getirmesi gereken :ref:`heap type <heap-types>` yöntemleri için kullanışlıdır. Yeni bir heap tipini bir modül ile ilişkilendirmek için :c:func:`PyType_FromModuleAndSpec` kullanın. Artık modül durumunu, örneğin bir modül yönteminden almak için tanımlayıcı sınıf üzerinde :c:func:`PyType_GetModuleState` kullanabilirsiniz.

source: Example from ``Modules/zlibmodule.c``. First, ``defining_class`` is added to the clinic input::
tr: ``Modules/zlibmodule.c`` den örnek. İlk olarak, ``defining_class`` klinik girdisine eklenir::

source: After running the Argument Clinic tool, the following function signature is generated::
tr: Argüman Kliniği aracını çalıştırdıktan sonra aşağıdaki fonksiyon imzası oluşturulur::

source: The following code can now use ``PyType_GetModuleState(cls)`` to fetch the module state::
tr: Aşağıdaki kod artık modül durumunu almak için ``PyType_GetModuleState(cls)`` kullanabilir::

source: Each method may only have one argument using this converter, and it must appear after ``self``, or, if ``self`` is not used, as the first argument. The argument will be of type ``PyTypeObject *``. The argument will not appear in the ``__text_signature__``.
tr: Bu dönüştürücüyü kullanan her yöntemin yalnızca bir argümanı olabilir ve bu argüman ``self`` öğesinden sonra veya ``self`` öğesi kullanılmamışsa ilk argüman olarak görünmelidir. Argüman ``PyTypeObject *`` tipinde olacaktır. Argüman ``__text_signature__`` içinde görünmeyecektir.

source: The ``defining_class`` converter is not compatible with ``__init__`` and ``__new__`` methods, which cannot use the ``METH_METHOD`` convention.
tr: ``defining_class`` dönüştürücüsü, ``METH_METHOD`` kuralını kullanamayan ``__init__`` ve ``__new__`` yöntemleriyle uyumlu değildir.

source: It is not possible to use ``defining_class`` with slot methods. In order to fetch the module state from such methods, use :c:func:`PyType_GetModuleByDef` to look up the module and then :c:func:`PyModule_GetState` to fetch the module state. Example from the ``setattro`` slot method in ``Modules/_threadmodule.c``::
tr: Slot metotları ile ``defining_class`` kullanmak mümkün değildir. Bu tür yöntemlerden modül durumunu almak için, modülü aramak için :c:func:`PyType_GetModuleByDef` ve ardından modül durumunu almak için :c:func:`PyModule_GetState` kullanın. ``Modules/_threadmodule.c`` içindeki ``setattro`` slot yönteminden örnek::

source: See also :pep:`573`.
tr: Bkz: :pep:`573`.

source: Writing a custom converter
tr: Özel bir dönüştürücü yazma

source: As we hinted at in the previous section... you can write your own converters! A converter is simply a Python class that inherits from ``CConverter``. The main purpose of a custom converter is if you have a parameter using the ``O&`` format unit—parsing this parameter means calling a :c:func:`PyArg_ParseTuple` "converter function".
tr: Önceki bölümde ima ettiğimiz gibi... kendi dönüştürücülerinizi yazabilirsiniz! Bir dönüştürücü basitçe ``CConverter``'dan miras alan bir Python sınıfıdır. Özel bir dönüştürücünün ana amacı, ``O&`` biçimini kullanan bir parametreniz varsa, bu parametreyi birim ayrıştırmak, bir :c:func:`PyArg_ParseTuple` "dönüştürücü işlevi" çağırmak anlamına gelir.

source: Your converter class should be named ``*something*_converter``. If the name follows this convention, then your converter class will be automatically registered with Argument Clinic; its name will be the name of your class with the ``_converter`` suffix stripped off. (This is accomplished with a metaclass.)
tr: Dönüştürücü sınıfınızın adı ``*something*_converter`` olmalıdır. İsim bu kurala uygunsa, dönüştürücü sınıfınız Argüman Kliniği'ne otomatik olarak kaydedilecektir; adı, ``_converter`` son eki çıkarılmış sınıfınızın adı olacaktır. (Bu bir meta sınıf ile gerçekleştirilir.)

source: You shouldn't subclass ``CConverter.__init__``. Instead, you should write a ``converter_init()`` function. ``converter_init()`` always accepts a ``self`` parameter; after that, all additional parameters *must* be keyword-only. Any arguments passed in to the converter in Argument Clinic will be passed along to your ``converter_init()``.
tr: ``CConverter.__init__`` alt sınıfını kullanmamalısınız. Bunun yerine, bir ``converter_init()`` fonksiyonu yazmalısınız. ``converter_init()`` her zaman bir ``self`` parametresi kabul eder; bundan sonra, tüm ek parametreler *mutlaka* yalnızca anahtar kelime olmalıdır. Argüman Kliniği`nde dönüştürücüye aktarılan tüm argümanlar ``converter_init()`` fonksiyonunuza aktarılacaktır.

source: There are some additional members of ``CConverter`` you may wish to specify in your subclass. Here's the current list:
tr: Alt sınıfınızda belirtmek isteyebileceğiniz bazı ek ``CConverter`` üyeleri vardır. İşte mevcut liste:

source: The C type to use for this variable. ``type`` should be a Python string specifying the type, e.g. ``int``. If this is a pointer type, the type string should end with ``' *'``.
tr: Bu değişken için kullanılacak C türü. ``type`` türü belirten bir Python dizesi olmalıdır, örneğin ``int``. Eğer bu bir gösterici tipiyse, tip dizesi ``' *'`` ile bitmelidir.

source: The Python default value for this parameter, as a Python value. Or the magic value ``unspecified`` if there is no default.
tr: Bir Python değeri olarak bu parametre için Python varsayılan değeri. Veya varsayılan değer yoksa ``unspecified`` sihirli değeri.

source: ``default`` as it should appear in Python code, as a string. Or ``None`` if there is no default.
tr: ``default`` Python kodunda görünmesi gerektiği gibi, bir string olarak. Veya varsayılan yoksa ``None``.

source: ``default`` as it should appear in C code, as a string. Or ``None`` if there is no default.
tr: C kodunda görünmesi gerektiği gibi, bir dize olarak ``default``. Veya varsayılan yoksa ``None``.

source: The default value used to initialize the C variable when there is no default, but not specifying a default may result in an "uninitialized variable" warning. This can easily happen when using option groups—although properly written code will never actually use this value, the variable does get passed in to the impl, and the C compiler will complain about the "use" of the uninitialized value. This value should always be a non-empty string.
tr: Varsayılan bir değer olmadığında C değişkenini başlatmak için kullanılan varsayılan değerdir, ancak varsayılan bir değer belirtilmemesi "başlatılmamış değişken" uyarısına neden olabilir. Bu durum, seçenek grupları kullanıldığında kolaylıkla meydana gelebilir; doğru yazılmış kod bu değeri hiçbir zaman kullanmayacak olsa da, değişken impl'ye aktarılır ve C derleyicisi başlatılmamış değerin "kullanımından" şikayet eder. Bu değer her zaman boş olmayan bir dize olmalıdır.

source: The name of the C converter function, as a string.
tr: C dönüştürücü işlevinin bir dize olarak adı.

source: A boolean value. If true, Argument Clinic will add a ``&`` in front of the name of the variable when passing it into the impl function.
tr: Boolean bir değer. Eğer true ise, Argüman Kliniği değişkeni impl fonksiyonuna aktarırken değişkenin isminin önüne bir ``&`` ekler.

source: A boolean value. If true, Argument Clinic will add a ``&`` in front of the name of the variable when passing it into :c:func:`PyArg_ParseTuple`.
tr: Boolean bir değer. Eğer true ise, Argüman Kliniği :c:func:`PyArg_ParseTuple` içine aktarırken değişkenin isminin önüne bir ``&`` ekleyecektir.

source: Here's the simplest example of a custom converter, from ``Modules/zlibmodule.c``::
tr: İşte ``Modules/zlibmodule.c`` adresinden özel bir dönüştürücünün en basit örneği::

source: This block adds a converter to Argument Clinic named ``ssize_t``. Parameters declared as ``ssize_t`` will be declared as type :c:type:`Py_ssize_t`, and will be parsed by the ``'O&'`` format unit, which will call the ``ssize_t_converter`` converter function. ``ssize_t`` variables automatically support default values.
tr: Bu blok Argüman Kliniğine ``ssize_t`` adında bir dönüştürücü ekler. ``ssize_t`` olarak bildirilen parametreler :c:type:`Py_ssize_t` türünde bildirilecek ve ``'O&'`` biçim birimi tarafından ayrıştırılacak ve ``ssize_t_converter`` dönüştürücü işlevini çağıracaktır. ``ssize_t`` değişkenleri otomatik olarak varsayılan değerleri destekler.

source: More sophisticated custom converters can insert custom C code to handle initialization and cleanup. You can see more examples of custom converters in the CPython source tree; grep the C files for the string ``CConverter``.
tr: Daha sofistike özel dönüştürücüler, başlatma ve temizleme işlemlerini gerçekleştirmek için özel C kodu ekleyebilir. CPython kaynak ağacında daha fazla özel dönüştürücü örneği görebilirsiniz; ``CConverter`` dizesi için C dosyalarını grepleyin.

source: Writing a custom return converter
tr: Özel bir dönüş dönüştürücü yazma

source: Writing a custom return converter is much like writing a custom converter. Except it's somewhat simpler, because return converters are themselves much simpler.
tr: Özel bir return dönüştürücü yazmak, özel bir dönüştürücü yazmaya çok benzer. Biraz basit olması dışında, çünkü geri dönüş dönüştürücülerinin kendileri çok daha basittir.

source: Return converters must subclass ``CReturnConverter``. There are no examples yet of custom return converters, because they are not widely used yet. If you wish to write your own return converter, please read ``Tools/clinic/clinic.py``, specifically the implementation of ``CReturnConverter`` and all its subclasses.
tr: Dönüş dönüştürücüleri ``CReturnConverter`` alt sınıfına sahip olmalıdır. Henüz yaygın olarak kullanılmadıkları için özel dönüş dönüştürücüleri için henüz bir örnek yoktur. Kendi dönüş dönüştürücünüzü yazmak istiyorsanız, lütfen ``Tools/clinic/clinic.py`` dosyasını, özellikle ``CReturnConverter`` ve tüm alt sınıflarının uygulamasını okuyun.

source: METH_O and METH_NOARGS
tr: METH_O ve METH_NOARGS

source: To convert a function using ``METH_O``, make sure the function's single argument is using the ``object`` converter, and mark the arguments as positional-only::
tr: Bir fonksiyonu ``METH_O`` kullanarak dönüştürmek için, fonksiyonun tek argümanının ``object`` dönüştürücüsünü kullandığından emin olun ve argümanları sadece pozisyonel olarak işaretleyin::

source: To convert a function using ``METH_NOARGS``, just don't specify any arguments.
tr: Bir fonksiyonu ``METH_NOARGS`` kullanarak dönüştürmek için herhangi bir argüman belirtmemeniz yeterlidir.

source: You can still use a self converter, a return converter, and specify a ``type`` argument to the object converter for ``METH_O``.
tr: Yine de bir self dönüştürücü, bir return dönüştürücü kullanabilir ve ``METH_O`` için nesne dönüştürücüye bir ``type`` argümanı belirtebilirsiniz.

source: tp_new and tp_init functions
tr: tp_new ve tp_init fonksiyonları

source: You can convert ``tp_new`` and ``tp_init`` functions. Just name them ``__new__`` or ``__init__`` as appropriate. Notes:
tr: ``tp_new`` ve ``tp_init`` fonksiyonlarını dönüştürebilirsiniz. Bunları uygun şekilde ``__new__`` veya ``__init__`` olarak adlandırmanız yeterlidir. Notlar:

source: The function name generated for ``__new__`` doesn't end in ``__new__`` like it would by default. It's just the name of the class, converted into a valid C identifier.
tr: ``__new__`` için oluşturulan işlev adı, varsayılan olarak olduğu gibi ``__new__`` ile bitmez. Bu sadece geçerli bir C tanımlayıcısına dönüştürülmüş sınıf adıdır.

source: No ``PyMethodDef`` ``#define`` is generated for these functions.
tr: Bu fonksiyonlar için ``PyMethodDef`` ``#define`` oluşturulmaz.

source: ``__init__`` functions return ``int``, not ``PyObject *``.
tr: ``__init__`` fonksiyonları ``PyObject *`` değil ``int`` döndürür.

source: Use the docstring as the class docstring.
tr: Doküman dizesini sınıf doküman dizesi olarak kullanın.

source: Although ``__new__`` and ``__init__`` functions must always accept both the ``args`` and ``kwargs`` objects, when converting you may specify any signature for these functions that you like. (If your function doesn't support keywords, the parsing function generated will throw an exception if it receives any.)
tr: Her ne kadar ``__new__`` ve ``__init__`` fonksiyonları her zaman hem ``args`` hem de ``kwargs`` nesnelerini kabul etmek zorunda olsa da, dönüştürme yaparken bu fonksiyonlar için istediğiniz imzayı belirtebilirsiniz. (İşleviniz anahtar sözcükleri desteklemiyorsa, oluşturulan ayrıştırma işlevi herhangi bir anahtar sözcük alırsa bir istisna atacaktır).

source: Changing and redirecting Clinic's output
tr: Kliniğin çıktısını değiştirme ve yönlendirme

source: It can be inconvenient to have Clinic's output interspersed with your conventional hand-edited C code. Luckily, Clinic is configurable: you can buffer up its output for printing later (or earlier!), or write its output to a separate file. You can also add a prefix or suffix to every line of Clinic's generated output.
tr: Kliniğin çıktısının geleneksel elle düzenlenmiş C kodunuzun arasına serpiştirilmesi rahatsız edici olabilir. Neyse ki, Klinik yapılandırılabilir: çıktısını daha sonra (veya daha önce!) yazdırmak için tamponlayabilir veya çıktısını ayrı bir dosyaya yazabilirsiniz. Ayrıca Kliniğin ürettiği çıktının her satırına bir önek veya sonek ekleyebilirsiniz.

source: While changing Clinic's output in this manner can be a boon to readability, it may result in Clinic code using types before they are defined, or your code attempting to use Clinic-generated code before it is defined. These problems can be easily solved by rearranging the declarations in your file, or moving where Clinic's generated code goes. (This is why the default behavior of Clinic is to output everything into the current block; while many people consider this hampers readability, it will never require rearranging your code to fix definition-before-use problems.)
tr: Kliniğin çıktısını bu şekilde değiştirmek okunabilirlik için bir nimet olsa da, Klinik kodunun tanımlanmadan önce türleri kullanmasına veya kodunuzun tanımlanmadan önce Klinik tarafından oluşturulan kodu kullanmaya çalışmasına neden olabilir. Bu sorunlar, dosyanızdaki bildirimleri yeniden düzenleyerek veya Kliniğin ürettiği kodun yerini değiştirerek kolayca çözülebilir. (Bu nedenle Kliniğin varsayılan davranışı her şeyi geçerli bloğa çıktı olarak vermektir; birçok kişi bunun okunabilirliği engellediğini düşünse de, kullanımdan önce tanımlama sorunlarını düzeltmek için kodunuzu yeniden düzenlemenizi asla gerektirmez).

source: Let's start with defining some terminology:
tr: Bazı terminolojileri tanımlamakla başlayalım:

source: A field, in this context, is a subsection of Clinic's output. For example, the ``#define`` for the ``PyMethodDef`` structure is a field, called ``methoddef_define``. Clinic has seven different fields it can output per function definition:
tr: Bu bağlamda bir alan, Kliniğin çıktısının bir alt bölümüdür. Örneğin, ``PyMethodDef`` yapısı için ``#define`` , ``methoddef_define`` olarak adlandırılan bir alandır. Kliniğin fonksiyon tanımı başına çıktı verebileceği yedi farklı alan vardır:

source: All the names are of the form ``"<a>_<b>"``, where ``"<a>"`` is the semantic object represented (the parsing function, the impl function, the docstring, or the methoddef structure) and ``"<b>"`` represents what kind of statement the field is. Field names that end in ``"_prototype"`` represent forward declarations of that thing, without the actual body/data of the thing; field names that end in ``"_definition"`` represent the actual definition of the thing, with the body/data of the thing. (``"methoddef"`` is special, it's the only one that ends with ``"_define"``, representing that it's a preprocessor #define.)
tr: Tüm adlar ``"<a>_<b>"`` biçimindedir, burada ``"<a>"`` temsil edilen semantik nesnedir (ayrıştırma işlevi, impl işlevi, docstring veya methoddef yapısı) ve ``"<b>"`` alanın ne tür bir ifade olduğunu temsil eder. ``"_prototype"`` ile biten alan adları, o şeyin gerçek gövdesi/verileri olmadan ileriye dönük bildirimlerini temsil eder; ``"_definition"`` ile biten alan adları, o şeyin gövdesi/verileri ile birlikte o şeyin gerçek tanımını temsil eder. (``"methoddef"`` özeldir, ``"_define"`` ile biten tek metottur, #define önişlemcisi olduğunu gösterir.)

source: A destination is a place Clinic can write output to. There are five built-in destinations:
tr: Hedef, Kliniğin çıktı yazabileceği bir yerdir. Beş adet yerleşik hedef vardır:

source: ``block``
tr: ``block````block``

source: The default destination: printed in the output section of the current Clinic block.
tr: Varsayılan hedef: geçerli Klinik bloğunun çıktı bölümünde yazdırılır.

source: A text buffer where you can save text for later. Text sent here is appended to the end of any existing text. It's an error to have any text left in the buffer when Clinic finishes processing a file.
tr: Metni daha sonra kullanmak üzere kaydedebileceğiniz bir metin arabelleği. Buraya gönderilen metin, mevcut metnin sonuna eklenir. Klinik bir dosyayı işlemeyi bitirdiğinde tamponda herhangi bir metin kalması bir hatadır.

source: A separate "clinic file" that will be created automatically by Clinic. The filename chosen for the file is ``{basename}.clinic{extension}``, where ``basename`` and ``extension`` were assigned the output from ``os.path.splitext()`` run on the current file. (Example: the ``file`` destination for ``_pickle.c`` would be written to ``_pickle.clinic.c``.)
tr: Klinik tarafından otomatik olarak oluşturulacak ayrı bir "klinik dosyası". Dosya için seçilen dosya adı ``{basename}.clinic{extension}`` şeklindedir, burada ``basename`` ve ``extension`` mevcut dosya üzerinde çalıştırılan ``os.path.splitext()`` çıktısına atanmıştır. (Örnek: ``_pickle.c`` için ``dosya`` hedefi ``_pickle.clinic.c`` olarak yazılacaktır).

source: **Important: When using a** ``file`` **destination, you** *must check in* **the generated file!**
tr: **Önemli: Bir ** ``dosya`` **hedefi kullanırken, **oluşturulan dosyayı** **mutlaka** kontrol etmelisiniz!

source: A buffer like ``buffer``. However, a two-pass buffer can only be dumped once, and it prints out all text sent to it during all processing, even from Clinic blocks *after* the dumping point.
tr: Arabellek ``buffer`` gibi bir arabellektir. Bununla birlikte, iki geçişli bir tampon yalnızca bir kez boşaltılabilir ve boşaltma noktasından *sonraki* Klinik bloklardan bile tüm işlem sırasında kendisine gönderilen tüm metni yazdırır.

source: The text is suppressed—thrown away.
tr: Metin bastırılmış, bir kenara atılmıştır.

source: Clinic defines five new directives that let you reconfigure its output.
tr: Klinik, çıktısını yeniden yapılandırmanıza olanak tanıyan beş yeni yönerge tanımlar.

source: The first new directive is ``dump``:
tr: İlk yeni yönerge ``dump``:
