Repository: python/python-docs-tr
Catalog: howto/clinic.po
Languages: tr

source: Here's how to add a per-parameter docstring. The first line of the per-parameter docstring must be indented further than the parameter definition. The left margin of this first line establishes the left margin for the whole per-parameter docstring; all the text you write will be outdented by this amount. You can write as much text as you like, across multiple lines if you wish.
tr: Parametre başına doküman dizisinin nasıl ekleneceği aşağıda açıklanmıştır. Parametre başına doküman dizesinin ilk satırı parametre tanımından daha fazla girintili olmalıdır. Bu ilk satırın sol kenar boşluğu, parametre başına doküman dizesinin tamamı için sol kenar boşluğunu belirler; yazdığınız tüm metin bu miktarda girintili olacaktır. Dilerseniz birden fazla satıra istediğiniz kadar metin yazabilirsiniz.

source: Save and close the file, then run ``Tools/clinic/clinic.py`` on it. With luck everything worked---your block now has output, and a ``.c.h`` file has been generated! Reopen the file in your text editor to see::
tr: Dosyayı kaydedin ve kapatın, ardından ``Tools/clinic/clinic.py`` dosyasını çalıştırın. Şansınız varsa her şey işe yaradı--- bloğunuzun artık bir çıktısı var ve bir ``.c.h`` dosyası oluşturuldu! Görmek için dosyayı metin düzenleyicinizde yeniden açın::

source: Obviously, if Argument Clinic didn't produce any output, it's because it found an error in your input. Keep fixing your errors and retrying until Argument Clinic processes your file without complaint.
tr: Açıkçası, Argüman Kliniği herhangi bir çıktı üretmediyse, bunun nedeni girdinizde bir hata bulmasıdır. Argüman Kliniği dosyanızı şikayet etmeden işleyene kadar hatalarınızı düzeltmeye ve yeniden denemeye devam edin.

source: For readability, most of the glue code has been generated to a ``.c.h`` file. You'll need to include that in your original ``.c`` file, typically right after the clinic module block::
tr: Okunabilirlik için, tutkal kodunun çoğu bir ``.c.h`` dosyasında oluşturulmuştur. Bunu orijinal ``.c`` dosyanıza eklemeniz gerekir, tipik olarak klinik modül bloğundan hemen sonra::

source: Double-check that the argument-parsing code Argument Clinic generated looks basically the same as the existing code.
tr: Argüman Kliniği'nin ürettiği argüman ayrıştırma kodunun temelde mevcut kodla aynı göründüğünü iki kez kontrol edin.

source: First, ensure both places use the same argument-parsing function. The existing code must call either :c:func:`PyArg_ParseTuple` or :c:func:`PyArg_ParseTupleAndKeywords`; ensure that the code generated by Argument Clinic calls the *exact* same function.
tr: İlk olarak, her iki yerin de aynı argüman ayrıştırma işlevini kullandığından emin olun. Mevcut kod :c:func:`PyArg_ParseTuple` veya :c:func:`PyArg_ParseTupleAndKeywords` fonksiyonlarından birini çağırmalıdır; Argüman Kliniği tarafından oluşturulan kodun *tam olarak* aynı fonksiyonu çağırdığından emin olun.

source: Second, the format string passed in to :c:func:`PyArg_ParseTuple` or :c:func:`PyArg_ParseTupleAndKeywords` should be *exactly* the same as the hand-written one in the existing function, up to the colon or semi-colon.
tr: İkinci olarak, :c:func:`PyArg_ParseTuple` veya :c:func:`PyArg_ParseTupleAndKeywords` işlevine aktarılan biçim dizesi, iki nokta üst üste veya noktalı virgülüne kadar mevcut işlevde elle yazılmış olanla *tam olarak* aynı olmalıdır.

source: (Argument Clinic always generates its format strings with a ``:`` followed by the name of the function. If the existing code's format string ends with ``;``, to provide usage help, this change is harmless—don't worry about it.)
tr: (Argüman Kliniği, biçim dizelerini her zaman ``:`` ve ardından işlevin adı ile oluşturur. Mevcut kodun biçim dizesi, kullanım yardımı sağlamak için ``;`` ile bitiyorsa, bu değişiklik zararsızdır - bu konuda endişelenmeyin)

source: Third, for parameters whose format units require two arguments (like a length variable, or an encoding string, or a pointer to a conversion function), ensure that the second argument is *exactly* the same between the two invocations.
tr: Üçüncü olarak, biçim birimleri iki bağımsız değişken gerektiren parametreler için (uzunluk değişkeni veya kodlama dizesi veya dönüştürme işlevine işaretçi gibi), ikinci bağımsız değişkenin iki çağırma arasında *tam olarak* aynı olduğundan emin olun.

source: Fourth, inside the output portion of the block you'll find a preprocessor macro defining the appropriate static :c:type:`PyMethodDef` structure for this builtin::
tr: Dördüncü olarak, bloğun çıktı kısmının içinde bu yerleşik: için uygun statik :c:type:`PyMethodDef` yapısını tanımlayan bir önişlemci makrosu bulacaksınız:

source: This static structure should be *exactly* the same as the existing static :c:type:`PyMethodDef` structure for this builtin.
tr: Bu statik yapı, bu yerleşik için mevcut statik :c:type:`PyMethodDef` yapısı ile *tam olarak* aynı olmalıdır.

source: If any of these items differ in *any way*, adjust your Argument Clinic function specification and rerun ``Tools/clinic/clinic.py`` until they *are* the same.
tr: Bu öğelerden herhangi biri *herhangi bir şekilde* farklıysa, Argüman Kliniği işlev belirtiminizi ayarlayın ve *aynı* olana kadar ``Tools/clinic/clinic.py`` dosyasını yeniden çalıştırın.

source: Notice that the last line of its output is the declaration of your "impl" function. This is where the builtin's implementation goes. Delete the existing prototype of the function you're modifying, but leave the opening curly brace. Now delete its argument parsing code and the declarations of all the variables it dumps the arguments into. Notice how the Python arguments are now arguments to this impl function; if the implementation used different names for these variables, fix it.
tr: Çıktısının son satırının "impl" fonksiyonunuzun bildirimi olduğuna dikkat edin. Bu, yerleşik uygulamanın gittiği yerdir. Değiştirdiğiniz fonksiyonun mevcut prototipini silin, ancak açılış küme parantezini bırakın. Şimdi argüman ayrıştırma kodunu ve argümanları içine attığı tüm değişkenlerin bildirimlerini silin. Python argümanlarının artık bu impl fonksiyonunun argümanları olduğuna dikkat edin; eğer uygulama bu değişkenler için farklı isimler kullandıysa, bunu düzeltin.

source: Let's reiterate, just because it's kind of weird. Your code should now look like this::
tr: Biraz garip olduğu için tekrarlayalım. Kodunuz şimdi şöyle görünmelidir::

source: Argument Clinic generated the checksum line and the function prototype just above it. You should write the opening (and closing) curly braces for the function, and the implementation inside.
tr: Argüman Kliniği sağlama toplamı satırını ve hemen üstünde fonksiyon prototipini oluşturdu. Fonksiyonun açılış (ve kapanış) küme parantezlerini ve içindeki uygulamayı yazmalısınız.

source: Remember the macro with the :c:type:`PyMethodDef` structure for this function? Find the existing :c:type:`PyMethodDef` structure for this function and replace it with a reference to the macro. (If the builtin is at module scope, this will probably be very near the end of the file; if the builtin is a class method, this will probably be below but relatively near to the implementation.)
tr: Bu fonksiyon için :c:type:`PyMethodDef` yapısına sahip makroyu hatırlıyor musunuz? Bu fonksiyon için mevcut :c:type:`PyMethodDef` yapısını bulun ve makroya bir referans ile değiştirin. (Yerleşik modül kapsamındaysa, bu muhtemelen dosyanın sonuna çok yakın olacaktır; yerleşik bir sınıf yöntemiyse, bu muhtemelen uygulamanın altında ancak nispeten yakınında olacaktır)

source: Note that the body of the macro contains a trailing comma. So when you replace the existing static :c:type:`PyMethodDef` structure with the macro, *don't* add a comma to the end.
tr: Makronun gövdesinin sonda bir virgül içerdiğine dikkat edin. Bu nedenle, mevcut statik :c:type:`PyMethodDef` yapısını makro ile değiştirdiğinizde, *sonuna virgül eklemeyin*.

source: Compile, then run the relevant portions of the regression-test suite. This change should not introduce any new compile-time warnings or errors, and there should be no externally visible change to Python's behavior.
tr: Derleyin, ardından regresyon testi paketinin ilgili bölümlerini çalıştırın. Bu değişiklik herhangi bir yeni derleme zamanı uyarısı veya hatası getirmemeli ve Python'un davranışında dışarıdan görülebilir bir değişiklik olmamalıdır.

source: Well, except for one difference: ``inspect.signature()`` run on your function should now provide a valid signature!
tr: Tek bir fark dışında: fonksiyonunuz üzerinde çalıştırılan ``inspect.signature()`` artık geçerli bir imza sağlamalıdır!

source: Congratulations, you've ported your first function to work with Argument Clinic!
tr: Tebrikler, ilk fonksiyonunuzu Argüman Kliniği ile çalışmak üzere taşıdınız!

source: Advanced Topics
tr: İleri Düzey Konular

source: Now that you've had some experience working with Argument Clinic, it's time for some advanced topics.
tr: Argüman Kliniği ile çalışma konusunda biraz deneyim kazandığınıza göre, bazı ileri düzey konuların zamanı geldi.

source: Symbolic default values
tr: Sembolik varsayılan değerler

source: The default value you provide for a parameter can't be any arbitrary expression. Currently the following are explicitly supported:
tr: Bir parametre için sağladığınız varsayılan değer rastgele bir ifade olamaz. Şu anda aşağıdakiler açıkça desteklenmektedir:

source: Numeric constants (integer and float)
tr: Sayısal sabitler (integer ve float)

source: String constants
tr: Dize sabitleri

source: ``True``, ``False``, and ``None``
tr: ``True``, ``False`` ve ``None``

source: Simple symbolic constants like ``sys.maxsize``, which must start with the name of the module
tr: Modülün adıyla başlaması gereken ``sys.maxsize`` gibi basit sembolik sabitler

source: (In the future, this may need to get even more elaborate, to allow full expressions like ``CONSTANT - 1``.)
tr: (Gelecekte, ``CONSTANT - 1`` gibi tam ifadelere izin vermek için bunun daha da ayrıntılı hale getirilmesi gerekebilir.)

source: Renaming the C functions and variables generated by Argument Clinic
tr: Argüman Kliniği tarafından oluşturulan C işlevlerini ve değişkenlerini yeniden adlandırma

source: Argument Clinic automatically names the functions it generates for you. Occasionally this may cause a problem, if the generated name collides with the name of an existing C function. There's an easy solution: override the names used for the C functions. Just add the keyword ``"as"`` to your function declaration line, followed by the function name you wish to use. Argument Clinic will use that function name for the base (generated) function, then add ``"_impl"`` to the end and use that for the name of the impl function.
tr: Argüman Kliniği sizin için ürettiği fonksiyonlara otomatik olarak isim verir. Bazen, oluşturulan ad mevcut bir C işlevinin adıyla çakışırsa bu bir soruna neden olabilir. Bunun kolay bir çözümü vardır: C fonksiyonları için kullanılan isimleri geçersiz kılın. Fonksiyon bildirim satırınıza ``"as"`` anahtar sözcüğünü ve ardından kullanmak istediğiniz fonksiyon adını eklemeniz yeterlidir. Argument Clinic, temel (oluşturulan) işlev için bu işlev adını kullanacak, ardından sonuna ``"_impl"`` ekleyecek ve impl işlevinin adı için bunu kullanacaktır.

source: For example, if we wanted to rename the C function names generated for ``pickle.Pickler.dump``, it'd look like this::
tr: Örneğin, ``pickle.Pickler.dump`` için oluşturulan C fonksiyon adlarını yeniden adlandırmak istersek, şöyle görünecektir::

source: The base function would now be named ``pickler_dumper()``, and the impl function would now be named ``pickler_dumper_impl()``.
tr: Temel işlev artık ``pickler_dumper()`` olarak adlandırılacak ve impl işlevi artık ``pickler_dumper_impl()`` olarak adlandırılacaktır.

source: Similarly, you may have a problem where you want to give a parameter a specific Python name, but that name may be inconvenient in C. Argument Clinic allows you to give a parameter different names in Python and in C, using the same ``"as"`` syntax::
tr: Benzer şekilde, bir parametreye belirli bir Python adı vermek istediğinizde bir sorunla karşılaşabilirsiniz, ancak bu ad C'de uygun olmayabilir. Argument Clinic, aynı ``"as"`` sözdizimini kullanarak bir parametreye Python'da ve C'de farklı adlar vermenize olanak tanır::

source: Here, the name used in Python (in the signature and the ``keywords`` array) would be ``file``, but the C variable would be named ``file_obj``.
tr: Burada, Python'da kullanılan isim (imzada ve ``keywords`` dizisinde) ``file`` olacaktır, ancak C değişkeni ``file_obj`` olarak adlandırılacaktır.

source: You can use this to rename the ``self`` parameter too!
tr: Bunu ``self`` parametresini yeniden adlandırmak için de kullanabilirsiniz!

source: Converting functions using PyArg_UnpackTuple
tr: PyArg_UnpackTuple kullanarak fonksiyonları dönüştürme

source: To convert a function parsing its arguments with :c:func:`PyArg_UnpackTuple`, simply write out all the arguments, specifying each as an ``object``. You may specify the ``type`` argument to cast the type as appropriate. All arguments should be marked positional-only (add a ``/`` on a line by itself after the last argument).
tr: Argümanlarını :c:func:`PyArg_UnpackTuple` ile ayrıştıran bir fonksiyonu dönüştürmek için, her birini bir ``object`` olarak belirterek tüm argümanları yazmanız yeterlidir. Türü uygun şekilde dökmek için ``type`` argümanını belirtebilirsiniz. Tüm argümanlar sadece konumsal olarak işaretlenmelidir (son argümandan sonra kendi başına bir satıra ``/`` ekleyin).

source: Currently the generated code will use :c:func:`PyArg_ParseTuple`, but this will change soon.
tr: Şu anda oluşturulan kod :c:func:`PyArg_ParseTuple` kullanacaktır, ancak bu yakında değişecektir.

source: Optional Groups
tr: İsteğe Bağlı Gruplar

source: Some legacy functions have a tricky approach to parsing their arguments: they count the number of positional arguments, then use a ``switch`` statement to call one of several different :c:func:`PyArg_ParseTuple` calls depending on how many positional arguments there are. (These functions cannot accept keyword-only arguments.) This approach was used to simulate optional arguments back before :c:func:`PyArg_ParseTupleAndKeywords` was created.
tr: Bazı eski fonksiyonların argümanlarını ayrıştırmak için zor bir yaklaşımı vardır: konumsal argümanların sayısını sayarlar, ardından kaç tane konumsal argüman olduğuna bağlı olarak birkaç farklı :c:func:`PyArg_ParseTuple` çağrısından birini çağırmak için bir ``switch`` deyimi kullanırlar. (Bu fonksiyonlar sadece anahtar kelime argümanlarını kabul edemez.) Bu yaklaşım :c:func:`PyArg_ParseTupleAndKeywords` oluşturulmadan önce isteğe bağlı argümanları simüle etmek için kullanılıyordu.

source: While functions using this approach can often be converted to use :c:func:`PyArg_ParseTupleAndKeywords`, optional arguments, and default values, it's not always possible. Some of these legacy functions have behaviors :c:func:`PyArg_ParseTupleAndKeywords` doesn't directly support. The most obvious example is the builtin function ``range()``, which has an optional argument on the *left* side of its required argument! Another example is ``curses.window.addch()``, which has a group of two arguments that must always be specified together. (The arguments are called ``x`` and ``y``; if you call the function passing in ``x``, you must also pass in ``y``—and if you don't pass in ``x`` you may not pass in ``y`` either.)
tr: Bu yaklaşımı kullanan fonksiyonlar genellikle :c:func:`PyArg_ParseTupleAndKeywords`, isteğe bağlı argümanlar ve varsayılan değerleri kullanacak şekilde dönüştürülebilse de, bu her zaman mümkün değildir. Bu eski fonksiyonlardan bazıları :c:func:`PyArg_ParseTupleAndKeywords` fonksiyonunun doğrudan desteklemediği davranışlara sahiptir. En bariz örnek, gerekli argümanının *sol* tarafında isteğe bağlı bir argümana sahip olan yerleşik ``range()`` fonksiyonudur! Diğer bir örnek ise her zaman birlikte belirtilmesi gereken iki argümandan oluşan bir gruba sahip olan ``curses.window.addch()`` fonksiyonudur. (Argümanlar ``x`` ve ``y`` olarak adlandırılır; fonksiyonu ``x`` değerini girerek çağırırsanız, ``y`` değerini de girmeniz gerekir ve ``x`` değerini girmezseniz ``y`` değerini de giremezsiniz)

source: In any case, the goal of Argument Clinic is to support argument parsing for all existing CPython builtins without changing their semantics. Therefore Argument Clinic supports this alternate approach to parsing, using what are called *optional groups*. Optional groups are groups of arguments that must all be passed in together. They can be to the left or the right of the required arguments. They can *only* be used with positional-only parameters.
tr: Her durumda, Argüman Kliniği'nin amacı, anlamlarını değiştirmeden mevcut tüm CPython yerleşik bileşenleri için argüman ayrıştırmayı desteklemektir. Bu nedenle Argüman Kliniği *isteğe bağlı gruplar* olarak adlandırılan bu alternatif ayrıştırma yaklaşımını destekler. İsteğe bağlı gruplar, hepsi birlikte geçirilmesi gereken argüman gruplarıdır. Gerekli argümanların sağında veya solunda olabilirler. Yalnızca *konumsal* parametrelerle kullanılabilirler.

source: Optional groups are *only* intended for use when converting functions that make multiple calls to :c:func:`PyArg_ParseTuple`! Functions that use *any* other approach for parsing arguments should *almost never* be converted to Argument Clinic using optional groups. Functions using optional groups currently cannot have accurate signatures in Python, because Python just doesn't understand the concept. Please avoid using optional groups wherever possible.
tr: İsteğe bağlı gruplar *sadece* :c:func:`PyArg_ParseTuple`'a birden fazla çağrı yapan fonksiyonları dönüştürürken kullanılmak üzere tasarlanmıştır! Argümanları ayrıştırmak için *herhangi* bir başka yaklaşım kullanan fonksiyonlar *neredeyse hiçbir zaman* isteğe bağlı gruplar kullanılarak Argüman Kliniğine dönüştürülmemelidir. İsteğe bağlı gruplar kullanan fonksiyonlar şu anda Python'da doğru imzalara sahip olamaz, çünkü Python bu kavramı anlamıyor. Lütfen mümkün olan her yerde isteğe bağlı grupları kullanmaktan kaçının.

source: To specify an optional group, add a ``[`` on a line by itself before the parameters you wish to group together, and a ``]`` on a line by itself after these parameters. As an example, here's how ``curses.window.addch`` uses optional groups to make the first two parameters and the last parameter optional::
tr: İsteğe bağlı bir grup belirtmek için, birlikte gruplamak istediğiniz parametrelerden önce tek başına bir satıra ``[`` ve bu parametrelerden sonra tek başına bir satıra ``]`` ekleyin. Örnek olarak, ``curses.window.addch`` ilk iki parametreyi ve son parametreyi isteğe bağlı yapmak için isteğe bağlı grupları nasıl kullanır::

source: Notes:
tr: Notlar:

source: For every optional group, one additional parameter will be passed into the impl function representing the group. The parameter will be an int named ``group_{direction}_{number}``, where ``{direction}`` is either ``right`` or ``left`` depending on whether the group is before or after the required parameters, and ``{number}`` is a monotonically increasing number (starting at 1) indicating how far away the group is from the required parameters. When the impl is called, this parameter will be set to zero if this group was unused, and set to non-zero if this group was used. (By used or unused, I mean whether or not the parameters received arguments in this invocation.)
tr: Her isteğe bağlı grup için, grubu temsil eden impl fonksiyonuna bir ek parametre aktarılacaktır. Parametre ``group_{direction}_{number}`` adında bir int olacaktır; burada ``{direction}`` grubun gerekli parametrelerden önce veya sonra olmasına bağlı olarak ``right`` veya ``left`` şeklindedir ve ``{number}`` grubun gerekli parametrelerden ne kadar uzakta olduğunu gösteren monoton olarak artan bir sayıdır (1'den başlayarak). impl çağrıldığında, bu parametre, bu grup kullanılmamışsa sıfıra, bu grup kullanılmışsa sıfır olmayana ayarlanacaktır. (Kullanılmış veya kullanılmamış derken, parametrelerin bu çağrıda argüman alıp almadığını kastediyorum.)

source: If there are no required arguments, the optional groups will behave as if they're to the right of the required arguments.
tr: Gerekli argümanlar yoksa, isteğe bağlı gruplar gerekli argümanların sağındaymış gibi davranacaktır.

source: In the case of ambiguity, the argument parsing code favors parameters on the left (before the required parameters).
tr: Belirsizlik durumunda, argüman ayrıştırma kodu soldaki parametreleri (gerekli parametrelerden önce) tercih eder.

source: Optional groups can only contain positional-only parameters.
tr: İsteğe bağlı gruplar yalnızca konumsal parametreler içerebilir.

source: Optional groups are *only* intended for legacy code. Please do not use optional groups for new code.
tr: İsteğe bağlı gruplar *sadece* eski kod için tasarlanmıştır. Lütfen yeni kod için isteğe bağlı grupları kullanmayın.

source: Using real Argument Clinic converters, instead of "legacy converters"
tr: "Eski dönüştürücüler" yerine gerçek Argüman Kliniği dönüştürücülerinin kullanılması

source: To save time, and to minimize how much you need to learn to achieve your first port to Argument Clinic, the walkthrough above tells you to use "legacy converters". "Legacy converters" are a convenience, designed explicitly to make porting existing code to Argument Clinic easier. And to be clear, their use is acceptable when porting code for Python 3.4.
tr: Zamandan tasarruf etmek ve Argüman Kliniğine ilk portunuzu gerçekleştirmek için ne kadar çok şey öğrenmeniz gerektiğini en aza indirmek için, yukarıdaki kılavuz size "eski dönüştürücüleri" kullanmanızı söyler. "Eski dönüştürücüler", mevcut kodun Argüman Kliniği'ne taşınmasını kolaylaştırmak için tasarlanmış bir kolaylıktır. Ve açık olmak gerekirse, Python 3.4 için kod taşırken kullanımları kabul edilebilir.

source: However, in the long term we probably want all our blocks to use Argument Clinic's real syntax for converters. Why? A couple reasons:
tr: Ancak, uzun vadede muhtemelen tüm bloklarımızın Argüman Kliniği'nin dönüştürücüler için gerçek sözdizimini kullanmasını istiyoruz. Neden mi? Birkaç nedeni var:

source: The proper converters are far easier to read and clearer in their intent.
tr: Uygun dönüştürücülerin okunması çok daha kolay ve amaçları daha nettir.

source: There are some format units that are unsupported as "legacy converters", because they require arguments, and the legacy converter syntax doesn't support specifying arguments.
tr: "Eski dönüştürücüler" olarak desteklenmeyen bazı biçim birimleri vardır, çünkü bunlar argüman gerektirir ve eski dönüştürücü sözdizimi argüman belirtmeyi desteklemez.

source: In the future we may have a new argument parsing library that isn't restricted to what :c:func:`PyArg_ParseTuple` supports; this flexibility won't be available to parameters using legacy converters.
tr: Gelecekte :c:func:`PyArg_ParseTuple`'ın desteklediğiyle sınırlı olmayan yeni bir argüman ayrıştırma kütüphanemiz olabilir; bu esneklik eski dönüştürücüleri kullanan parametreler için mevcut olmayacaktır.

source: Therefore, if you don't mind a little extra effort, please use the normal converters instead of legacy converters.
tr: Bu nedenle, biraz fazladan çaba harcamaktan çekinmiyorsanız, lütfen eski dönüştürücüler yerine normal dönüştürücüleri kullanın.
