Repository: python/python-docs-tr
Catalog: howto/clinic.po
Languages: tr

source: This dumps the current contents of the named destination into the output of the current block, and empties it. This only works with ``buffer`` and ``two-pass`` destinations.
tr: Bu, adlandırılmış hedefin mevcut içeriğini geçerli bloğun çıktısına döker ve boşaltır. Bu sadece ``buffer`` ve ``two-pass`` hedefleri ile çalışır.

source: The second new directive is ``output``. The most basic form of ``output`` is like this:
tr: İkinci yeni yönerge ise ``output``. En temel ``output`` biçimi şöyledir:

source: This tells Clinic to output *field* to *destination*. ``output`` also supports a special meta-destination, called ``everything``, which tells Clinic to output *all* fields to that *destination*.
tr: Bu, Kliniğe *alan* çıktısını *hedefe* vermesini söyler. ``output`` ayrıca ``everything`` adı verilen ve Kliniğe *tüm* alanların çıktısını bu *hedefe* vermesini söyleyen özel bir meta hedefi de destekler.

source: ``output`` has a number of other functions:
tr: ``output`` bir dizi başka işleve sahiptir:

source: ``output push`` and ``output pop`` allow you to push and pop configurations on an internal configuration stack, so that you can temporarily modify the output configuration, then easily restore the previous configuration. Simply push before your change to save the current configuration, then pop when you wish to restore the previous configuration.
tr: ``output push`` ve ``output pop`` dahili bir yapılandırma yığınında yapılandırmaları itmenize ve açmanıza izin verir, böylece çıkış yapılandırmasını geçici olarak değiştirebilir ve ardından önceki yapılandırmayı kolayca geri yükleyebilirsiniz. Geçerli yapılandırmayı kaydetmek için değişikliğinizden önce push yapmanız, ardından önceki yapılandırmayı geri yüklemek istediğinizde pop yapmanız yeterlidir.

source: ``output preset`` sets Clinic's output to one of several built-in preset configurations, as follows:
tr: ``output preset`` Kliniğin çıkışını aşağıdaki gibi çeşitli yerleşik ön ayar yapılandırmalarından birine ayarlar:

source: Clinic's original starting configuration. Writes everything immediately after the input block.
tr: Kliniğin orijinal başlangıç yapılandırması. Giriş bloğundan hemen sonra her şeyi yazar.

source: Designed to write everything to the "clinic file" that it can. You then ``#include`` this file near the top of your file. You may need to rearrange your file to make this work, though usually this just means creating forward declarations for various ``typedef`` and ``PyTypeObject`` definitions.
tr: Yapabildiği her şeyi "klinik dosyasına" yazmak için tasarlanmıştır. Daha sonra bu dosyayı dosyanızın en üstüne yakın bir yere ``#include`` edersiniz. Bunun çalışması için dosyanızı yeniden düzenlemeniz gerekebilir, ancak genellikle bu sadece çeşitli ``typedef`` ve ``PyTypeObject`` tanımları için ileri bildirimler oluşturmak anlamına gelir.

source: Suppress the ``parser_prototype`` and ``docstring_prototype``, write the ``impl_definition`` to ``block``, and write everything else to ``file``.
tr: ``parser_prototype`` ve ``docstring_prototype`` öğelerini bastırın, ``impl_definition`` öğesini ``block`` öğesine yazın ve diğer her şeyi ``file`` öğesine yazın.

source: The default filename is ``"{dirname}/clinic/{basename}.h"``.
tr: Varsayılan dosya adı ``"{dirname}/clinic/{basename}.h"`` şeklindedir.

source: Save up most of the output from Clinic, to be written into your file near the end. For Python files implementing modules or builtin types, it's recommended that you dump the buffer just above the static structures for your module or builtin type; these are normally very near the end. Using ``buffer`` may require even more editing than ``file``, if your file has static ``PyMethodDef`` arrays defined in the middle of the file.
tr: Clinic'ten gelen çıktının çoğunu, sonuna yakın dosyanıza yazılmak üzere kaydedin. Modülleri veya yerleşik tipleri uygulayan Python dosyaları için, tamponu modülünüz veya yerleşik tipiniz için statik yapıların hemen üzerine boşaltmanız önerilir; bunlar normalde sona çok yakındır. Dosyanızın ortasında tanımlanmış statik ``PyMethodDef`` dizileri varsa, ``buffer`` kullanmak ``file`` kullanmaktan daha fazla düzenleme gerektirebilir.

source: Suppress the ``parser_prototype``, ``impl_prototype``, and ``docstring_prototype``, write the ``impl_definition`` to ``block``, and write everything else to ``file``.
tr: ``parser_prototype``, ``impl_prototype`` ve ``docstring_prototype`` öğelerini bastırın, ``impl_definition`` öğesini ``block`` öğesine yazın ve diğer her şeyi ``file`` öğesine yazın.

source: Similar to the ``buffer`` preset, but writes forward declarations to the ``two-pass`` buffer, and definitions to the ``buffer``. This is similar to the ``buffer`` preset, but may require less editing than ``buffer``. Dump the ``two-pass`` buffer near the top of your file, and dump the ``buffer`` near the end just like you would when using the ``buffer`` preset.
tr: Bu ``buffer`` ön ayarına benzer, ancak ileri bildirimleri ``two-pass`` tamponuna ve tanımları ``buffer`` tamponuna yazar. Bu ``buffer`` ön ayarına benzer, ancak ``buffer``'dan daha az düzenleme gerektirebilir. Dosyanızın üst kısmına yakın ``two-pass`` tamponunu boşaltın ve ``buffer`` ön ayarını kullanırken yaptığınız gibi sonuna yakın ``buffer``'ı boşaltın.

source: Suppresses the ``impl_prototype``, write the ``impl_definition`` to ``block``, write ``docstring_prototype``, ``methoddef_define``, and ``parser_prototype`` to ``two-pass``, write everything else to ``buffer``.
tr: ``impl_prototype``'ı bastırır, ``impl_definition``'ı ``block``'a yazar, ``docstring_prototype``, ``methoddef_define`` ve ``parser_prototype``'ı ``two-pass``'a yazar, diğer her şeyi ``buffer``'a yazar.

source: Similar to the ``buffer`` preset, but writes more things to ``block``, only writing the really big chunks of generated code to ``buffer``. This avoids the definition-before-use problem of ``buffer`` completely, at the small cost of having slightly more stuff in the block's output. Dump the ``buffer`` near the end, just like you would when using the ``buffer`` preset.
tr: ``buffer`` ön ayarına benzer, ancak ``block``'a daha fazla şey yazar, yalnızca oluşturulan kodun gerçekten büyük parçalarını ``buffer``'a yazar. Bu, bloğun çıktısında biraz daha fazla şey olması gibi küçük bir maliyetle, ``buffer``'ın kullanımdan önce tanımlama sorununu tamamen ortadan kaldırır. Tıpkı ``buffer`` ön ayarını kullanırken yaptığınız gibi, ``buffer``'ı sonuna doğru boşaltın.

source: Suppresses the ``impl_prototype``, write the ``docstring_definition`` and ``parser_definition`` to ``buffer``, write everything else to ``block``.
tr: ``impl_prototype`` ı bastırır, ``docstring_definition`` ve ``parser_definition`` ı ``buffer`` a yazar, diğer her şeyi ``block`` a yazar.

source: The third new directive is ``destination``:
tr: Üçüncü yeni yönerge ``destination`` dır:

source: This performs an operation on the destination named ``name``.
tr: Bu, ``name`` adlı hedef üzerinde bir işlem gerçekleştirir.

source: There are two defined subcommands: ``new`` and ``clear``.
tr: Tanımlanmış iki alt komut vardır: ``new`` ve ``clear``.

source: The ``new`` subcommand works like this:
tr: ``new`` alt komutu şu şekilde çalışır:

source: This creates a new destination with name ``<name>`` and type ``<type>``.
tr: Bu, adı ``<name>`` ve türü ``<type>`` olan yeni bir hedef oluşturur.

source: There are five destination types:
tr: Beş hedef türü vardır:

source: Throws the text away.
tr: Metni atıyor.

source: Writes the text to the current block. This is what Clinic originally did.
tr: Metni geçerli bloğa yazar. Kliniğin başlangıçta yaptığı budur.

source: A simple text buffer, like the "buffer" builtin destination above.
tr: Yukarıdaki "buffer" yerleşik hedefi gibi basit bir metin tamponu.

source: A text file. The file destination takes an extra argument, a template to use for building the filename, like so:
tr: Bir metin dosyası. Dosya hedefi, dosya adını oluşturmak için kullanılacak bir şablon olan ekstra bir argüman alır, aşağıdaki gibi:

source: destination <name> new <type> <file_template>
tr: hedef <isim> yeni <tip> <dosya_şablonu>

source: The template can use three strings internally that will be replaced by bits of the filename:
tr: Şablon dahili olarak dosya adının bitleriyle değiştirilecek üç dizge kullanabilir:

source: The full path to the file, including directory and full filename.
tr: Dizin ve tam dosya adı dahil olmak üzere dosyanın tam yolu.

source: The name of the directory the file is in.
tr: Dosyanın içinde bulunduğu dizinin adı.

source: Just the name of the file, not including the directory.
tr: Sadece dosyanın adı, dizin dahil değil.

source: Basename with the extension clipped off (everything up to but not including the last '.').
tr: Uzantısı kırpılmış temel ad (son '.' dahil olmak üzere her şey).

source: The last '.' and everything after it. If the basename does not contain a period, this will be the empty string.
tr: Son '.' ve ondan sonraki her şey. Ana ad nokta içermiyorsa, bu boş bir dize olacaktır.

source: If there are no periods in the filename, {basename} and {filename} are the same, and {extension} is empty. "{basename}{extension}" is always exactly the same as "{filename}"."
tr: Dosya adında nokta yoksa, {basename} ve {filename} aynıdır ve {extension} boştur. "{basename}{extension}" her zaman "{filename}" ile tamamen aynıdır."

source: A two-pass buffer, like the "two-pass" builtin destination above.
tr: Yukarıdaki "iki geçişli" yerleşik hedef gibi iki geçişli bir tampon.

source: The ``clear`` subcommand works like this:
tr: ``clear`` alt komutu şu şekilde çalışır:

source: It removes all the accumulated text up to this point in the destination. (I don't know what you'd need this for, but I thought maybe it'd be useful while someone's experimenting.)
tr: Hedefte bu noktaya kadar birikmiş tüm metni kaldırır. (Buna ne için ihtiyaç duyacağınızı bilmiyorum, ancak birileri deneme yaparken belki yararlı olabileceğini düşündüm).

source: The fourth new directive is ``set``:
tr: Dördüncü yeni yönerge ``set``'tir:

source: ``set`` lets you set two internal variables in Clinic. ``line_prefix`` is a string that will be prepended to every line of Clinic's output; ``line_suffix`` is a string that will be appended to every line of Clinic's output.
tr: ``set`` Klinikte iki dahili değişkeni ayarlamanızı sağlar. ``line_prefix``, Kliniğin çıktısının her satırına eklenecek bir dizedir; ``line_suffix``, Kliniğin çıktısının her satırına eklenecek bir dizedir.

source: Both of these support two format strings:
tr: Bunların her ikisi de iki biçim dizesini destekler:

source: Turns into the string ``/*``, the start-comment text sequence for C files.
tr: C dosyaları için başlangıç-yorum metin dizisi olan ``/*`` dizesine dönüşür.

source: Turns into the string ``*/``, the end-comment text sequence for C files.
tr: C dosyaları için yorum sonu metin dizisi olan ``*/`` dizesine dönüşür.

source: The final new directive is one you shouldn't need to use directly, called ``preserve``:
tr: Son yeni yönerge doğrudan kullanmanız gerekmeyen bir yönerge olup ``preserve`` olarak adlandırılmıştır:

source: This tells Clinic that the current contents of the output should be kept, unmodified. This is used internally by Clinic when dumping output into ``file`` files; wrapping it in a Clinic block lets Clinic use its existing checksum functionality to ensure the file was not modified by hand before it gets overwritten.
tr: Bu, Clinic'e çıktının mevcut içeriğinin değiştirilmeden tutulması gerektiğini söyler. Bu, çıktıyı ``file`` dosyalarına dökerken Clinic tarafından dahili olarak kullanılır; bunu bir Clinic bloğuna sarmak, dosyanın üzerine yazılmadan önce elle değiştirilmediğinden emin olmak için Clinic'in mevcut sağlama toplamı işlevini kullanmasını sağlar.

source: The #ifdef trick
tr: #ifdef hilesi

source: If you're converting a function that isn't available on all platforms, there's a trick you can use to make life a little easier. The existing code probably looks like this::
tr: Tüm platformlarda bulunmayan bir fonksiyonu dönüştürüyorsanız, hayatı biraz daha kolaylaştırmak için kullanabileceğiniz bir numara var. Mevcut kod muhtemelen şuna benzer::

source: And then in the ``PyMethodDef`` structure at the bottom the existing code will have:
tr: Ve sonra alttaki ``PyMethodDef`` yapısında mevcut kod olacaktır:

source: In this scenario, you should enclose the body of your impl function inside the ``#ifdef``, like so::
tr: Bu senaryoda, impl fonksiyonunuzun gövdesini aşağıdaki gibi ``#ifdef`` içine almalısınız::

source: Then, remove those three lines from the ``PyMethodDef`` structure, replacing them with the macro Argument Clinic generated:
tr: Ardından, bu üç satırı ``PyMethodDef`` yapısından kaldırın ve bunların yerine Argument Clinic makrosunu oluşturun:

source: (You can find the real name for this macro inside the generated code. Or you can calculate it yourself: it's the name of your function as defined on the first line of your block, but with periods changed to underscores, uppercased, and ``"_METHODDEF"`` added to the end.)
tr: (Bu makronun gerçek adını oluşturulan kodun içinde bulabilirsiniz. Ya da kendiniz hesaplayabilirsiniz: bloğunuzun ilk satırında tanımlanan fonksiyonunuzun adıdır, ancak noktalar alt çizgi olarak değiştirilir, büyük harfle yazılır ve sonuna ``"_METHODDEF"`` eklenir)

source: Perhaps you're wondering: what if ``HAVE_FUNCTIONNAME`` isn't defined? The ``MODULE_FUNCTIONNAME_METHODDEF`` macro won't be defined either!
tr: Belki de merak ediyorsunuzdur: ``HAVE_FUNCTIONNAME`` tanımlanmamışsa ne olur? ''MODULE_FUNCTIONNAME_METHODDEF'' makrosu da tanımlanmayacaktır!

source: Here's where Argument Clinic gets very clever. It actually detects that the Argument Clinic block might be deactivated by the ``#ifdef``. When that happens, it generates a little extra code that looks like this::
tr: Argüman Kliniği burada çok akıllıca davranır. Aslında Argüman Kliniği bloğunun ``#ifdef`` tarafından devre dışı bırakılabileceğini algılar. Bu olduğunda, şuna benzeyen küçük bir ekstra kod oluşturur::

source: That means the macro always works. If the function is defined, this turns into the correct structure, including the trailing comma. If the function is undefined, this turns into nothing.
tr: Bu, makronun her zaman çalıştığı anlamına gelir. İşlev tanımlıysa, bu, sondaki virgül de dahil olmak üzere doğru yapıya dönüşür. İşlev tanımlanmamışsa, bu hiçbir şeye dönüşmez.

source: However, this causes one ticklish problem: where should Argument Clinic put this extra code when using the "block" output preset? It can't go in the output block, because that could be deactivated by the ``#ifdef``. (That's the whole point!)
tr: Ancak bu, can sıkıcı bir soruna neden olmaktadır: Argüman Kliniği "blok" çıktı ön ayarını kullanırken bu ekstra kodu nereye koymalıdır? Çıkış bloğuna koyulamaz, çünkü ``#ifdef`` tarafından devre dışı bırakılabilir. (Bütün mesele bu!)

source: In this situation, Argument Clinic writes the extra code to the "buffer" destination. This may mean that you get a complaint from Argument Clinic:
tr: Bu durumda, Argüman Kliniği ekstra kodu "tampon" hedefine yazar. Bu, Argüman Kliniği'nden bir şikayet almanız anlamına gelebilir:

source: When this happens, just open your file, find the ``dump buffer`` block that Argument Clinic added to your file (it'll be at the very bottom), then move it above the ``PyMethodDef`` structure where that macro is used.
tr: Bu olduğunda, dosyanızı açın, Argüman Kliniği'nin dosyanıza eklediği ``dump buffer`` bloğunu bulun (en altta olacaktır), ardından bu makronun kullanıldığı ``PyMethodDef`` yapısının üzerine taşıyın.

source: Using Argument Clinic in Python files
tr: Python dosyalarında Argüman Kliniği kullanma

source: It's actually possible to use Argument Clinic to preprocess Python files. There's no point to using Argument Clinic blocks, of course, as the output wouldn't make any sense to the Python interpreter. But using Argument Clinic to run Python blocks lets you use Python as a Python preprocessor!
tr: Aslında Python dosyalarını önceden işlemek için Argüman Kliniği kullanmak mümkündür. Argüman Kliniği bloklarını kullanmanın bir anlamı yok elbette, çünkü çıktı Python yorumlayıcısı için bir anlam ifade etmeyecektir. Ancak Python bloklarını çalıştırmak için Argüman Kliniği'ni kullanmak Python'u bir Python önişlemcisi olarak kullanmanızı sağlar!

source: Since Python comments are different from C comments, Argument Clinic blocks embedded in Python files look slightly different. They look like this:
tr: Python yorumları C yorumlarından farklı olduğu için, Python dosyalarına gömülü Argüman Kliniği blokları biraz farklı görünür. Şöyle görünürler:
