Repository: python/python-docs-tr
Catalog: installing/index.po
Languages: tr

source: Installing Python Modules
tr: Python Modüllerini Kurmak

source: Email
tr: E-posta

source: As a popular open source development project, Python has an active supporting community of contributors and users that also make their software available for other Python developers to use under open source license terms.
tr: Popüler bir açık kaynak geliştirme projesi olarak Python, yazılımlarını diğer Python geliştiricilerinin açık kaynak lisansı koşulları altında kullanmasını sağlayan, katkıda bulunanlardan ve kullanıcılardan oluşan aktif bir destekleyici topluluğa sahiptir.

source: This allows Python users to share and collaborate effectively, benefiting from the solutions others have already created to common (and sometimes even rare!) problems, as well as potentially contributing their own solutions to the common pool.
tr: Bu, Python kullanıcılarının etkin bir şekilde paylaşımda bulunmasına ve işbirliği yapmasına, başkalarının yaygın (ve hatta bazen nadir!) sorunlara yönelik oluşturduğu çözümlerden faydalanmasına ve potansiyel olarak ortak havuza kendi çözümleriyle katkıda bulunmasına olanak tanır.

source: This guide covers the installation part of the process. For a guide to creating and sharing your own Python projects, refer to the :ref:`distribution guide <distributing-index>`.
tr: Bu kılavuz, sürecin kurulum kısmını kapsar. Kendi Python projelerinizi oluşturma ve paylaşma kılavuzu için :ref:`distribution rehberine <distributing-index>` 'a bakın.

source: For corporate and other institutional users, be aware that many organisations have their own policies around using and contributing to open source software. Please take such policies into account when making use of the distribution and installation tools provided with Python.
tr: Kurumsal kullanıcılar, birçok kuruluşun açık kaynak yazılımları kullanma ve bunlara katkıda bulunma konusunda kendi politikaları olduğunu unutmayın. Python ile sağlanan dağıtım ve kurulum araçlarını kullanırken lütfen bu tür politikaları dikkate alın.

source: Key terms
tr: Anahtar terimler

source: ``pip`` is the preferred installer program. Starting with Python 3.4, it is included by default with the Python binary installers.
tr: ``pip``, tercih edilen yükleyici programıdır. Python 3.4'ten başlayarak, varsayılan olarak Python ikili yükleyicilerine dahil edilmiştir.

source: A *virtual environment* is a semi-isolated Python environment that allows packages to be installed for use by a particular application, rather than being installed system wide.
tr: *virtual environment*, paketlerin sistem genelinde kurulmak yerine belirli bir uygulama tarafından kullanılmak üzere kurulmasına izin veren yarı izole bir Python ortamıdır.

source: ``venv`` is the standard tool for creating virtual environments, and has been part of Python since Python 3.3. Starting with Python 3.4, it defaults to installing ``pip`` into all created virtual environments.
tr: ``venv``, sanal ortamlar oluşturmaya yönelik standart bir araçtır ve Python 3.3'ten beri Python'un bir parçasıdır. Python 3.4'ten başlayarak, ``pip`` 'in tüm oluşturulan sanal ortamlara yüklenmesi varsayılandır.

source: ``virtualenv`` is a third party alternative (and predecessor) to ``venv``. It allows virtual environments to be used on versions of Python prior to 3.4, which either don't provide ``venv`` at all, or aren't able to automatically install ``pip`` into created environments.
tr: ``virtualenv``, ``venv`` 'in üçüncü taraf alternatifidir (ve öncülüdür). ``venv`` 'i hiç sağlamayan veya oluşturulan ortamlara ``pip`` 'i otomatik olarak yükleyemeyen 3.4'ten önceki Python sürümlerinde sanal ortamların kullanılmasına izin verir.

source: The `Python Package Index <https://pypi.org>`__ is a public repository of open source licensed packages made available for use by other Python users.
tr: `Python Package Index <https://pypi.org>`__, diğer Python kullanıcılarının kullanımına sunulan, açık kaynaklı lisanslı paketlerin halka açık bir deposudur.

source: the `Python Packaging Authority <https://www.pypa.io/>`__ is the group of developers and documentation authors responsible for the maintenance and evolution of the standard packaging tools and the associated metadata and file format standards. They maintain a variety of tools, documentation, and issue trackers on both `GitHub <https://github.com/pypa>`__ and `Bitbucket <https://bitbucket.org/pypa/>`__.
tr: `Python Packaging Authority <https://www.pypa.io/>`__, standart paketleme araçlarının ve ilişkili meta veri ve dosya biçimi standartlarının bakımından ve geliştirilmesinden sorumlu geliştiriciler ve belge yazarları grubudur. Hem `GitHub <https://github.com/pypa>`__ hem de `Bitbucket <https://bitbucket.org/pypa/>`__ 'ta çeşitli araçlar, dokümantasyon ve sorun izleyicileri bulundururlar.

source: ``distutils`` is the original build and distribution system first added to the Python standard library in 1998. While direct use of ``distutils`` is being phased out, it still laid the foundation for the current packaging and distribution infrastructure, and it not only remains part of the standard library, but its name lives on in other ways (such as the name of the mailing list used to coordinate Python packaging standards development).
tr: ``distutils``, Python standart kitaplığına ilk olarak 1998 yılında eklenen orijinal oluşturma ve dağıtım sistemidir. ``distutils`` 'in doğrudan kullanımı aşamalı olarak kaldırılırken, mevcut paketleme ve dağıtım altyapısının temelini atmaya devam etmektedir, ve yalnızca standard kütüphanenin bir parçası olmakla kalmamakla birlikte adı başka şekillerde de yaşıyor (Python paketleme standartlarının geliştirilmesini koordine etmek için kullanılan posta listesinin adı gibi).

source: The use of ``venv`` is now recommended for creating virtual environments.
tr: Artık sanal ortamlar oluşturmak için ``venv`` 'in kullanılması önerilir.

source: `Python Packaging User Guide: Creating and using virtual environments <https://packaging.python.org/installing/#creating-virtual-environments>`__
tr: `Python Paketleme Kullanıcı Kılavuzu: Sanal ortamları oluşturma ve kullanma <https://packaging.python.org/installing/#creating-virtual-environments>`__

source: Basic usage
tr: Temel kullanım

source: The standard packaging tools are all designed to be used from the command line.
tr: Standart paketleme araçlarının tümü, komut satırından kullanılmak üzere tasarlanmıştır.

source: The following command will install the latest version of a module and its dependencies from the Python Package Index::
tr: Aşağıdaki komut, bir modülün en son sürümünü ve bağımlılıklarını Python Paket Dizininden yükleyecektir::

source: For POSIX users (including macOS and Linux users), the examples in this guide assume the use of a :term:`virtual environment`.
tr: POSIX kullanıcıları için (macOS ve Linux kullanıcıları dahil), bu kılavuzdaki örneklerde bir :term:`virtual environment` kullanıldığı varsayılmıştır.

source: For Windows users, the examples in this guide assume that the option to adjust the system PATH environment variable was selected when installing Python.
tr: Windows kullanıcıları için bu kılavuzdaki örneklerde, Python yüklenirken sistem PATH ortam değişkenini ayarlama seçeneğinin seçildiği varsayılmaktadır.

source: It's also possible to specify an exact or minimum version directly on the command line. When using comparator operators such as ``>``, ``<`` or some other special character which get interpreted by shell, the package name and the version should be enclosed within double quotes::
tr: Doğrudan komut satırında tam veya minimum bir sürüm belirtmek de mümkündür. ``>``, ``<`` gibi karşılaştırma operatörleri veya kabuk tarafından yorumlanan diğer bazı özel karakterler kullanılırken, paket adı ve sürüm çift tırnak içine alınmalıdır::

source: Normally, if a suitable module is already installed, attempting to install it again will have no effect. Upgrading existing modules must be requested explicitly::
tr: Normalde, uygun bir modül zaten kuruluysa, onu tekrar kurmayı denemenin bir etkisi olmaz. Mevcut modüllerin yükseltilmesi açıkça talep edilmelidir::

source: More information and resources regarding ``pip`` and its capabilities can be found in the `Python Packaging User Guide <https://packaging.python.org>`__.
tr: ``pip`` ve yapabilecekleri hakkında daha fazla bilgi ve kaynak `Python Paketleme Kullanıcı Kılavuzu <https://packaging.python.org>`__ 'nda bulunabilir.

source: Creation of virtual environments is done through the :mod:`venv` module. Installing packages into an active virtual environment uses the commands shown above.
tr: Sanal ortamların oluşturulması, :mod:`venv` modülü aracılığıyla yapılır. Paketleri aktif bir sanal ortama kurmak, yukarıda gösterilen komutları kullanır.

source: `Python Packaging User Guide: Installing Python Distribution Packages <https://packaging.python.org/installing/>`__
tr: `Python Paketleme Kullanıcı Kılavuzu: Python Dağıtma Paketlerini Kurma <https://packaging.python.org/installing/>`__

source: How do I ...?
tr: Nasıl yapabilirim ...?

source: These are quick answers or links for some common tasks.
tr: Bunlar, bazı genel görevler için hızlı cevaplar veya bağlantılardır.

source: ... install ``pip`` in versions of Python prior to Python 3.4?
tr: ... ``pip`` 'i Python 3.4'ten önceki Python sürümlerinde kurmalı mı?

source: Python only started bundling ``pip`` with Python 3.4. For earlier versions, ``pip`` needs to be "bootstrapped" as described in the Python Packaging User Guide.
tr: Python, ``pip`` 'i yalnızca Python 3.4 ile paketlemeye başladı. Önceki sürümler için, ``pip`` 'in Python Paketleme Kullanıcı Kılavuzu'nda açıklandığı gibi "önyüklenmesi" gerekir.

source: `Python Packaging User Guide: Requirements for Installing Packages <https://packaging.python.org/installing/#requirements-for-installing-packages>`__
tr: `Python Paketleme Kullanıcı Kılavuzu: Paketleri Kurmak için Gerekenler <https://packaging.python.org/installing/#requirements-for-installing-packages>`__

source: ... install packages just for the current user?
tr: ... sadece mevcut kullanıcı için paketler kurabilirim?

source: Passing the ``--user`` option to ``python -m pip install`` will install a package just for the current user, rather than for all users of the system.
tr: ``--user`` seçeneğinin ``python -m pip install`` 'e geçirilmesi, sistemin tüm kullanıcıları yerine yalnızca geçerli kullanıcı için bir paket yükleyecektir.

source: ... install scientific Python packages?
tr: ... bilimsel Python paketleri kurabilirim?

source: A number of scientific Python packages have complex binary dependencies, and aren't currently easy to install using ``pip`` directly. At this point in time, it will often be easier for users to install these packages by `other means <https://packaging.python.org/science/>`__ rather than attempting to install them with ``pip``.
tr: Bir dizi bilimsel Python paketinin karmaşık ikili bağımlılıkları vardır ve şu anda doğrudan ``pip`` kullanılarak kurulumu kolay değildir. Bu noktada, kullanıcıların bu paketleri ``pip`` ile kurmaya çalışmak yerine `başka yollar <https://packaging.python.org/science/>`__ ile kurması genellikle daha kolay olacaktır.

source: `Python Packaging User Guide: Installing Scientific Packages <https://packaging.python.org/science/>`__
tr: `Python Paketleme Kullanıcı Kılavuzu: Bilimsel Paketler Kurma <https://packaging.python.org/science/>`__

source: ... work with multiple versions of Python installed in parallel?
tr: ... paralel olarak yüklenmiş birden çok Python sürümüyle çalışabilirim?

source: On Linux, macOS, and other POSIX systems, use the versioned Python commands in combination with the ``-m`` switch to run the appropriate copy of ``pip``::
tr: Linux, macOS ve diğer POSIX sistemlerinde, ``pip`` 'in uygun kopyasını çalıştırmak için ``-m`` anahtarıyla birlikte sürümlü Python komutlarını kullanın::

source: Appropriately versioned ``pip`` commands may also be available.
tr: Uygun sürüme sahip ``pip`` komutları da mevcut olabilir.

source: On Windows, use the ``py`` Python launcher in combination with the ``-m`` switch::
tr: Windows'ta, ``py`` Python başlatıcısını ``-m`` anahtarıyla birlikte kullanın::

source: Common installation issues
tr: Genel yükleme sorunları

source: Installing into the system Python on Linux
tr: Python'u Linux'te sisteme kurmak

source: On Linux systems, a Python installation will typically be included as part of the distribution. Installing into this Python installation requires root access to the system, and may interfere with the operation of the system package manager and other components of the system if a component is unexpectedly upgraded using ``pip``.
tr: Linux sistemlerinde, dağıtımın bir parçası olarak genellikle bir Python kurulumu dahil edilir. Bu Python kurulumuna paket yüklemek, sisteme root erişimi gerektirir ve bir bileşen beklenmedik bir şekilde ``pip`` kullanılarak güncellenirse, sistem paketi yöneticisinin ve sistemin diğer bileşenlerinin çalışmasına müdahale edebilir.

source: On such systems, it is often better to use a virtual environment or a per-user installation when installing packages with ``pip``.
tr: Bu tür sistemlerde, ``pip`` ile paketleri kurarken sanal ortam veya kullanıcı başına kurulum kullanmak genellikle daha iyidir.

source: Pip not installed
tr: Pip yüklü değil

source: It is possible that ``pip`` does not get installed by default. One potential fix is::
tr: ``pip`` 'in varsayılan olarak yüklenmemesi mümkündür. Bir olası düzeltme::

source: There are also additional resources for `installing pip. <https://packaging.python.org/en/latest/tutorials/installing-packages/#ensure-pip-setuptools-and-wheel-are-up-to-date>`__
tr: `pip'i yüklemek <https://packaging.python.org/en/latest/tutorials/installing-packages/#ensure-pip-setuptools-and-wheel-are-up-to-date>`__ için ek kaynaklar da vardır.

source: Installing binary extensions
tr: İkili uzantıları yükleme

source: Python has typically relied heavily on source based distribution, with end users being expected to compile extension modules from source as part of the installation process.
tr: Python tipik olarak büyük ölçüde kaynak tabanlı dağıtıma güvenmiştir ve son kullanıcıların kurulum sürecinin bir parçası olarak uzantı modüllerini kaynaktan derlemesi beklenir.

source: With the introduction of support for the binary ``wheel`` format, and the ability to publish wheels for at least Windows and macOS through the Python Package Index, this problem is expected to diminish over time, as users are more regularly able to install pre-built extensions rather than needing to build them themselves.
tr: İkili ``wheel`` formatı için desteğin sunulması ve Python Paket Dizini aracılığıyla en azından Windows ve macOS için wheel'lar yayınlanabilmesi ile, kullanıcılar önceden oluşturulmuş uzantıları kendileri inşa etmek yerine daha düzenli bir şekilde yükleyebildiğinden bu sorunun zaman içinde azalması bekleniyor.

source: Some of the solutions for installing `scientific software <https://packaging.python.org/science/>`__ that are not yet available as pre-built ``wheel`` files may also help with obtaining other binary extensions without needing to build them locally.
tr: `Bilimsel yazılımı <https://packaging.python.org/science/>`__ yüklemek için önceden oluşturulmuş (pre-built) ``wheel`` dosyaları olarak henüz mevcut olmayan çözümlerden bazıları, diğer ikili uzantıları yerel olarak kurmaya gerek kalmadan edinmeye de yardımcı olabilir.

source: `Python Packaging User Guide: Binary Extensions <https://packaging.python.org/extensions/>`__
tr: `Python Paketleme Kullanıcı Kılavuzu: İkili Uzantılar <https://packaging.python.org/extensions/>`__
